  [
  {
    "first": "Sharonda",
    "last": "Arnold",
    "default": true,
    "id": "A7XmG6",
    "age": 32,
    "residence": "Durham, NC",
    "occupation": "Not Specified",
    "interviewLocation":"Durham Bus Station",
    "interviewDate":"July 28, 2016",
    "duration": "7:03",
    "quote": "I remember people saying that this is the year that the Lord is gonna come. I’m a young girl, so I’m like, “Oh, I want to live my life! I want to live my life!'",
    "transcript":"audio/Arnold, Sharonda_072816.pdf",
    "audio":"./audio/Arnold_compressed.mp3",
    "text": "So I’ve already told you a little about what this about without saying too much. So 1999 becomes the year 2000. New Year’s Eve. Put my on that day. Tell me what you remember. So 1999… New Year’s Eve before the year 2K. I remember people pulling their money out of the bank. [laughs] And they said that the banks were not going to understand what year it was. So the money is gonna get lost. I remember people being very afraid. The biggest thing was people thought that either that either the banks were gonna crash or the world was gonna end in 2000 [laughs] So yeah, I just remember a lot of people being afraid and uncertain as to what the year 2000 was going to bring. My father himself he pulled out like all of his money out of the bank, except about a thousand dollars. Wow. Yeah. So what did he do with it, keep it in the house? SA: He just kept it in the house [laughs]. He was convinced that something…because everybody was talking about it. He was convinced that his money could potentially get lost. Do you remember how he felt the next day? [laughs] No, I don’t. I don’t. I just remember the conversation. I just remember the conversation before. So you were in high school then? Yes, ’99… I was born in ’83, so yeah. So do you remember what you were doing that night? Um. I believe that I was just in the house. I was actually afraid, too, because everybody was saying it was so uncertain what was going to happen in the next year. I wasn’t convinced that it was going to be like, this big, like shut down in the banks and the markets, I just was a little fearful because everybody else was. Well, when your dad is taking out all of his money…Yeah [laughs]. So, that was my experience. But then, when we woke up and the year 2000 was here, and nothing was wrong, I was like [Sharonda makes an exaggerated sound of relief] 'Woo.' [laughs hard]. Do you remember other New Years, like before then? I’m just trying to get a frame of reference? To see if you remember that one a lot better than the other ones? Yeah, definitely. I remember that one because everybody was scared that year. I mean, the other ones that I would potentially remember are because I was doing something amazing like bringing it in. But other than that, I don’t have a real vivid picture of the New Years from, you know, ninety….That is my most vivid New Year.Do you remember, was it only because of the Y2K bug, or do you remember people thinking, like, for religious reasons or whatever, that the world might end at that time? Sharonda’s eyes light up in surprise, as if she has just remembered something that she had long forgotten.Yes! Yes. Tell me about that. I just remember like people saying that this is the year that the Lord is gonna come. You know, I’m a young girl, so I’m like [high-pitched, pleading voice] “Oh, I want to live my life! I want to live my life.” But I just remember in the churches, they were…the message that they were preaching is that God is coming back. So I remember being very afraid, like 'Oh my God. It’s gonna be 2000…' Now, they were saying this at your church? No, no, just in churches in general. Like, God is coming back. They weren’t saying that in the year 2000 was coming, that he was coming back. But they were saying that God was coming back, so that was the message that was preached in 1999. So I was under the assumption with that being the message that was preached, that in 2000 that’s what was going to happen. So it was just scary. [laughs hard] And then relief, right? Yeah. It was scary, and then relief, in the year…yeah. So let me ask you this. If a young kid came up to you right now, who was too young to remember that time at all, and said, “What was life like in 1999?” What would you tell him or her? In 1999, for me, it was…you know, I was still in high school, so it was really fun for me. Toward the end of 1999, it was scary because everybody had evoked fear in everybody, whether it was the fear of the markets were gonna crash, or it was the fear that all of your money was gonna get lost in the banks, or the fear that, you know, it was…that the world was coming to an end. [laughs] Do you remember, because that was really when the internet was starting to take off, cell phones came out, do you remember when you had your first experiences with that kind of stuff? Like, sending emails, or getting a cell phone? Um, I remember when I got my first cell phone. It was my freshman year in college. And I remember, in my freshman year in college, which was a few years later, in 2001, but I remember the first time that I actually saw somebody with a cell phone in their car. [laughs]. It was humungous. No, it was, it wasn’t just…My father had a phone in the car that was like, it was a big phone. But It didn’t work. But the first time I actually saw somebody riding in the car talking on the phone, it was like a really huge phone. And I was like, “Oh my god, why does he have that cordless house phone on his head?” [laugh] Cordless house phone. This cordless house phone on his head. But yeah, that was…yeah. What about the internet? Because you were in college right when that – Right. So, no, we had internet prior to college, but what I remember most is AOL. The [Sharonda imitates the sound of a modem] 'EHHHHHH!' [laughs hard] So yeah, I didn’t really start sending emails until I got to college in 2001. But I do remember going on the internet and really being amazed at how I could just search for anything. You’re like the third person, that when they’re sharing their memories, has made that sound. Sharonda laughs. Really? And I’ve gotten a couple of people that have said, “You’ve got mail.” [laughs] Yeah, that was it. That was it, that was it. Yeah, yeah. It’s funny, that like you probably can’t remember names, dates, or anything, but you remember that sound. Because it meant, “Hey, good, I’m on now, finally.” Yeah, it did. It did. “You’ve got mail.” And I still have my AOL account, and people are like [mocking voice] “You still use AOL?” You still use the email address? Well, I still have my email address and I still use it sometimes. I use it when I’m like signing up for those seven days, de-cluttering your life, I use that email address. People are like, “Wow! This is from the 90s! Are we gonna get a Bell Biv DeVoe song next?” Yeah. And then they say, “You know that AOL has issues with people, you know, breaking in…it’s not as secure as Gmail.” So they’re like, “I’m not sending you anything to that email account."
  },
   {
    "first": "Needham",
    "last": "Bass",
    "id": "aqE5vSnzG6ZeZ",
    "age": 64,
    "residence": "Durham, NC",
    "occupation": "Sales and Marketing Executive",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "8:58",
    "quote": "I remember very vividly, being part of history. I thought, 'I’m going to be one of the few people that was born almost in the middle of the last century and with some luck I might make it close to the middle of this century. And that’s a unique group to be in.'",
    "transcript":"audio/Bass, Needham_073016.pdf",
    "audio":"./audio/Bass_compressed.mp3",
    "text": "So you’ve seen the sign and it piqued your curiosity, hopefully. This is called the Millennium Memory Project. It’s trying to get a better understanding of people’s memories from he turn of the millennium. So let’s just start on a personal level. Walk me back to that day and tell me what you remember about it. I remember worrying about whether the computers were going to default because of the date situation. I mean, we’d spent a whole week prior to that getting everything ready, and trying to archive things, going through all kinds of stupid procedures, which turned out to be a whole lot to do about nothing. And I also remember very vividly, being part of history. I mean, when you’re in your 20 and 30s, you don’t really think about turning into a new millennium, and then, I thought, when it happened, I thought, “I’m going to be one of the few people that was born almost in the middle of the last century and with some luck I might make it close to the middle of this century. And that’s a unique group to be in.” And the actual day, my wife and I were glued to the TV -- I can’t remember which channel it was -- but they covered celebrations, starting in Australia, going around the world. So we spent almost 24 hours enjoying the turn, and the most moving one was the Aborigines celebrating it in Australia. Needham begins to cry. I didn’t know this was going to make me feel like this. So…it was just so moving to see all these different cultures celebrate something that really is a turning point in history. Because we’re not going to live to see another one. There may be some of us out here, but I won’t. I’m glad I was able to enjoy this one. And when midnight approached, do you remember that vividly? Um, I remember kissing my wife [laugh]. And drinking champagne; real fine, French champagne.You already said this, but I just wanted to clarify: You were living in Durham at the time, right? Yep. What were you doing for a living then? I am in sales and marketing for independent grocery stores. Everybody was worried that all of their cash registers and anything that was connected to computers was going to default. People don’t really realize how many people were worried about that. People thought coffee-making machines and everything were going to default, and I don’t think a single thing did [laughs]. Which is kind of silly. It’s not silly at all, and you’re probably…nine out of ten people, that’s been the salient memory that came from that. Now, you mentioned the sense that you felt privileged to have reached that milestone. What about it, other than the date changing, made it seem so special? Well, you start thinking about, you’re part of history. There’s only certain number of people that are able to live in this. And it’s all happenstance of when you’re born. And there is a definite change between this century and the last century. Living in the 20th century, as progressive as people were, no one ever thought that a black man would ever become the president of the United States. And lo and behold, eight years later, things changed. And that’s just one of the things. No one would have ever thought that people would be accepting of people of different sexual orientations. And now, it’s passé. I mean, people are much more open, and it’s not to say everything is great, but I do think there’s just something about turning into the new century, that maybe people opened their minds just a bit, and became a little more accepting and open about the fact that we’re progressing. And we should progress. So you feel things have gotten better since then? Yes, but I’m not wearing rose-colored glasses. They’re not anywhere near where they should be. Everybody kicks and screams when changes come. But I do think the 21st century is the 21st century; it’s not the 20th. So do you think -- and you’ve touched on this -- but do you think the fact that it changed to a new millennium precipitated this change to some degree, or this would have, could have, happened at another point in history? That’s a tough question. I don’t know. I would like to think that maybe there’s just something about human nature that when we pass milestones, we get a little more open-minded, but who’s to say? So take me back – and this will be the last question – walk me through a day in 1999 and compare it to now, as far as technology, and your daily life, how it’s changed. Well, in 1999, you thought things were really, really advanced, but computers are so much faster…I mean, there’s more computing power in a smart phone than there was in the computer I was using in my business, and I was managing close to $2 million everyday. You look back on it, and I think, “Gee whiz, it’s so antiquated.” You know, we did very little on the Internet. It was just a novelty at that time, or nothing like it is.In your line of work, is that when things sort of – the fulcrum point – is that when things changed toward Internet-based? Yeah. I mean, I used to go out and drive miles to see people, and now, it’s a click of a button, and it’s like you’re sitting there with them. And everybody is so dependent on it. That’s what they want you to do. When you actually have to go see them face-to-face, it’s a novelty. They enjoy it, and I enjoy it, but it’s basically a waste of time. Do you think it attracts different people in that line of work now? Um, it does. And that has some good sides and some bad sides. At least in my line of business, you’ve got people that are very smart, but they haven’t had the actual physical contact with what my job entails. And sometimes they know the technology, but they don’t know the nuts and bolts of what it actually is. But you know, I’m on the end of my career, and I’ll let the next crowd figure it out. Last question: you got emotional there. You don’t have to pick any wounds; I certainly don’t want you to. But why do you think you got emotional about it? Well, it’s not picking…there’s no wounds to pick. Okay, I wasn’t sure. I did get very emotional, close to crying, and I think it’s because, you know, I won’t live to see the next one. I wish I could. And if I do, by some chance, live that long...That’ll be another conversation, right there. [laugh] [laugh] I probably won’t be aware of it. But you know, I lived at a certain point in history that I own. And it’s something that I can talk about, and as long as I have a memory, I can talk about the memories of it. So it is kind of emotional. Well said."
  },
     {
    "first": "Sadie",
    "last": "Bower",
    "id": "5qeaLRJP64Qy",
    "age": 41,
    "residence": "Carrboro, NC",
    "occupation": "Not Specified",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "2:46",
    "quote": "We went into a diner, and we had pancakes and 2:00 am. And we watched the street cleaners pick up all of the confetti, and in fact, the world had not come to an end, and everybody was still around, and Times Square was still cooking.",
    "transcript":"audio/Bower, Sadie_080616.pdf",
    "audio":"./audio/Bower_compressed.mp3",
    "text": "So take a minute to think about that, New Year’s Eve 1999, going into the [booming voice] year 2000. Paint a picture for us. What do you remember? I lived in New York City. I know. It was not as glamorous as you think it would be, though. Why do you say that? I had some friends visiting and we went down to Times Square, but not at midnight, after midnight. And… That had to be a weird scene. It was pretty weird, actually. There was confetti everywhere, and there was trash all over the streets. And we went into a diner, and we had pancakes and 2:00 am. And we watched the street cleaners pick up all of the confetti, and in fact, the world had not come to an end, and everybody was still around, and Times Square was still cooking, and that’s pretty much what I remember. Now, you can be honest. Did you really think something might happen? No. I didn’t actually think anything would happen. So you didn’t take any preparations for the Y2K bug? I didn’t, but I’m not terribly tech-savvy, so I wouldn’t have known what to do, had I been worried about it [laughs]. Yeah. No, I mean, I’ve had conversations with people that took all their money out of the bank, and all sorts of...Wow. Oh yeah. Yeah, no, I did not do any of that. I guess I would have been out of luck had my bank account shut down [laughs]. Or any of that not work. Besides the Y2K, did it seem important to you? Well, it seemed lucky to be alive at a turning point in history. And it seemed cool and interesting. But it didn’t seem important in terms of the computers and the things that people were focusing on. It seemed historical. Interesting. “Lucky to be alive,” you’re not the first person to say that. Okay. And this, like I said, is for kind of a time capsule, so you never know who is going to listen to it down the road. Let me ask you this: What will people be talking about in the year 2100? Oh, wow. Let’s see, what will they be talking about...Most often.Hmm. Climate change. [laughs] For better or for worse? I’m hoping for better, but I fear for worse. Yeah. Yeah. Well, hopefully, the archive will be around, meaning that things haven’t totally gone down the toilet.Yes, that’s right. Hopefully they’ll have a really cool way of listening to it. Yeah. [laughs]."
  },
  {
    "first": "Lawrence",
    "last": "Chadbourne",
    "id": "wGtzrZd8m7pg",
    "age": 68,
    "residence": "Carrboro, NC",
    "occupation": "Not Specified",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "5:12",
    "quote": "I was living in San Francisco, and I remember there was a lot of stuff in the media about how people expected all sorts of disasters to happen.",
    "transcript":"audio/Chadbourne, Lawrence_080616.pdf",
    "audio":"./audio/Chadbourne_compressed.mp3",
    "text": "So you know a little about the project. Think of it in your mind, let the images come to mind, take us back to New Year’s Eve 1999, anything and everything that you remember about the turn, it becoming the year 2000. Okay, I was living in San Francisco, and I remember there was a lot of stuff in the media about how people expected all sorts of disasters to happen. And I don’t know how much stock I took in it at the time, but I was aware that people were very worked up about it, especially in a place like San Francisco, which was very cutting-edge in Internet, techie world. What were you doing for a living? I was actually working for a company that did restaurant advertising at the time. I’m retired now, but that’s what I was doing at the time. And I remember not really taking it all that seriously, and then being somewhat relieved after the fact when it turned out nothing, nothing that I can recall, really happened that was that disastrous or momentous. So I kind of look back at it and think, “What was all the fuss about?” And then I think about how dates are very arbitrary, like we assign decades and years and we kind of bracket these things that happen within this time frame together, but sometimes there’s really no meaning to it. Well, it being the year 2000 was arbitrary. Yeah. because it was a sixth century monk that created...And I think there was some talk about that at the time. It wasn’t technically. Like, 'Is it really a millennium?' and all that. And then people talked -- people with longer memories -- talked about the medieval millennium and what people thought at the time, and I guess there was something similar happening back then. So did the moment seem personally important to you at all? I would say it was overblown. I’m just really trying to remember like, what did I do for New Year’s Eve? Did I do anything special? Or...[laughs] not that I can recall. Well, you have an interesting perspective on this because most of the people I’ve talked to, given the geographic location, were in the South at the time. And they’ve had some very interesting memories about…some people remember, you know, being in church and talking about the end of the world, and all sorts of things. I’m interested. You were in San Francisco...Right. And with Y2K, that’s an interesting perspective on things.  That’s what they called it, yeah, that’s right. Thanks for reminding me. [laughs] So being in that area, being in Silicon Valley, what do you remember about people’s thoughts on that at the time? Well, I hadn’t really gotten all wired up yet. Being of a somewhat older generation, I didn’t even get a computer until four years ago. So I wasn’t really into like the whole social media thing, which I think was starting up. That was later, yeah. Was it a little later?  A little bit later, but yeah. But there was a lot more attention paid to something like that because of social media, I think, then there would be earlier, when there wouldn’t have been as much, you know, back and forth discussion about it. But I’m just sorry to say, otherwise I don’t remember. But you (unintelligible) in coming by here, you reminded me, “Oh yes, there was a millennium. Oh yeah.” [laughs] Forgot there was a millennium, yeah. So I’m kind of throwing cold water on your face. Oh, not at all. It’s just as interesting when people don’t remember, because you get a unique take on it, you know. Why? But also being older, I may walk back home and suddenly something will come back to me, you know, say 'Oh, I wish I had told him that.' Yeah. Well, that’s another thing is that it’s a topic that I ask, I broach the topic, and people are like, 'You know, I haven’t thought about that in ages.' Let’s see, who was president? Was that still Clinton? Yes. Yeah, okay. That was the last Clinton. That was the last term. It was right after he had just survived impeachment. Oh, okay. Well, see now you’re giving me historical context that I had forgotten. And it was before the dot com bubble crashed. Right. Really crashed hard. Before the crash, and was there a war going on? I can’t remember. Isn’t there always? Seems to be, yeah. All right. Well, let me ask the last thing. So this is sort of a time capsule piece, because it’s going into this collection, and who knows where it may be down the road. What do you think will be the topic on people’s minds, what will people be talking about the most in the year 2100? 2100...If we’re still around. [laughs] Um…it’s sort far off, I can’t say. I mean, every time people try to predict things, so many years in advance, they usually get it wrong.  Did the year 2000 seem like you thought it would be, when it actually came? Um, I’m going to have to think about that one. I don’t remember really having any particular expectations about it. I just remember, as you said, the fuss about the millennium and what could happen. So when you were a kid, you didn’t think there’d be flying cars and stuff by the year 2000? Um, you know, we watched these science fiction programs and cartoons. I remember one of the things people got excited about was that you’d be able to talk to someone on the telephone and see them, and apparently that technology existed, but nothing much was ever really done with it. Now, of course there’s Skype, which I haven’t really used. But it doesn’t seem to be that people, as I said, always get it right what’s going to happen. Anyway, nice to talk to you. Best of luck with your project. Thanks for the water."
  },
    {
    "first": "Christina",
    "last": "Not Given",
    "id": "vGy6YCb5",
    "age": 34,
    "residence": "Carey, NC",
    "occupation": "Not Specified",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "2:46",
    "quote": "I was living in Tokyo, Japan, at that time. And I lived in Shibuya, and Shibuya is like the Times Square of Tokyo. And just remembering like, 'Will the world end when it hit midnight?'",
    "transcript":"audio/Christina_073016.pdf",
    "audio":"./audio/Christina_compressed.mp3",
    "text": "You’ve already said that you’re limited as far as what what you personally remember, but take me back to that day, and think about – personally and in general – what stands out in your mind from that moment? I do remember the scare of Y2K. I was living in Tokyo, Japan, at that time. And I lived in Shibuya, and Shibuya is like the Times Square of Tokyo. And just remembering like, “Will the world end when it hit midnight?” I remember that pretty well. We were out in the streets. The countdown. The fireworks and so forth. So it was pretty cool. So you do remember it. I do remember, but it’s not like vivid memories of, like, the differences between now and then. So your family was living in Tokyo? Correct. I was a senior in high school. Were you going to an American school? Yeah, I was going to the American School in Japan. What do you remember about the cultural mindset at that time in Japan? How were people feeling and thinking? There was a lot of scare. I will admit there was a lot of scare, between like…because everything there is so technology based. And then, just the mood of Y2K, and them assuring everybody the world’s not actually going to end. There’s not going to be total chaos when computers, the next day, will not be working. I think the assurance that New Zealand and all those countries had a couple of hours ahead, and they didn’t start breaking down, led to the fact that, you know, Tokyo just a couple hours behind, will be okay.  I had totally forgotten that. Somebody I spoke with earlier said that they watched each country at the time zones change, and I had forgotten how seeing those first ones change over and be okay, was a big difference. Yeah. I imagine things were somewhat different in Japan, as far as the technology and everything. Do you remember what technology was like then, and compare it to now, as far as internet use, and cell phone? So when I graduated high school, I could tell a huge difference. I graduated high school and then moved to the States for college. So that was pretty much a six-month period between New Year’s and me coming to college here in North Carolina. And when I came back to the States, the technology was like, three years behind. Completely. Like, they already had cell phones that had cameras on it. I came back here, and I barely had a flip phone that had color. So, like the fact that they already had cameras on their cell phones, was completely different. I had been texting friends on the phone since, like, my freshman year of high school, since like 1996. They called it Sky Mail. So we were texting back and forth back then, and then coming here, and people were like, “What? Texting?” It was just like a step back, completely. That’s interesting. So do you think it affected the culture, too? Oh, a hundred percent. Everything was super fast-paced. You were always accessible, because you were never home. People don’t…Here, I feel like…I feel like it’s changed a little bit, but back then, when there wasn’t cell phones, weren’t accessible, people were at home, or people said where they were going. There, people just said, 'Call me on my mobile.' So it was like three years back? At least, at least. It was a culture shock when I moved to the States. How long were you in Japan? I was there for 10 years. So I grew up over there. So some of your first memories are in Japan. Yeah. Do you remember there being a mindset in Japan – beyond just technology, but maybe from more of a religious perspective – that people thought that really, the world was going to end? Or is that more of an American phenomenon? Um, I think it was more, maybe not the end, but like, the chaos of trying to fix it as fast as possible. I don’t think…I think the US thought more of doomsday, versus the Japanese of, “This is going to be a pain to fix if it actually happens.” How are Japanese New Year’s celebrations in general, in any given year, different from America? Um, it’s more religious. Everybody goes to the temple. And so you have the bonfire with the temples, and you throw a prayer arrow into the fire. You ring the bell; you say prayers. So it’s more religious-based, it’s more ceremonial than here, where you kind of, like, get to someone’s house, drink some beer, kiss on New Years.  [laughs] You’re saying that’s not religious?  [laughs] Um, not really. [sarcastic voice] In some parts of the country..."
  },
  {
    "first": "Rob",
    "last": "Crook",
    "id": "B8cQQxfSz",
    "age": 52,
    "residence": "Carrboro, NC",
    "occupation": "Biologist",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "8:39",
    "quote": "I think the human beings of 1000 AD are pretty much the same as the human beings of today.",
    "transcript":"audio/Crook, Rob_080616.pdf",
    "audio":"./audio/Crook_compressed.mp3",
    "text": "All right, so you said you don’t remember a lot. But take a second and think about it. What do you remember about that moment? You know, I remember the Y2K scare that was going on regarding computers, and how everything was going to possibly shut down, and how civilization was going to be horribly thrown back into a dark age of pre-computer era, when we only had paper to work with. And you know, that’s about the only specific memory I have from that era. I know that we were out, you know, on New Year’s Eve, that we probably stayed out until about 11:00. Then we probably went to bed. Because you had, you said, young children at the time? I had, at the time of the millennium change, I had one daughter, and she would have been a year and a half old. So, yeah. So she was 18 months old, so yeah. And we never really hired babysitters at that point that much. I mean, we went out, she went out with us. It would have probably been hard to get a babysitter that night. And it would have been hard to get a babysitter that night, because we never planned ahead, either [laughs]. The daughter is not part of that M.O...No, no. That would be the parents M.O. only. No, I meant having the daughter. Oh, having the daughter. [laughs] ‘We don’t plan ahead...' Exactly. So, aside from Y2K and the possible technological problems, did the moment seem important to you at all? Um, yeah, it did. I’m a history buff, and so I do remember reading a lot things about the history of the previous millennium change. At 1000 A.D., or whatever it is, After Current Era, AC, After Current…whatever they call it now. But you know, how everybody thought the world was going to end after the first millennium. They had same social phenomenon of, you know, ‘This is the end time. Jesus is going to come back and take over and rule the world, and you know, we’re all either going to go to Heaven or Hell.’ So it was…I mean, there were –- And it happened again in 2000. It happened again. It just...it was very, very similar, when you look at the historical –- Do you think the Y2K bug just made it even worse? I do. I think that was sort of the bogie man that everybody sort of pinned a lot of their anxiety on. Instead of having it be this battle between, you know, God and Satan, it was between Y2K bug and, you know, order and being able to go online and shop. So yeah. I think there were a lot of similarities. We haven’t changed much. [laughs] Now why do you say that? I think humans are still humans. I think the human beings of 1000 AD are pretty much the same as the human beings of today.  Now, some people have said that the way we communicate and the way we interact with each other has changed because of the technology. It doesn’t sound like you feel that way. No, because you’re still talking about the same –- Rob sees someone he knows and quickly says hello before going to back to the interview. No, because I think in the end, it’s still biology, and that you still have a random assortment of genetic pairings. So there is no diff—we’re still the same material. You have an interesting take. What do you do for a living? I’m a biologist. Okay. I build a lot of things that clean up water. That’s what I do for a living. So yeah, no, I think we’re not evolving. I think we’re the same people that we were 2000 years ago, 5000 years ago.  Interesting. So you’re not, you don’t prescribe to the ‘Google effect’ changing the wiring of our brains? It hasn’t been around long enough to reproduce, when you’ve got one generation. So… But do you think it might, down the road? Sure, it might, just like the car and modern medicine has allowed people to live that wouldn’t have…I mean, technology has changed, and certainly there are people alive now that wouldn’t have been alive, you know, even a hundred years ago, because of disease and famine and all these other things. But essentially, we’re still the same material. We’re still the same genetic material. We’re still the same species. Still bipedal animals that...Yep. Selfish memes. Or no, genes. I mean, yeah, we haven’t really evolved morally or ethically or spiritually. We’re still, you know, I think we’re still the same people. And you’re just the same people all over the world. Okay, so that leads to a question I’ve asked several other people, because this is kind of a time capsule thing. You’re a biologist, so you’ll have an interesting take on this. What do you think is going to be most often on people’s lips, on the conversation, in 2100? 2100? [Pause] I think it’s probably going to be...not human beings [laughs] being alive on Earth. That’s interesting. And I actually agree with you. So do you think we’re going to move beyond our corporeal existence at some point? [sighs] Again, you know, its like…there’s a guy named Tielhard de Chardin, who was a Catholic existentialist, who kept on saying that mankind -- to use the phrase of the late 1800s, early 1900s -- was going to evolve towards this ‘X-Man.’ That we were evolving morally and ethically towards this higher plane. And when you do random assortment of genetics, you’re constantly staying at the same plane. So I think that yeah, I think that we do have the potential to rise above a corporeal existence. And maybe some people have, but I think very few people will be able to achieve that. So you don’t think that we’ll exist just as code, in the ether? No, no, no. I don’t think as code, I think as...I mean, I do think that…ultimately, at the very base of my soul, I don’t know what the ultimate reality is of the universe. I don’t know if there’s a God. I don’t know if there’s not a God. And so, I’m sort of left with the idea of...I think that there is a higher power, that there’s a higher reality that’s going on that we don’t always become aware of. But that I do think that very few of us are ever going to be able to realize what that is.  Interesting. Including me. [laughs] So, if the world ends before 2100 or at any time, does it end with a bang or a whimper? I think it ends with a whimper. I think it ends with heat death. I think we’ve got -- Heat death? Heat death. It’s an old -- it’s a classic painting from 1800s, and it represents the system in physics where everything goes towards enthalpy. Where there’s a system, if it does not have energy put into it constantly, ultimately, will become disorganized and fall apart. And so then the lowest form of energy in the universe is heat. Heat energy. And so there’s this like, portrait, a picture of the Earth that this guy came up with called ‘Heat Death,’ where everybody is sort of walking around on a barren, naked plain. That’s easy to picture, actually. Yeah. And I think that that’s really…I mean, I think that we need to stop making weapons, we need to stop killing each other. That would be the first thing that we could do, today. I don’t know why, when we’re all so connected, why are we even putting resources into weapons, when we could just say, ‘No, let’s put this into schools, let’s put this into water systems, let’s put this into food production, solar energy, renewable energy.’ And let’s stop worrying about how can we wax each other. I mean, I’ve lived around different parts of the world, and it’s just, people still don’t trust each other, and people hate each other. I didn’t even ask. Where were you living on New Year’s Eve 1999? I was in North Carolina, yeah. At that time, I was in North Carolina. So yeah, I was here."
  },
   {
    "first": "Mark",
    "last": "Duncan",
    "id": "GH8Pq5r82sVzh",
    "age": 60,
    "residence": "North Carolina",
    "occupation": "Gun shop owner",
    "interviewLocation":"The Pier at Garden City (Murrell's Inlet, SC)",
    "interviewDate":"July 20, 2016",
    "duration": "8:38",
    "quote": "I slept at my business because I was worried about security.",
    "transcript":"audio/Duncan-Johnson_072016.pdf",
    "audio":"./audio/Duncan and Johnson_compressed.mp3",
    "text": "Like I said, I’m talking to people about their memories from when it changed from 1999 to the year 2000. Tell me what you remember personally about that night, New Year’s Eve 1999. MD: I remember all the bad things they predicted could happen, but didn’t happen. AJ: With the computers, the whole crashing. Do you remember where you were? MD: I remember because I slept at my business because I was worried about security. Really? MD: Yeah. Was that a choice, or did you have to – MD: Yeah, that was a choice. I made that choice. When we heard computers go down and everything, the whole world was gonna change, and my business is a high-security product anyway. So I just thought it would be best to sleep there. If something did happen, I wanted to be there. So you thought there was a legitimate chance that something could happen? MD: Yeah, I didn’t buy into it a hundred percent, but I didn’t want to be the village idiot at the same time. So I slept there, and nothing happened, so [laughs]. That’s probably my biggest memory of that time period. I take it you don’t ordinarily sleep in the office, right? MD: No, no. I sure don’t. Did you do anything else to get ready for it? MD: Not really. You know, we had our computers checked by so-called experts, and everybody assured us everything would be fine. And it was. But it was worrisome at the time. Did you have other co-workers with you in the office that night? MD: No, I was enough. Angel laughs. Do you remember how you felt the next day? MD: Sleepy, because I didn’t sleep good [laughs]. To tell you the truth of it. [to Angel] How about you? Do you remember much about that night? AJ: Not quite to that extreme, but I just remember I was at home, went to bed, and I remember just thinking, “Okay, we’ll see what happens tomorrow.” Woke up and everything of course was just fine. So it’s another day. Angel sees a shark in the ocean. I joke about a group of paddle-boarders in the water nearby and mention that my brother-in-law saw a shark while paddle-boarding the previous day. Now that you’ve been thinking back on the turn of the last century, 1999 into now, how do you think things have changed since then? AJ: Worse.  MD starts to talk, then stops: Go ahead. AJ: I was just gonna say, for the worse. Why do you say that? AJ: I think morals and values have declined. I think politics isn’t about the people anymore. I mean, it just like there’s so much more negative. [to Mark] What about you? MD: I think the cell phone and the computer technology, the whole world’s changed. My whole business runs off of it, and I don’t know of many businesses that don’t anymore. So you are doing pretty much the same thing now that you were then? MD: Yeah. Sure am. So you’ve probably seen it change immensely. MD: Yeah, I mean everything is done on computer now. I sit at a desk and probably accomplish the same thing that I used to be on the phone for hours and hours with. Waiting for phone calls, or trying to return phone calls. Now it’s all done on the internet. So you think things have changed mostly for the good, or the bad? MD: I guess it’s better. I’m more efficient. You know, I can come down here on vacation and bring my computer, and it’s just like I’m sitting in my office. AJ: But then there’s the negative: having to come down here and bring your computer. Never being able to get away. AJ: Yeah. MD: You never get away. I mean, the office is in your pocket. MD: And your phone follows you everywhere. I just had to check email before I came up to you all. Had to respond to my boss. [laugh] MD: Yep. Any other thoughts about that time? MD: I really can’t think of anything. That’s just part of the main thing I do remember, is all of the hype of what could have happened, but didn’t happen. Do you remember people thinking the world was really going to end? Not even Y2K, but because it was the new millennium and all that? MD: Yeah, there were people doing that, and that’s why I was concerned enough to sleep at my business. AJ [to MD]: What about gun sales? Were they up? MD: Yeah, they were. I couldn’t hear them clearly and asked them to repeat. AJ: Gun sales. We have a gun shop. MD: That’s the business we’re in. We sell guns. Wow. So did you notice some sale changes back then – MD: Yeah, there was definitely an up-kick in sales right around that time period, leading up to it. What about the type of guns that people were buying? MD: You know, the news media always portrays that as everybody’s buying AR-15’s and semi-automatics, but really when some kind of panic does hit, or some kind of fear thing does hit, it’s usually generally across the board, just gun sales increase. Hunting guns, hunting rifles, handguns, shotguns, rifles. It’s a cross-section of what we sell. So now that I know more about your business, it makes perfect sense that you were sleeping in your office that night.  [laugh] MD: Yeah, if the alarms didn’t work, I wanted to be there to protect what I owned. Yeah, absolutely. So you still have the same shop? MD: Yes, sir. Other than the technology, how has the business changed from then to now? Or has it changed at all? MD: It’s changed a lot. I mean probably the biggest change is just everyday functions, is the internet. How we use it in every aspect of our business. But the restrictions, and I guess, exactly how we’re monitored is much more strict than it had ever been. The ATF audits are strict. They’re very thorough. They come in there, and instead of just going through your books quickly, they’re usually there for days. They go through every transaction you made since the last time they audited. It’s very thorough, which is a positive thing, because if we’re doing something wrong, we want to know we’re doing something wrong and be able to correct it. But at least in my business, it’s much more thorough than it’s ever been. [to AJ] You said that you think with morals and those sorts of things, things have gotten worse since 1999? AJ: Yeah.  Anything specific that jumps into your mind that makes you say that? Or is technology part of that, with the internet and everything? AJ: Yeah, I think it’s just the internet and the technology, people putting stuff out there anonymously, that they can say anything and there’s no retribution for it. There’s no consequences. Like on Facebook. I mean, you see people just saying anything that comes to their mind and they never even think about how it’s affecting anybody because they’re doing it anonymously. And they’re by themselves. And they’re sharing private thoughts. I don’t know, it’s just changed everybody’s way of thinking. You couldn’t be as anonymous back then. AJ: Exactly. And you couldn’t reach so many people with your thoughts, either. I don’t know, it’s just the whole generality of it. There’s so many different parts of it. Do you remember sending your first email or getting your first cell phone? MD: Oh yeah. I sure do. It was a big deal. Now I hate to hear it go off. ‘Aw, not again.’ AJ: Well, we remember the famous words, “You have mail.” You know, when you cranked up AO -- when the dial-up finally kicked in and AOL comes on. And you heard that sound [I make the screeching sound of a modem]. AJ: Yeah, and it actually was nice when you heard it then. Now, it’s like, ‘Oh man, I got mail to answer.’ So now it’s more of a negative."
  },
     {
    "first": "Angel",
    "last": "Johnson",
    "id": "9sqdB9GCuvS",
    "age": 43,
    "residence": "North Carolina",
    "occupation": "Gun shop owner",
    "interviewLocation":"The Pier at Garden City (Murrell's Inlet, SC)",
    "interviewDate":"July 20, 2016",
    "duration": "8:38",
    "quote": "I remember the famous words, 'You have mail.' When the dial-up finally kicked in and AOL comes on.",
    "transcript":"audio/Duncan-Johnson_072016.pdf",
    "audio":"./audio/Duncan and Johnson_compressed.mp3",
    "text": "Like I said, I’m talking to people about their memories from when it changed from 1999 to the year 2000. Tell me what you remember personally about that night, New Year’s Eve 1999. MD: I remember all the bad things they predicted could happen, but didn’t happen. AJ: With the computers, the whole crashing. Do you remember where you were? MD: I remember because I slept at my business because I was worried about security. Really? MD: Yeah. Was that a choice, or did you have to – MD: Yeah, that was a choice. I made that choice. When we heard computers go down and everything, the whole world was gonna change, and my business is a high-security product anyway. So I just thought it would be best to sleep there. If something did happen, I wanted to be there. So you thought there was a legitimate chance that something could happen? MD: Yeah, I didn’t buy into it a hundred percent, but I didn’t want to be the village idiot at the same time. So I slept there, and nothing happened, so [laughs]. That’s probably my biggest memory of that time period. I take it you don’t ordinarily sleep in the office, right? MD: No, no. I sure don’t. Did you do anything else to get ready for it? MD: Not really. You know, we had our computers checked by so-called experts, and everybody assured us everything would be fine. And it was. But it was worrisome at the time. Did you have other co-workers with you in the office that night? MD: No, I was enough. Angel laughs. Do you remember how you felt the next day? MD: Sleepy, because I didn’t sleep good [laughs]. To tell you the truth of it. [to Angel] How about you? Do you remember much about that night? AJ: Not quite to that extreme, but I just remember I was at home, went to bed, and I remember just thinking, “Okay, we’ll see what happens tomorrow.” Woke up and everything of course was just fine. So it’s another day. Angel sees a shark in the ocean. I joke about a group of paddle-boarders in the water nearby and mention that my brother-in-law saw a shark while paddle-boarding the previous day. Now that you’ve been thinking back on the turn of the last century, 1999 into now, how do you think things have changed since then? AJ: Worse.  MD starts to talk, then stops: Go ahead. AJ: I was just gonna say, for the worse. Why do you say that? AJ: I think morals and values have declined. I think politics isn’t about the people anymore. I mean, it just like there’s so much more negative. [to Mark] What about you? MD: I think the cell phone and the computer technology, the whole world’s changed. My whole business runs off of it, and I don’t know of many businesses that don’t anymore. So you are doing pretty much the same thing now that you were then? MD: Yeah. Sure am. So you’ve probably seen it change immensely. MD: Yeah, I mean everything is done on computer now. I sit at a desk and probably accomplish the same thing that I used to be on the phone for hours and hours with. Waiting for phone calls, or trying to return phone calls. Now it’s all done on the internet. So you think things have changed mostly for the good, or the bad? MD: I guess it’s better. I’m more efficient. You know, I can come down here on vacation and bring my computer, and it’s just like I’m sitting in my office. AJ: But then there’s the negative: having to come down here and bring your computer. Never being able to get away. AJ: Yeah. MD: You never get away. I mean, the office is in your pocket. MD: And your phone follows you everywhere. I just had to check email before I came up to you all. Had to respond to my boss. [laugh] MD: Yep. Any other thoughts about that time? MD: I really can’t think of anything. That’s just part of the main thing I do remember, is all of the hype of what could have happened, but didn’t happen. Do you remember people thinking the world was really going to end? Not even Y2K, but because it was the new millennium and all that? MD: Yeah, there were people doing that, and that’s why I was concerned enough to sleep at my business. AJ [to MD]: What about gun sales? Were they up? MD: Yeah, they were. I couldn’t hear them clearly and asked them to repeat. AJ: Gun sales. We have a gun shop. MD: That’s the business we’re in. We sell guns. Wow. So did you notice some sale changes back then – MD: Yeah, there was definitely an up-kick in sales right around that time period, leading up to it. What about the type of guns that people were buying? MD: You know, the news media always portrays that as everybody’s buying AR-15’s and semi-automatics, but really when some kind of panic does hit, or some kind of fear thing does hit, it’s usually generally across the board, just gun sales increase. Hunting guns, hunting rifles, handguns, shotguns, rifles. It’s a cross-section of what we sell. So now that I know more about your business, it makes perfect sense that you were sleeping in your office that night.  [laugh] MD: Yeah, if the alarms didn’t work, I wanted to be there to protect what I owned. Yeah, absolutely. So you still have the same shop? MD: Yes, sir. Other than the technology, how has the business changed from then to now? Or has it changed at all? MD: It’s changed a lot. I mean probably the biggest change is just everyday functions, is the internet. How we use it in every aspect of our business. But the restrictions, and I guess, exactly how we’re monitored is much more strict than it had ever been. The ATF audits are strict. They’re very thorough. They come in there, and instead of just going through your books quickly, they’re usually there for days. They go through every transaction you made since the last time they audited. It’s very thorough, which is a positive thing, because if we’re doing something wrong, we want to know we’re doing something wrong and be able to correct it. But at least in my business, it’s much more thorough than it’s ever been. [to AJ] You said that you think with morals and those sorts of things, things have gotten worse since 1999? AJ: Yeah.  Anything specific that jumps into your mind that makes you say that? Or is technology part of that, with the internet and everything? AJ: Yeah, I think it’s just the internet and the technology, people putting stuff out there anonymously, that they can say anything and there’s no retribution for it. There’s no consequences. Like on Facebook. I mean, you see people just saying anything that comes to their mind and they never even think about how it’s affecting anybody because they’re doing it anonymously. And they’re by themselves. And they’re sharing private thoughts. I don’t know, it’s just changed everybody’s way of thinking. You couldn’t be as anonymous back then. AJ: Exactly. And you couldn’t reach so many people with your thoughts, either. I don’t know, it’s just the whole generality of it. There’s so many different parts of it. Do you remember sending your first email or getting your first cell phone? MD: Oh yeah. I sure do. It was a big deal. Now I hate to hear it go off. ‘Aw, not again.’ AJ: Well, we remember the famous words, “You have mail.” You know, when you cranked up AO -- when the dial-up finally kicked in and AOL comes on. And you heard that sound [I make the screeching sound of a modem]. AJ: Yeah, and it actually was nice when you heard it then. Now, it’s like, ‘Oh man, I got mail to answer.’ So now it’s more of a negative."
  },
       {
    "first": "James Thomas",
    "last": "Emery",
    "id": "3N3c4L",
    "age": 72,
    "residence": "Caldwell, NC",
    "occupation": "Farmer",
    "interviewLocation":"Orange County Senior Center",
    "interviewDate":"July 14, 2016",
    "duration": "9:31",
    "quote": "I go to church every Sunday at New Year’s Eve. We have what they call Watch Night service from 8 to 12, every New Year’s night. Pray the old year in.",
    "transcript":"audio/Emery, James_071416.pdf",
    "audio":"./audio/Emery_compressed.mp3",
    "text": "So you’ve already heard the gist of what’s going on. 1999, what’s the first thing that pops into your memory about that time, when things changed from 1999 to the year 2000? I think it was the impression on the finance things, that wasn’t all that great on finance. And then, 2000, that’s when everything went sour. Were you working as a farmer back then? I’ve always farmed on the farm I’m on now. But I worked for the phone company in Durham, too. I was with Verizon for 34 years. But I’ve always farmed on my granddaddy’s farm. Were you working for the phone company in 1999? Yeah, I was working from ’79 to 2004. Do you remember anything that they did because of that Y2K bug? Do you remember the Y2K bug? Where the computers, the date changing over – Yeah, they took all of that. We had a bunch of crises where they went down and everything else. Oh, you actually remember some mishaps? Yeah, they went down, the computers went down. They changed systems one time, and they got another system, because it went down. What were you doing for the phone company? Engineering. Wow, so you were really in the thick of that. Well, I drawed cable...I worked storm damage when Hugo came through. I had to go to Monroe. We worked 12-hour days, seven days a week. I’m from Charleston. I remember that. I think we spent a month and a half there. Seven days a week. So you said that computers went down because of that Y2K bug, was that when they were trying to prepare for it, or was this after? Um, I don’t remember how they done it, but they all crashed down at Markham. We lost a bunch of prints and I had to go back and pull the old things out and re-put them in it. I do remember that. I spoke with you earlier. You said that you don’t remember that New Year’s Eve...Not, just as far as it being New Year’s Eve, I don’t, but. Do you typically do anything on New Year’s Eve, or just stay home? I go to church every Sunday at New Year’s Eve. We have what they call Watch Night service from 8 to 12, every New Year’s night. Pray the old year in.  But you didn’t attend that night? Yeah, I go all the time, but it’s nothing that special, we have it every year.  So you don’t remember, but you were probably there? I was at church. I’ve been going ever since 1991, so I know we had it, because we had it every year. What denomination was that again? Gospel Baptist Tabernacle. It’s right here on Orange Grove Road, right there at 40. And what do you typically do at the New Year’s Eve service? They have six or seven different preachers, preach the old year out and the new year in. I smile and repeat his line; he repeats it, too. Do they have some special sermons for New Year’s? Yeah, well they have six to seven different preachers, from about 7:30 to 12:30. They have something to eat; they break at 10:00 and go back after they get through and eat what’s left. Do you remember people in the church being worried about starting the new millennium, about it becoming a new century? I...don’t know. I can’t say one way or the other. So you don’t remember any preachers talking about it? No, I don’t know. I know that this past New Year’s, they said we were living in the Last Days, of Christ. Most of them did. That was this last year? Said we’re living in the last days. Said America is getting worse and worse, but the answers and all that [unintelligible]. God took his hand off America. So I don’t know, but I know, there’s a whole lot of...there’s more mess then there’s ever been before. So do you feel like it’s worse than it was back in the 1990s? Well, as far as violence and storms and everything else, yeah. We have a whole lot more floods...See, if you look back in November, you seen houses going down the Mississippi River, and you didn’t see that before. When the rains came through, a lot of the preachers brought that up. God was putting his hand on it, doing what he can and can’t do. So I don’t know. As a farmer, have you noticed things change in your line of work, since the 1990s until now? Yeah, we’ve had...well, you always have droughts, but we’ve had more rain this year where I’m at then we’ve ever had before. So I mean, there’s no doubt about it. We haven’t even gotten anything planted on my farm ‘cause it’s wet yet [?]. It’s been wet ever since we sprayed it in April; hasn’t been dry enough to plant. That’s rain. I bring up Watch Night again. Are there any other holidays where y’all gather for special services?  No, they have church every Wednesday night and Sunday night and every Sunday morning. I mean, it ain’t but two people there, the door’s gonna be open. Michelle helps me clarify the question, using Halloween as an example. No, I don’t think...we don’t have nothing on Halloween. Do you know why they call it Watch Night? No. I just know they’ve been doing it ever since I’ve been going over there. They’ve always had it. They have a good turnout. Most of the church comes; most of the church people come. Do you remember any other New Year’s, before or after that? Not really, because I always went to church ever since I’ve been going over there. What was your family situation like at the time? Were you married, did you have kids at home back then? Yeah, my second wife. She had two stepdaughters; all three of us were going to that church over there. Because I went to Little River Church in Caldwell until we got married. I was a Presbyterian; she was a Baptist. You can’t make a Baptist out of a Presbyterian. I make a joke about my wife and end the formal interview. Michelle joins the conversation and asks what James said. Rehash of the Watch Night service. I meant to ask this: did the service go through midnight every year? Oh yeah. That’s what you do. He starts praying about 10 minutes to 12. You pray the old year out, the new year in, ask God to bless you for the new year. They do it every year."
  },
      {
    "first": "Mary",
    "last": "Garren",
    "id": "BaK7H5UQ",
    "age": 71,
    "residence": "Chapel Hill, NC",
    "occupation": "Retired UNC administrator",
    "interviewLocation":"Carrboro Farmers' Marker",
    "interviewDate":"August 6, 2016",
    "duration": "11:10",
    "quote": "I had never been on a cruise, wasn’t too crazy about the idea of a cruise in the first place. But I was really fearful of being out in the middle of the ocean on a big old boat, and Y2K, haywire, and I could just imagine the catastrophe that could happen. And I didn’t want to be part of that.",
    "transcript":"audio/Garren, Mary_080616.pdf",
    "audio":"./audio/Garren_compressed.mp3",
    "text": "Hi, my name is Mary Garren, that’s G-A-R-R-E-N. I’m 71 years old, proud of it. I live in Chapel Hill, North Carolina. I’m currently retired, but at the turn of the century, I was an administrator in the financial aid office at UNC. And you’ve already said that you remember where you were, so take a minute, picture it in your mind, and then take us back to that day, that night, and tell us what you remember. Okay, so [laughs]. So I have to give you a kind of prequel to that night. Please do. Okay, so this was the Y2K hysteria. And everybody was concerned about what would happen when the clock changed; whether everything was gonna go haywire. I was in a relationship with a guy who wanted to go on a cruise during that period of time. And I had never been on a cruise, wasn’t too crazy about the idea of a cruise in the first place. But I was really fearful of being out in the middle of the ocean on a big ‘ole boat, and Y2K, haywire, and I could just imagine the catastrophe that could happen. And I didn’t want to be part of that. So I said no, and I, you know, was accused of being silly, that nothing was gonna happen, and I said, “Probably it won’t, but I don’t want to take a chance.” I don’t want to take a chance. So I didn’t go on that cruise. And of course, everything turned out all right. Y2K happened seamlessly as far as I can tell. So that night, of the New Year’s Eve, I think I -- along with a whole lot of other people -- were waiting and watching to see what was going to happen to the world when the clock changed. I honestly don’t remember where I was that night. It was kind of an anniversary in our relationship; it’s when we met, on a New Year’s Eve, so that was probably something going on related to that. But I honestly don’t remember anything except not wanting to go on that cruise that was gonna be taking place over the New Year’s Eve over that period of time. You didn’t want to be stranded in the middle of the Caribbean? No! I could visualize all kinds of things happening, you know? To systems on a ship that’s that big, I could just visualize total, total chaos and disaster. And I didn’t want to be part of that [laughs]. Interesting. Some might say that that’s a good place to be in that situation. You’re sequestered, sort of, away from the chaos. But I’m with you. I think that would be not an ideal situation. No. So I also remember, I think, getting some money out of the bank. I don’t remember how much it was. It wasn’t a huge amount of money; it was probably less than $500. But I remember getting money out of the bank because I was afraid that systems wouldn’t permit withdrawing money somehow. So that seemed to be important, to have cash available, if I had to purchase things, if cash registers didn’t work, you know? If I had to buy anything, anything I had to buy, I figured cash was going to be necessary if these things didn’t work. I figured they would work eventually, but they might not work for a week, or for some period of time. So I do remember taking cash [laughs] out of the bank to have on hand.Aside from the Y2K bug, did the moment seem important to you, and why or why not? Um...well, it was important from several standpoints, because anytime you kind of change centuries, that seems to have some significance, although today is really no different from January the 1st, when you think about it. It’s just another day. And there’s nothing magical really that happens, it’s all a construct, this whole calendar construct. So it’s kind of silly to think about that, practically speaking, but just the turn of the century seems significant, number one. And for me, you think of milestones in your life, and to be living when the turn of the century seems to be a big deal, because that milepost, that point in time, seems to be a reference to many things, many issues, many events, many things are use the turn of the century kind of thing, you know. We mark millennials; we mark all kinds of things related to the turn of the century. Interesting. And do you feel like your daily life has changed much since 1999? No, no, not really. I can’t say that it has. At 71 years old, I keep remarking about fast things are changing, especially technology-wise. When you think...I joke that when I went to work at UNC, in 1973, we had mimeograph machines. Now, you’re too young to – Oh, no, I vaguely remember. The carbon sheets, right? Sort of. There was a kind of purple ink thing, and there was a cylinder that you put this template on, that you would type on it. And then you would manually crank things out, and if you made one little mistake on that template, it was very difficult to correct it, and for it not to look like a correction and look like a mess. So I remember that. And I remember photocopy machines when it was kind of a thermafax paper, a special paper. Now that’s what I was thinking about. No, the mimeograph precedes that. And when I was in high school, and elementary school teachers, when they wanted to duplicate things, it was this cranking this template on a cylinder, you know? Cranking them out. And usually the print was a kind of purplish color. I don’t know why all that was, but that’s where I came from. So when you talk about cell phones, my first cell phone was something called a bag phone. The battery was probably, I don’t know, half the size of this poster you have here. You know, it was a bag phone. A lot of people have recalled that, when they were talking about this, those bag phones. You know, calculators. I remember when battery operated calculators were huge, and they were very expensive. So you think about, you know, I don’t feel 71, but a lot has developed over the course of that time, and it’s so fast. So now, we have this almost instant obsolescence. When we get a cell phone now, we’re waiting for the next one, which is gonna come out in five minutes, you know? There’s no longer, we’re no longer repairing things. We’re throwing them away and getting new things. That’s well said. This is so different, because my parents were older when they had me to start with, but they went through the Depression. So there was this ethic of saving and conserving, because people who went through the Depression, this was a huge, huge impact on people’s lives. So to this day, I save aluminum foil; I reuse aluminum foil. I reuse plastic bags. This is not in line with where our society is in general. When was the last time you saw an electronics repairman, you know, or – Actually, he came to my house. Oh, so you found one, wow. There’s actually a guy. I had a CD changer that needed to be repaired, okay. I shopped around, and I couldn’t find anything comparable for a reasonable price. There’s a guy in Pittsboro that has a mobile repair service. He came and picked up the CD changer, repaired it, and brought it back. Wow. It still exists. Now, when he ceases to do business, I’ll be taking that CD changer to the dump, and trying to buy another one, which won’t last five minutes. So I’ve seen huge, huge transitions in technology, in attitudes, in values over the course of these 71 years. Do you think the attitudes and values have changed just in the time since 1999? Um...I don’t want to put a political spin on this...Feel free. But I think what is so distressing to me is that through our instant media -- you know, you instantly know everything that’s happening, and people being able to put spins on everything -- that we are being unduly influenced by this current way of communicating, because people are taking advantage of this and influencing people in ways, that we used to be influenced, by our community and our churches and our schools. Now, we’re being influenced by anybody who wants to do it, in any way they want to do it and we’re not, we’re no...I don’t know, that’s changing to me and I don’t like it. So perhaps the way that we communicate has changed, and that’s affected how we…what we’re saying, perhaps. Yes, yes. And what we’re believing, and what we’re valuing. Interesting. What do you think people will be talking about in 2100? In 2100? [pause] Probably going to Mars. I like that. Colonizing Mars, something like that. I hope that’s what they’re talking about. I hope they’re not talking about the destruction of our planet as we know it. And they’re not talking about it in the past tense. Right. Right, that’s what I hope. We need to be talking about it now, in the present. Yes, exactly. Exactly."
  },
       {
    "first": "Michael",
    "last": "Gatlin",
    "id": "GCCcy5F3",
    "age": 23,
    "residence": "Durham, NC",
    "occupation": "7:43",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "",
    "quote": "I remember pay phones. Going to video stores, where you had to rent the movies and the games. I actually went and looked for one not too long ago, and they don’t exist anymore.",
    "transcript":"audio/Gatlin, Michael_073016.pdf",
    "audio":"./audio/Gatlin_compressed.mp3",
    "text": "Michael Gatlin, I’m 23, and I live in Durham. I’m originally from Georgia, though. I haven’t been here that long. What part of Georgia? I lived about 30 minutes form the U of Georgia in a little town called Pendergrass. I’m from Anderson, South Carolina, which is just over the border, right near there. Is that where you were living back then? Yeah.  So take a minute to think about it, and then take me back to New Year’s Eve 1999 and tell me what you remember. I actually don’t remember the night. I remember being at school. They had the 2000 glasses, and I was in first grade. I remember vaguely people talking about the Y2K apocalypse, about how all of our computers were going to mess up and the world was going to end. Um, turn of the century, or millennium. I know that my teachers explained to us what a millennium was. And I felt like that was pretty important, even though it was just a couple of years difference, you know, I got to live in two different millenniums. As a first grader, I was like, “Aw, I’m really cool.” So you felt like it was important? It wasn’t that it was it told to you that it was important. No, I definitely felt like it was important. Why? Is it just because of the date changing? Yeah. Just the...I think at that point, in my first-grade mind, watching TV shows and things like that, the future in 2015 was this magical place where we were gonna have all of this future technology. And I was definitely going to be a part of flying cars, and kind of like ‘The Jetsons’, you know? Because some of the movies I had seen as a kid, when it said 2020 or 2015 or something like that, it seemed so far away, and so futuristic. And that’s why I thought it was important. Because everybody was, you know, saying, “The millennium is changing. A thousand years,” and all of this big language, and I was in first grade, and I was like, “Yeah, this is super important.” I mention that Michael is one of the youngest people I’ve talked to, and as a result, he probably has a unique perspective on technology. Do you remember before all that, like, before cell phones? Yeah! Actually, my parents didn’t have…they weren’t into the latest tech, and stuff like that, so I didn’t get a cell phone until I could pay for it, in high school. And let’s see...I remember we had dial-up Internet. Before we had Internet, I remember that. I remember getting Internet for the first time; that was a big deal. Really? So you must have been really young then. Well, we just lived out in the middle of nowhere. So when we got Internet, that was a big deal. I remember talking on a phone with a cord, and that was interesting. And I remember TVs with antennas. VCRs and big stereo equipment  before...you had CD players and stuff like that. I had a Walkman. Having a CD player was like a huge technology thing, something that, like, you’d get a Christmas, “This is a big deal.” I remember pay phones. People used to use pay phones. Going to video stores, where you had to rent the movies and the games. I actually went and looked for one not too long ago, and they don’t exist anymore. Isn’t it crazy that we’re talking about that in the past now? Yeah. Video stores. This thing where it was, like, they had DVDs, which were huge. And back then, you’re talking about VHS. Yeah, VHS, and then DVDs were like, brand new. Or at least it wasn’t, maybe not that far back, a couple of years after that. It all blurs together, childhood. Do you remember people being afraid? Because of the millennium change? Yeah. Um, nobody in my family. I think...I vaguely heard about this thing called Y2K, and – Did they talk about that at school? No. I vaguely heard it, Y2K. Wasn’t sure what it meant. People talked about how our computers were going to mess up, but at that young, I don’t think anybody was going to tell me that the world was going to end, or something like that. Nobody seemed to really care. My parents were…they’re very, I don’t know the word for it. They wouldn’t get caught up in all the hysteria, even if it was going to be the Apocalypse. Sounds like they’re pretty tech savvy. Not really, no.  You said they were early adopters; they got a lot of the technology relatively early, considering where you lived. Um, I think it was a while before my mom had a cell phone. Okay, I might have misunderstood you. Yeah. And then by the time we got things like DirecTV and stuff like that, it was pretty widespread at that point. We got Internet...I remember the first computer we had was, like, Windows XP. Which is saying something, because you had, like, 98, 99, 2000 and then XP. Yeah. Now, do you still use PC or are you Mac? I’m PC. I mean, except for, I guess I have an iPhone. Yeah. I guess everybody is Mac in some way. Yeah. My wife has a Mac. We have an Apple TV. So I’m on both, I guess. I would like to have a Mac. Let’s just put it that way [laughs]. Your wife will hear this, and “Here comes Christmas gift!” No. Probably not. Be a nice Christmas gift."
  },
    {
    "first": "Michael",
    "last": "Graham",
    "id": "rtgmV35sG",
    "age": 32,
    "residence": "Jacksonville, NC",
    "occupation": "",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "11:38",
    "quote": "I just went on to my iPhone and opened Google Maps, and put in this address of this farmers market, and Google Maps told me what bus to take. [In 1999], I might have gotten lost. That’s somewhat joking, but also somewhat serious.",
    "transcript":"audio/Graham, Michael_073016.pdf",
    "audio":"./audio/Graham_compressed.mp3",
    "text": "Where were you living at the time? At the time of December 31, 1999, I was living at my parents’ house in Denver, Colorado. So take me back to that day. Put us there. What do you remember about it? I don’t remember a whole lot, specifically. I think during the day, I was working on a volunteer project with my church, via Habitat for Humanity. And I was in high school at the time, so I was on Christmas vacation. So during the day, I think I was doing the Habitat for Humanity project, and that evening, I was babysitting for some neighbors. They were leaving me with their kids, and they were going out to party somewhere. And I don’t remember too many specifics beyond that. Were you up at midnight? Probably, yes. Probably just doing some homework. The kids were probably asleep. Probably watching TV, ball drop. And I guess, like, watching the ball drop in New York City, and that was the time where everyone was anxious about the computer integrity, or like, kind of, the continuity of computer operations. And I think I remember that with the different time zones, we saw that other countries in other time zones were having continuous...And nothing happened. Continuous utilities, continuous services. Yeah, short version of the story is nothing happened. So at the exact moment of New Year’s Eve, 11:59 in Denver, it was a moot point, at that moment, because we knew that nothing was going to happen. Did you think something was going to happen? You can be honest. Well, maybe. I guess, short answer is maybe. I don’t remember being particularly personally scared or nervous, but I do remember the media made a big deal out of it. And you know, I think maybe my mom bought an extra one or two gallon jug of water and put it in their laundry room. And my dad gave her a hard time. And my dad was saying nothing was going to happen. But my mom bought one or two gallons of water. Did they take any extra money out of the bank or anything? Um, that was my parents finances, so I don’t know what my parents did with their finances. I don’t remember making any changes to my finances. Do you remember talking about it at school? So you were in high school...Yeah, I was in high school. In particular, I remember our gym teacher talking about it in a very disparaging way. Like, he didn’t think anything was going to happen. And he was mocking the media for blowing it up and making a big deal out of that. If somebody who was too young to remember back then, or they weren’t born, let’s say, and they asked you, “What was life like in 1999?” What would you say? Not much different than it is now. Really? You don’t think it’s much different. No. That’s the short...Why do you say that? Why do I say that? Um, the economy was good then, the economy is good now. In the 90s, we had the Clinton economic boom, and we didn’t really have the dot com crash, maybe until 2000 or 2001, so the dot com crash hadn’t hit, so the economy was doing well in 1999. We had the crash in 2008, but then ever since 2008, the economy has kind of slowly been improving. So its – what is it now, 2016 – and the economy is going up. 1999, the economy is going up. People talk about the economy being bad now, and it’s six of one, half-dozen of the other. I think unemployment is below five percent, so I think unemployment is kind of a record low, so a lot of people are working, and the question is, “Are people working in jobs that are paying them enough?” I don’t know. But at least people are working. You know, life is different for me just being in a different geographic area. And life is different in terms of…I guess there are a lot of similarities, now that I think of it. Because we had a two-term, in 1999, we had a two-term president who was leaving office. Now we have a two-term…We had a two-term Democratic president who was leaving office. Now we have a two-term Democratic president who’s leaving office. Hopefully we won’t have an electoral mess like we did then. Oh, yeah, I forgot about that. But there is, yeah, still another similarity there. Where we have a two-term Democratic president leaving office in a close election, so close that it came down to, like...Florida. Florida. And the entire election hinged on like, one county. And we don’t know the election results for the upcoming election, but we do know that it’s a close election. I think the polls are saying that Trump and Clinton are like, at a statistical tie. So I think a lot of parallels between 1999 and today. That’s interesting. In talking about this, you’ve mentioned politics; you’ve mentioned economics. You haven’t mentioned technology or daily life. Oh, man. So technology is like, much better now [laughs]. That’s the short version of the story. And the cool thing about technology is it’s enabling us to use our resources more efficiently.  What do you mean? In terms of Uber and Lyft, you know, you have people who are taking Uber and Lyft and using those types of services efficiently, as opposed to wasting a lot of gas and creating a lot of traffic, circling around the block for 10 minutes looking for a parking spot. And I can’t think of great examples at the moment, but you have a lot of apps that are just enabling us to get more information, which enables us to be more efficient in our day-to-day lives. So there are pros and cons with the technology, in terms of maybe critics would say that we’re alienating ourselves with our mobile technology, but on the other hand, we’re able to conduct our day-to-day lives more efficiently. So you’re asking about technology and day-to-day life, and I feel like there is the big overlap. You can’t talk about day-to-day life today without technology, and you can’t talk about technology without talking about how it affects our day-to-day life. And I think about my morning: I just went on to my iPhone and opened Google Maps, and put in this address of this farmers market, and Google Maps told me what bus to take. Yeah, let’s say it’s 1999, and you want to go to the Durham Farmer’s Market. I’d get lost. [laughs] I can’t find it. What would you have done? I honestly might have gotten lost. That’s somewhat joking, but also somewhat serious. I do remember getting lost more. When you’re looking at these paper maps, yeah, you can look at a paper map to get from point A to point B, and you can use a paper to successfully navigate, but it’s just more difficult. So you’re more prone to...You’re back to the efficiency, yeah. You’re more prone to...It’s funny that you mention that. I do have some pretty salient memories of being lost and having somewhere that I needed to be, and like, calling my parents. [laughs] Things that only could have happened back then, that wouldn’t happen now, right? Yeah. Whereas now, the minute I’m lost, I just pull up my Google Maps app, and you don’t really have to know where you are, you just say “Go from my current location to my destination.” Whereas with the paper map, you need to know where you are, figure out where you are at the moment, when you’re lost. Do you remember what it was like using the Internet back then? It was really slow. We had -- and this was exacerbated by the fact that my parents were pretty cheap – so when there were maybe better options, like DSL or things of that nature, we still had the dial-up. So I remember the sound that the computer would make. What was that sound? It was like, “ERRRR. ERRRRR.” And then, I just remember it was slow Internet speed. We always had older computers, so when my dad’s office would upgrade their computers, sometimes the employees would be able to take the old computers home for free. So a combination of older computer, slow Internet connection, made the Internet kind of a big frustration for me. And this was just at the moment where the educational community was starting to get on board with technology. So I had a couple of high school teachers in particular who were putting a lot of assignments online, and I was just extraordinarily frustrated because I was just not able to access these assignments due to the slowness of the Internet."
  },
    {
    "first": "Jennifer",
    "last": "Ho",
    "id": "v3JqW4g8QGrc",
    "age": 46,
    "residence": "Carrboro, NC",
    "occupation": "English Professor, UNC",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "14:47",
    "quote": "I was in Tulum, Mexico, with two other couples. I don’t think we were really afraid of the world coming to an end, but I think we thought it would be a really fun thing to do, to take a vacation at a really landmark date, in a place that had clean water. ",
    "transcript":"audio/Ho, Jennifer_080616.pdf",
    "audio":"./audio/Ho_compressed.mp3",
    "text": "So you’re already privy to this topic a little bit. Without having to go into too much and prejudice your thoughts, just take us back to that day, that night, New Year’s Eve 1999. Let’s just start on a personal note, and tell me what you remember about that day. I was in approximately Tulum, Mexico, with two other couples. So it was myself and my then-husband, who is now my ex-husband; my best friend from graduate school and her ex-partner [laughs]; and her best friend from high school and her ex-husband [laughs]. Wow, a lot has changed since then. Yeah, a lot has changed since then. And we…I don’t think we were really afraid of the world coming to an end, but I think we thought it would be a really fun thing to do, to be, to take a vacation at a really landmark date, in a place that had clean water. [laughs] Interesting. Yeah. So we chose Mexico. I mean, it was actually kind of a deliberate thought process on my friend Karen’s part, who works in environmental science. And so what I remember is actually watching TV and we’d prepared this elaborate meal, and had this amazing dinner, with fresh tortillas and produce from the local market. And we watched TV and we watched the world, you know, welcome the New Year. And then we danced for like, two hours, in the living room. That’s fantastic. Yeah. Had you ever been to that part of Mexico before? I hadn’t. I hadn’t been to the Yucatan Peninsula before.  And you said the clean water was a part of the decision making process?  Yes. Yeah, because our thought was if the world was gonna go to hell in a hand basket, at least we’d be someplace that access to fresh water and fresh food. Yeah. Yeah. Yeah. No seriously, it was part of Karen’s calculation. What were your immediate surroundings like that night? Um, we were in a subdivision of, I would say, fairly wealthy-to-middle class Mexican people, and tourists. So our unit was owned by an ex-pat who was now living in Mexico. But it actually wasn’t that…I don’t know if this is true of all of the Yucatan Peninsula or just this area, but we were about an hour outside of Cancun, so it wasn’t exactly a tourist mecca or destination, where we were at. But we were very close to the Tulum ruins, so across the way there was a village, so it was a little bit more working class, I guess you would say. Or clearly not middle class, clearly not catering to tourists. So it seemed like a mixed community, maybe is the way to put it. And you said you were in the midst of your doctoral program for English and comparative literature? Yeah. I was in the PhD program, my friend Karen was in a PhD program, and Anne Marie was a high school teacher in California.  And this is something that’s been interesting about the topic: for a lot of people, given that it was a momentous occasion, they seem to have put some forethought into who they spent that time with. Was that the case with you? Oh, yeah. Karen was -- still is -- one of my closest friends, and at the time, I felt like she was my sister. How long had you known her? Um, I’d known her since college, but we reconnected in graduate school. Yeah. Wow. So you’re in Mexico, you’re with you said your then-husband...Then husband. Best friend, and her then-husband, right? No? Um, partner. They weren’t married, but live-in partner, yeah. Do you remember how you felt as midnight approached? Um...really happy. I mean, I didn’t actually think the world was going to end, right? I didn’t think...You can be honest. No, I didn’t think the world was going to end [laughs]. You’d be surprised. I mean, I’ve interviewed people from all walks of life, like I said, and I’ve actually talked to people who were candid enough to say, yes, they did really think – Oh yeah, no, my ex-husband did. And my best friend, you know, really did wonder about what the ramifications of Y2K were going to be on global systems, right? Global computer systems. And I don’t know whether it’s my own naiveté about such things…like I don’t really…it’s still a mystery to me how landline phones work, right? It’s more [laughs]...it’s easier for me to imagine how cell phones work than a landline phone. [laughs] Well, it’s a mystery that will go extinct and may never be solved. Do you still have a landline phone? I do not. [laughs] Do you remember if you had a cell phone back then? I did not have a cell phone. I’m a late adapter. I’m a very late...I’m like one of those people that doesn’t get a cell phone until it’s already into generation, like, four. That’s been another salient aspect of this topic, when people have reminisced about it, is a lot of people have said that that was sort of the fulcrum point. That it seemed like that was when technology just really exponentially started to take off. Do you feel that way? And do you remember what your daily life back then and comparing it to now, as far as technology, and just how – Yeah, you know, I think because I was so immersed in my graduate program and because I’m a lit person who really only needs access to paper, no. I wasn’t...like I said, I’m really a late adapter, and I’m also one of those people that really scoffs at technology. So for example, when Facebook first came on the scene, I was like, “Ugh, Facebook. What the hell is this thing?”  I’m still that way.  Right. This is totally ridiculous. When twitter came on the scene, I was like, “Twitter. How can anybody write something that’s 140 characters?” I mean have a twitter and a Facebook account now, but – That’s spoken like an English professor right there. Yeah. [laughs] Yeah, I mean it took me a couple of years. Yeah. I know you said paper is primarily your, your primary resource, but you have to admit even today, that’s probably changed, as far as like how you do your research, right? Oh, no, absolutely. It makes me sad, but honestly, for space purposes, I’ve converted to electronic media for anything that’s narrative. So still for critical works, I really prefer to have a book. But if it’s a novel, I can read a novel on a Kindle. Do you think it’s changed how research is conducted, or perhaps the integrity of research? And people, you know, just sort of cherry picking things because its so quick and easy now? [sighs] Yeah. You know, I wonder. I think about that, but in terms of teaching, like in the classroom, and I think...I guess I think about it as I do with any technology, including the book, right? Yeah. Because I think of the book as a technology – Since 1455 and growing. Exactly [laughs]. It’s still going strong. That there are really revolutionary positive things about it, and then there are other tings that you lose sight of. So you could argue that when the book came around, the oral tradition of storytelling and memory and having human conversation, kind of maybe, people maybe lamented that, I don’t know. That’s a possible reaction. And then similarly, you could say that on Facebook you’re not really connected to people, you know. But I think there are positive things, and so I think research wise, there are also positive things about being able to…like, to be able to search into a database at the British Library, for example, and find exactly what you need, versus spending hours scouring through boxes to find a single document. Oh, yeah. Or to be able to have a scanned document available to you that you can click on and you don’t have to go to London, right? That’s amazing. Yeah. Well, it’s always nice to have a reason to go to London, but...Well, yeah [laughs]. Okay, so if you -- being an English literature person – if you were going to write a book about 1999, what would be the title, and what would be overarching theme? [sighs] You know, this is going to sound really cheesy, but the first thing that comes to mind is the REM song, “It’s the End of the World As We Know It (And I Feel Fine).” Not cheesy, but a long title. But it worked for REM, didn’t it? [laughs] It did work for REM, yeah. And would that, like I said, would that be the overarching theme? Would it be that sense of possible apocalypse looming? Uh, yeah, yeah. I think that I would say what I feel as a person born in 1970, who’s kind of seen this arc of technology and discourse in popular media, there’s always been apocalyptic narratives, but I sort of feel like there’s a different tenor to the apocalyptic narratives, there’s a kind of ferocity to the way that we’re envisioning the end of the world, that I think is different from – Do you remember that tenor changing, or increasing in intensity, at that time? I feel like it started in…when did the first kind of vampire stuff happen? Mid-to-late 90s? Ooh, that’s an interesting angle on it. I think mid-to-late 90s. You know, I’ve never thought about it, but yeah, that’s been – It’s the vampire stuff, is when I first started noticing it. Wasn’t Tom Cruise in a movie that I think was like first vampire movie – Yeah, yeah, yeah! No, Anne Rice, it’s really, right...Anne Rice. And that was a couple of years before the millennium...Exactly. So I feel like it was Anne Rice, it was the remake of Bram Stoker’s “Dracula,” with Winona Ryder...That was also the same time, I think. Exactly, right? So...I’ve never thought about that. Yeah. I feel like it’s...but it’s also AIDS, right? I think there’s a kind of unique connection to the AIDS crisis of the 80s, leading to the rise of the vampire narrative. Now I’m really speaking like a lit professor [laughs]. No, I’m with you. No, it’s right in my wheelhouse. And then...yeah, I mean and now, we have the “Walking Dead”, right? We have zombies. There’s a really --  Oh, that’s definitely become prevalent. Yeah. I’ve never thought about that, but yeah, there may some sort of a tacit connection between that narrative and the bigger narrative about how things are going and may continue to go. Yeah. Wow. Is the world going to end with a bang or a whimper? Both. [laughs] Okay, I don’t know what T.S. Eliot would say about that, but...I’m not into binaries. [laughs] “Not into binaries.” See, I do a lot of coding, so binaries are kind of a thing, but in a different way. I wrote a book on racial ambiguity, so I’m all about the gray.  That will be a great ending point. Do you feel like...compare then and now, briefly, if you don’t mind. As far as -- and this is getting into a big topic, that you don’t have to necessarily get into -- but culture and racial interactions then, to now, and that experience. [exasperated sigh] Ooof. Like the now of August 6, 2016, on the eve of a fall election – presidential election – that we’ve never kind of seen before? Like the rise of this kind of rhetoric of hatred, for lack of a better word? Is that – So do you feel like it’s changed for the worse in the 16 years since 1999? [sighs] If we’re examining the rhetoric, then yes. But I will say this. I’ve actually been in Europe for the last two months. I just got back this week. Well, that’s an interesting perspective on it. Yeah, no, it’s been really fascinating being away, right? Being in Europe, especially with their gun laws, right? And then seeing and hearing – That’s another conversation. Oh, yeah. Seeing and hearing about what’s happening in the United States. And so when there was the cluster of killings of black men by police, and then the assassination of police by that gunman, my husband – who’s white – said to me, “Do you think there’s a coming race war?” And I said, “It never ended.” Right? So I think there’s this myth that the 1960s happened and we all…all of a sudden our racism was over. But I actually think that was never true. And so I think what feels new is the public voicing, but the sentiment isn’t new, right? Do you think technology plays into that? To a certain extent, the anonymity of the comment section, right? Anonymity, yes. The anonymity does. Makes a big difference. Right. For better and worse. Right, but people hold these sentiments and they’ll voice them in private company, right? So there’s a way in which my husband hears things that I’m not going to hear because I’m…I know this is radio, but I’m Asian-American, so I scan as being not white, and yeah, so...Wow. Well, that’s an interesting take. Anonymity, yeah, I’ve never thought about that, but that’s true. I mean, it allows people to…it gives them a pulpit that they wouldn’t have had before. Right. And I think in a similar way, Trump’s presidency, his election bid, was another form of the anonymity, right? So rather than an anonymity through hiding yourself in a comment section, it is being able to hide yourself in a mob. Right? Being able to hide yourself – Well said. -- with others who are shouting the same kind of slogans. I think someone said that Trump’s candidacy is essentially the comment section of an online article come to life. Yeah. That’s a great way of putting it, yeah.  Last question. What will be the overarching topic that people will be talking about in 2100? So, I’m really a pessimist about the environment. There won’t be anyone around to talk about 2100. Wow. You are a pessimist. Yeah. There won’t be anyone around. The ice caps will have melted. We’ll leave it to the roaches. Yeah. It’s what the roaches will be talking about, right? The cyborg roaches – Yeah. I mean, I think it’s possible that the aliens might come down and be able to decipher, right? If anything survived. And maybe it will be a book. See, I’m of the opinion that by 2100, we’ll have moved beyond our corporeal existence and we’ll just be code, and we’ll be living in the ether. Oh, I could live with that. That’s a happier future than [laughs]...I agree with you, but whenever I voice that opinion, a lot of people vehemently disagree with that and think that would be horrible. Which is an interesting philosophical take on things, to see how people react to that. Would you want to be immortal thought, as opposed to a corporeal existence? Right. I think a lot of people are really attached to the idea of existence being bodily, you know? I have sort of a Buddhist mindset. My grandparents were Buddhists, and so I just feel like, you know, we’re going to go back to the Earth somehow. We’ll end up in the ether somehow.Do you remember how people in the Buddhist tradition celebrated that event, the turn of the millennium? No, I don’t, I don’t. That’s actually an interesting question. Just curious, yeah. Yeah, I was actually actively practicing at that point, too. But no, I actually don’t…so here’s the funny thing: I don’t think they would have necessarily marked it any differently, right? Okay, yeah. Yeah. Because it’s all just time. Right. Yeah. And space."
  },
    {
    "first": "Will",
    "last": "Holland",
    "id": "7F9TNLfLDqsu",
    "age": 35,
    "residence": "Durham, NC",
    "occupation": "",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "8:47",
    "quote": "They made us crank every ambulance at 11:30, because they were concerned that the computers in the truck would not allow the automatic ignition.",
    "transcript":"audio/Holland, Will_073016.pdf",
    "audio":"./audio/Holland_compressed.mp3",
    "text": "Were you living in Durham at the time? I was not. I was living in Gastonia, North Carolina. It’s about 20 miles west of Charlotte.So walk us through what you remember. Take us back there. Think back in your mind, let the images surface, and tell me what you remember December 31, 1999, when it became the year 2000. December 31, 1999. Well, that was the year I graduated from high school. I had spent my first semester at Appalachian State University, so a little more independent than I was. I mean, I was learning to become independent. And I was working as a volunteer EMT at Gaston Emergency Medical Services. We would spend our nights – I did a lot of nights there, and weekends -- and so I remember being home for the YK buzz, because everybody was freaking out. I mean, it was the end of the world. Planes were gonna fall out of the sky, we had mass casualty vehicles ready to roll. It was a sense of ridiculousness to me, but also, there was the reality of, “Okay, well, if all the computers shut down, maybe there would be like a global collapse, and all our banking and stuff on there.” But we weren’t as dependent upon, you know, cell phones and everything else at that point. I didn’t have a Facebook account. I think MySpace...I had just started a MySpace account in 1999. Was it maybe 2000? I’m not sure – I’m not sure. When I went to college, I had no social media, and I think MySpace was the coolest thing in the works at the time [laughs]. I got my first Hotmail account, you know, so I had finally gotten email. I didn’t grow up with Internet in the house, so I went to college and my world opened up. But yeah, that night, we were volunteering. We had had this big prepping from the administration. They made us crank every ambulance at 11:30, if you were sitting in your station or not. Every ambulance in the fleet had to be cranked. Every supervisor vehicle, every specialty vehicle, everything had to cranked and running, because they were concerned that the computers in the truck would not allow the automatic ignition [laughs]. So it was like, we had to go, and I remember there was a big lot that had probably 15 ambulances in it that were backups, and all of them were running at 11:30. And we were just sitting there on the steps, waiting for the world to end, you know? And 12:00 came, and there were a couple of gunshots, and we were like, “Oh, great. The rioting has started. Everybody thinks it’s the end of the world, so they’re gonna go kill their neighbor,” kind of thing. That was our biggest concern – There were really some gunshots? There were literally gunshots in the --- Oh, probably celebrating. -- Yeah, the public was like, “BOOM, BOOM, POW!” You could hear handguns and rifles going off. We were at our main station in the bad part of town, and so, it might have been just a celebration, literally, but we were thinking, “Okay great. If you really want to kill your neighbor, and the world’s about to end, there’s no electronic records of who you are anymore, so…” [laughs]. We thought it was going to be a crime spree. So for a minute there -- just for a second there -- you heard gunshots, midnight had come, you thought maybe something really was happening. Yeah. I was like, ”This is kind of crazy. Here we go.” I think that was the words we said, like, “Here we go.”  And no tones went off. No 911 calls. There was nobody screaming. I take it the engines started in your -- Well, the engines were still running, so – Oh, that’s right. So then the supervisors got on the radio and said, “Okay, EMS 1, shut down your truck.” And then they’d shut it down, and you’d restart it and say, “It restarted. We’re fine.” And then they did that for like four or five trucks, and then they were like, “Okay, it’s fine. It’s no big deal.” We went and shut off everything and got back to life. Dispatchers came on the radio, no computer problems, no dispatch problems. All clear, continue service is normal. So did you get sent out at all that night? We did. But we ran the standard, you know, respiratory distress calls, or “somebody had a car accident” calls. It was nothing related to Y2K that happened that night, EMS wise.Well, still, some people had some emergencies that just happened to occur...Well, there you go. But they weren’t like Y2K…their CPAP machines stopped working, or their oxygen tanks didn’t go off [laughs]. It wasn’t that the world fell apart because of the computers and the actual transitioning to zero-zero again. And so, it was just normal stuff. It was a normal EMS night. And it was a big laugh. We were waiting for the planes to fall out of the sky, because, I mean, Charlotte International Airport is right there. We were just waiting for the big call for all of us to respond for people just falling out. But you had backup controls; it’s not completely computer-controlled. Obviously it was a joke, but yeah, that was EMS the night of December 31, 1999. It was…we were prepared for the worst. Laughing about it in some ways, but at pone point, it was like, “Oh great, is this really happening?” And then, back to normal. Wow. Within a couple of hours, back to normal. Nothing changed. Everybody was living life. Bank accounts still worked. You could still get on the Internet and check your Hotmail. [laughs] Life was good. Hotmail... [laughs] That’s the first one I got, Hotmail account, so yeah. You still have it? AOL still was like [makes the sound of a dial-up modem]: “EEER-WAANK”. It was still dial-up and all, but I hated the AOL thing. Hotmail was awesome. I do not have it anymore. I don’t even remember the password. I think I still have an account, but I couldn’t even log in if I wanted to. I think they canceled it. So EMS, did you all have cell phones back then? Um, we had radios, and I guess some people had...let’s see, 1999, I think I had the Motorola Razor, the like, flip phone. The first original Motorola flip phone. I think that’s what I had on my hip. And so it worked fine. Called my mom in the morning, “Everything’s fine, nobody died.” “Okay, great. See you when you get home.” You know? Yeah, I think that’s when I had the Motorola flip phone. How would you compare 1999 to today? Um, it just seems likes it was simpler. It wasn’t as complicated as today. It wasn’t so much tension, or…I don’t know. Today, it just seems like everybody wants to be connected, but you can’t connect, so you create Facebook accounts, and you try to do it through social media. And having a conversation with somebody is so foreign now. And it seems like it causes more problems because people are fake on their accounts. They create false personas of themselves, and you meet them, and they don’t add up. So you’re starving for a relationship, but you’re not getting actual relationships. You think the church fills that void? I think the church has failed in a lot of ways to fill an authentic relationship void, but I think -- Why do you say that? I think there’s a change of it. To me, the church has been caught in the traditional Christianity. Especially in the Bible Belt in the South, you do it because you do it. You go to Sunday because you go to Sunday. But there’s a Gospel resurgence. There’s people living the Gospel. The Gospel is becoming alive more in the church today and it’s kind of flipping around. That social Christianity or cultural Christianity, you can tell the people who are stuck in cultural Christianity, and those who want to build authentic relationships for the Gospel. And so I think there’s a shift happening. It’s probably in the last five years. Five, six years, there’s been a shift happening towards more relational disciple making versus program-driven disciple making, and loving your community. Because the social media, the Facebooks, the accounts, the AshleyMadison.coms, all these ways to be somebody you’re not, are taking over culture. I think the church is realizing this is not how you have relationships. It’s not the way that God designed us, to love one another. So let’s switch it up, and just be real in front of each other. “Yeah, my Facebook account says my business is going great, but you know what, I’m struggling. And we’re barely paying the bills, and my wife and I fight all the time because of it.” The opportunity to be authentic, it’s coming back. And so, what better place to do it than in the community of the church? That’s interesting. I think it’s shifting, it’s shifting back."
  },
  {
    "first": "Simone",
    "last": "Hughes",
    "id": "qfMhMDfZP6s",
    "age": 53,
    "residence": "Carrboro, NC",
    "occupation": "",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "7:02",
    "quote": "Communication is cheap now. It’s quick, it’s less thought. You’re not really thinking about reaching the other person.",
    "transcript":"audio/Hughes, Simone_080616.pdf",
    "audio":"./audio/Hughes_compressed.mp3",
    "text": "So Iike I said, this is a story about people’s memories from the turn of the millennium. Or technically, turn of the century, because if you recall, the millennium didn’t start until 2001. I hate to be pedantic, but we’re not splitting hairs here. Take m e back, go back in your mind and think about it, and what do you remember about -- personally, let’s start with that – personally, what do you remember about New Year’s Eve 1999? So New Year’s Eve was my last night in my apartment of 10 years, after a major breakup and heartbreak. There was all the hysteria about would we even wake up in the morning, what’s going to happen. And I kind of didn’t care. I was leaving the apartment of moving to West Africa. So it was kind of a big night. And I just remember being really sad, and really alone. And then things turned out good. I’m sorry to hear that. So you were...But it all got good. So you were...We all woke up, there wasn’t chaos. You can be honest, were you worried that something might actually happen? A little bit. Um, not worried, but curious. Did you make any preparations? No, no. Okay. I don’t want to open any old wounds, but you said you had just gone through a breakup, so it was a tough time for you. Yeah. And the moving, and you know, leaving virtual security and going off to live in Africa was...What was taking you out to Africa? Um, I had been there before, and just wanted to go back because I remember smiling a lot there, and they have great music. How long did you spend there? Six years. Wow. And what part exactly? West Africa. Simone smiles as if to indicate that she doesn’t want to be any more specific. Okay. Let’s keep it that...okay, fine. So do you remember watching the celebrations on TV and as midnight approached? No. No because I was moving, like literally, everything was packed. There was probably sleeping on the floor. Nothing in my apartment.  Interesting, and this was in Carrboro? No? Um, another state. I like your style. Simone laughs. This isn’t going to be on the radio, by the way. This is just for my thesis research. I don’t foresee it being on the radio. So let me ask you -- That bad [laughs] It’s going well, though. So let me just ask you. How do you feel like your daily life has changed, or has it changed, and why, from 1999 to now? Simone reaches into her purse and pulls out her cell phone. Oh my god, this damn thing, you know? The holding the phone, constantly check the phone -- And for the record, Simone has taken out her cell phone. [in a high-pitched, nagging voice] “I called you, where were you? Nyah-nyah-nyah...” Always connected. Always connected.  So it sounds like you’re nostalgic for the days before you were that…it was that way. Oh, yeah. I’m the person trying to, you know, still sending postcards and letters. You feel like communication between people has changed? Yeah. How so? Communication is cheap now.Cheap. Yeah. Now, do you use that term more in...strictly in an economic sense? Or do you mean cheap in terms of the value of it, the personal, the communication? The value of it. Okay. Yeah. It’s quick, it’s less thought. Less thought? Yeah. Okay. Interesting. Some people might say that because most of the communication now is text and written, that it gives you a chance to think about what you say before you say it. But...Yeah, but you’re thinking about covering your tracks. You’re not really thinking about reaching the other person.  And there’s anonymity now that there wasn’t before. Yeah. Yeah. So there is a sense of nostalgia for like, 1999, when you think back on it. Not 1999. [laughs] Well, obviously, not personally, for that reason. How about 1998? ‘98, okay. Okay, yeah. And 2000. Right. 2000 was good. [laughs] Oh yeah? Good. Yeah, yeah. Okay, I’m glad things went well in Africa. Interesting. So are you on Facebook and all that? Um hum. Okay. Let me ask you a question -- but I’m like, considering putting parental controls on it because it’s just taking too much of my time. Now parental controls...[laughs] Well, I need to find a parent somewhere and...[laughs] Somebody to control you! Exactly. [laughs] Interesting. “Okay, you keep the password...” [laughs] Let me ask you this. At the Durham Farmers Market last weekend, I was doing these interviews, and I asked somebody, and it turned into an interesting conversation. I presume you have more than a few Facebook friends on your profile. Do you have any current or former neighbors in the list? [pause] Probably not. And why? I don’t know. I’m new-ish here.  Okay. That’s probably the reason. But no former neighbors? Um...[pause] No. Yeah, that’s been interesting. I mean, some people will have 500 friends, and they have no current or former neighbors in their list. Trying to figure out why that’s the case. That is interesting. What do you think is going to be the topic on everyone’s lips in 2100?  Um...we’ll be talking about heaven. [laughs] As in we – We won’t be here. [laughs] Okay. Kind of pessimistic, but honest. 2100? You gonna be here? Oh, you mean personally, us. No, I meant what will people, culture, be talking about in 2100, not you and I. Although if that’s the case, we should definitely record it. Um, gosh. I don’t really think about that. Yeah? Yeah. Nothing is really coming to mind -- Unless somebody with a microphone in their hand comes up to you. [laughs] Well, like I said, this is sort of a time capsule, that’s why I’m asking. Because you never know...You know, maybe like, “What the hell were they thinking? Why did they destroy the planet?” And some bad words. Did you notice a big difference when you got to West Africa – I’m presuming that you did, but I don’t want to jump to conclusions – in terms of the technology here, and then you went there, and just the life and the culture at that time period? Um...And did it change while you were there, in that six years? [pause] So I would say that...so everything was cyber-cafes. And they became more ubiquitous and cheaper. Yeah. That’s the main thing that comes to mind. Cyber-cafes, yeah. Do you remember – I remember having those here. And they still do in some rural areas; it’s the only access. Or the public library. Right.  Yeah. Well, it’s interesting that you whipped out the cell phone immediately when we were talking about how things have changed. Yeah. Most people would, I think. Yeah. I mean, you can’t even have like a Saturday morning at the Farmers Market to yourself. Most jobs now, because the office is in your pocket, you know? Right. I’m probably going to have to answer some emails after this interview."
  },
  {
    "first": "Kelly",
    "last": "Jayrowe",
    "id": "Mf5cdmqmVhM",
    "age": 29,
    "residence": "Georgetown, SC",
    "occupation": "",
    "interviewLocation":"The Pier at Garden City (Murrell's Inlet, SC)",
    "interviewDate":"July 20, 2016",
    "duration": "5:31",
    "quote": "I’m from a small town, so if they even mention the thought of a third of an inch of snow, everybody’s going out to get bread and milk. So the thought of something that could take place and really do some sort of damage with technology, people were kind of on edge about it.",
    "transcript":"audio/Jayrowe, Kelly_072016.pdf",
    "audio":"./audio/Jayrowe_compressed.mp3",
    "text": "My name is Kelly Jayrowe. I’m 29 and I live in Georgetown, SC. Beautiful town. My brother-in-law got married there. I ask Kelly to spell her last name. Like I said, I’m talking to people about their memories from the turn of the last millennium, even though technically, it wasn’t the change of the millennium. Tell me what do you remember about NYE, when it when from 1999 into the year 2000? Um, I think what I remember most, I just kind of, there was like a sense of panic because Y2K was going to happen. And I was still, I was fairly young, and I didn’t fully understand it, but I knew that my parents and other adults, they had a sense of urgency, a sense of just uncertainty. For the most part, they didn’t think anything major was going to happen, but there was all of this hoopla, all of this talk about “Computers are going to shut down, you won’t be able to get your money, what are we going to do? The whole world’s gonna come crashing down.” So that’s what I remember about New Year’s Eve from that time [laughs]. Did you personally know some people…do some stories jump out in your mind about people preparing for Y2K? Yeah, just, you know, people taking some money out of the bank, stocking up on things. I’m from a small town, so if they even mention the thought of a third of an inch of snow, everybody’s going out to get bread and rice, or bread and milk and stuff. So the thought of something that could take place and really do some sort of damage with technology, people were kind of on edge about it. And you were living in Georgetown then? Actually, I grew up in Hemingway. I mention that Hemingway is my sister-in-law’s hometown (an incredible coincidence, considering how small it is). We talk about her in an attempt to determine if Kelly knows her. So personally, does anything stick out in your mind about that night? Not so much. [laughs] I don’t know, I was kind of small, so I don’t…I do remember, this is probably something very stupid. I had this Y2K little countdown thing. And I do remember staying up with my parents [laughs], and I was kind of scared because I watched the news, and I didn’t know. And they were like, “Honey, it’s okay. We’re gonna watch the ball drop. You’re gonna have your little sparkling cider and we’ll go to bed. It’s fine, everything fine.” But I do remember just being nervous and watching the ball drop. And it was like on the news and stuff. Did you ordinarily stay up to midnight back then? No, definitely not. Mom and dad made me go to bed. [laughs] So it was kind of a special occasion then because of the situation. Yeah. Do you remember how everybody reacted when kind of nothing happened the next day? It was like, “Oh, well, that was it? Well, okay.” It’s kind of like the big hurricane comes through, “Oh, that’s all we got?” [laughs] You’re probably too young to remember when all the technology started to change, but do you remember…I guess you’ve always had a cell phone? No. [laughs] I mean, not when you were too young to be allowed to have one, but – I remember my parents’ first cell phone. We didn’t have a bag phone, because my parents weren’t that into it. But we did have a little flip phone and you had to buy minutes, so we bought like 30 minutes at a time. You only used it for emergencies if you were broken down on the side of the road, and nobody you knew was coming by to pick you up [laughs]. Same thing probably with the internet. Oh yeah, I remember dial up. Very well. In fact, I was taking an online course at Coastal, and I had moved back home with my parents, and we still had dial-up internet because we lived in the country. And so I’m taking this class, and none of my stuff would go through. I mean, it was terrible. I couldn’t do any of the classwork. So the teacher – because I was never able to turn anything in – she ultimately gave me an F, even though I was going to her office, and trying to figure all of this stuff out. And so I had to appeal it with school. And now, if you go to sign up for an online class, after my case, they made it a rule that you cannot have dial-up internet. You have to have high-speed internet to take an online class [laughs]. Did they fix your grade? Yeah, yeah. [laughs] Well, they should have. That’s ridiculous. We appealed it because I had all sorts of evidence and whatnot. But yeah. So now you can’t have dial-up internet. I don’t think anybody has that anymore. I don’t know. You probably remember the sound of the modem? Kelly makes a screeching sound and laughs. And you’re little AOL...AOL was the chat thing. Some folks still have AOL email addresses, so you know they’ve had those for a while. Yeah, there’s a lot of Yahoo...Uh huh. Yeah. Netscape was one of them. I think so. And the music software where you could download, like Limewire or something, I think it was. We all got in trouble for that. I didn’t get in trouble for that. Because I had dial-u p internet, I couldn’t hardly get anything. [laughs] So did your folks take any preparations for the possible Y2K? No, no, they weren’t really too worried about it. They just said, “Well, if something bad is gonna happen, it’s gonna happen, but I got a little bit of cash in my pocket, just in case.'"
  },
    {
    "first": "Deborah",
    "last": "Koenig",
    "id": "cufRcpg7A",
    "age": 57,
    "residence": "Carrboro, NC",
    "occupation": "Attorney",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "12:45",
    "quote": "I did not believe when I was in college that computers were actually ever going to make it. And I’m glad I didn’t bet on that idea.",
    "transcript":"audio/Koenig, Deborah_080616.pdf",
    "audio":"./audio/Koenig_compressed.mp3",
    "text": "All right, so take a minute to think about that time, from New Year’s Eve 1999, going into the year 2000, and paint us a picture. Like, what do you remember about that night? I was in Little River, South Carolina, and I was in a third-story condominium that I owned at the time on the Intercoastal Waterway. And I had my daughter, who would have been 10 at the time, and I cooked her an evening meal, and then we went out on the balcony, listened to music, and watched fireworks from surrounding areas. Wow, so you remember it pretty vividly, then? Very vividly. Now why is that? Is it because it seemed important to you at the time? Um, there were a lot of folks that thought the world was going to end. [laughs] And I wasn’t really scared that the world was going to end, but I did think it was certainly a moment to remember. And I had my daughter with me, and I think we had invited friends over earlier in the evening that were from South Africa and lived down on the first floor, and we often times would share meals, and so we would go between the first floor and the third floor, and it was just a really nice evening. Did you take any preparations because of the possible Y2K problem? Not at all. Nope. [laughs] So it’s safe to say, you didn’t think there was going to be...No. I believe in God, and I did not think it was the world’s end. And there are certain factors that I would look for before I felt that the world would come to an end, and none of those factors were in place. How do you think your daily life has changed? You’re thinking back now on a night from 1999, how has your daily life changed since then? Well, my daughter is graduate school. And her father and I divorced when she was very young, so I was pretty much a working mom. What were you doing at the time, I’m sorry? I’m an attorney, so I was practicing law at the time. I’m still practicing law. And um, just I had purchased that unit for us to spend weekends, and we spent a lot of lovely time down in Little River. And I mean, it was just a great period of time. There were a number of years that we accessed it about every other weekend. Has your line of work changed, with technology and everything since then? I would like to say that I’m totally techno correct, but the problem is I’m yet a dinosaur. So yes, I use computers, mainly to buy airline tickets. I am still a paper-bound person. I like paper. I like the feel of paper. I like the feel of books. I don’t have a Kindle. I have people who work in my office that are very savvy techno geeks, and when I need something, I ask them. I’m better than I used to be. I did not believe when I was in college, that computers were actually ever going to make it, which is really interesting. And I’m glad I didn’t like, bet on that idea. But the computer in my college, which was as large as really, a room, and we had like these DOS cards, and it was mainly a statistics course. But the last…like 10 percent of the course was actually computers, and I was like, “Well, I don’t really have to worry about this because it’s not gonna take, anyway.” And I remember my professor was named Jackson, and he had us do a random variable…we had to prepare a program, where based on random variables, it was a game of 21 in basketball, and my Man A always won, because I didn’t know what I was doing. I tried to explain to him that Man A was like Kareem Abdul-Jabbar and Man B was like the short little guy from Benson, but he didn’t go for it, and he made me rewrite my program. But I was just sure computers were never going to quite make it, so...I was wrong. [laughs] Facebook? [dismissive sound] Psst. Fad. Yeah. But I was always wondering from a Biblical perspective, how it would be that you could actually look at the two witnesses on the streets of Jerusalem, like the entire world? And I’m thinking, “I just don’t know how that part is going to come true.” [laughs] And now I look on my cell phone on a daily basis, and I can check out the streets of Jerusalem. And I’m like, “That is just so cool.” In our lifetime, how it’s gone from...you know, basically, I used to have one telephone in my mom’s home, in the kitchen. I had a bag phone that my father allowed me to carry to college and back just in case I broke down. I thought I was like Jane Bond, you know? And now...you know, when you moved back then, you moved from one town to another, you really almost lost contact with those folks, like if you grew up with people and they moved a few hours away. And now, my daughter is in grad school in Massachusetts. I can text, talk, do anything I need to do at a moment’s notice. Just by reaching in your purse. Right, just by reaching in my purse. And so it’s quite incredible how you can actually maintain relationships throughout the world. Do you feel like the nature of the communication, though, has changed? Um, I do think that the younger folks miss a lot of…now, my daughter seems to -- believe it or not, only being 27 -- she really I believe has kind of an old soul, because she will take the time to actually write a letter or write a card, and put her feelings and actually put a stamp on it and send it through the mail. There are a lot of folks that, you know, just don’t communicate like that anymore, and I think that that’s a shame because when you touch it and you feel it and you write it, and you...I don’t know, it just comes across differently. So yes, communication has changed. I think in some ways very wonderfully, and in some ways, I think, you know, we’re losing part of that connection. Interesting.  It’s very hot, so I pause to get Deborah a bottle of water from the cooler. Like I said, since this is sort of a time capsule project, for an archive, let me ask you this. I’ve been asking a couple of other people this morning. What do you think is going to be the topic most often on people’s minds, on people’s lips, in 2100? [pause] I don’t think we’re going to make it to 2100. You are like, the seventh person that’s said that. If you look at what’s going on with Israel, because Israel is in fact God’s timepiece, and you look at what happened in 1948, when all of a sudden Israel is in fact a nation again in a day. Even if you don’t believe in the Bible, or believe the Bible, if you look at it just simply as a historical book, you look at Israel, not only is she back and not only is she thriving, but she’s now producing like...I think she’s like the third largest fruit flower producer for northern Europe at this point. And if you think back on Mark Twain going through Israel in like, the 1880s, or whenever he made that trek, saying, “I don’t know why anybody would even want the godforsaken land.” And you look at her now. So that generation shall not pass. And when I think about Israel and I look at what’s going on with everything in the Middle East, and all around the world at this point, I believe that we won’t see actually 2100. Wow. If you don’t mind my asking, what denomination? Um, I grew up...I hate to say this because you’re going to think, you know, I have no sense. I grew up actually in a Southern Baptist church, but through the years, I went to a Presbyterian college, I sent my daughter to a school attached to a Pentecostal Holiness church, which…you know, it was just because it was a very good private school, not necessarily because of its attachment. So I would kind of consider myself non-denominational, truly. But I definitely believe in God, I definitely believe that Jesus is his son, I definitely believe that there was a time on Earth that he came, and made redemption so that we could inherit eternal life. And so I just believe the Bible, and...So that plays into your thoughts that we won’t be around in 2100? I, you know...You think it’s like an eschatological...it will be some sort of a Biblical event that will happen? Oh, absolutely. Oh, absolutely. Really? Okay. What will happen is Christ will in fact return. I don’t know where I stand on pre-Rapture or post-Rapture tribulation, but once you see the peace treaty signed between Israel and whomever, once that goes down, there will in fact be seven years and then the end will be what it is. But so, you know, I just kind of look, listen, learn, and I watch Israel. I probably know more about what’s going on in Israel than I do what’s going on in the United States, which I hate to admit. But I mean, I do keep up with things. That’s interesting. Anyway, I just, you know...I believe the Bible. And I go to Catholic churches, where they don’t allow gentiles like me to actually partake of, you know, communion. I just went to a funeral, and they said, “If you’re not Catholic, do no come up.” But like, Robert Barron’s “Word on Fire” about Catholicism is better than any humanities course I could have ever imagined. So for all of those who think Catholics, you know, just are not...I have many friends that will not look at anything having to do with Catholicism, and I  don’t understand it. You know, as long as Christ is in the center of it, I don’t care about the differences that we have. The bottom line is God is God, and he’s in charge, and that’s kind of how it is. And I’m just trying to figure out my will to go along with his will, because there were many years that I just simply was off course. Even though I knew right from wrong as a child, and I got way off course. So anyway, I’m back on course. I appreciate this. And was getting back on course before 1999? No, actually, I didn’t rededicate my life until 2006, and still was off course. So I would really say about 2012. There were a number of serious events that occurred within a very short period of time. I had somebody kill herself in my family that was very young, only 28, and I think a lot prescription pills were involved; she was even working at a hospital. And we certainly have addiction in our family. And it just made some folks really stop and think about what is important here, and to ask those really serious questions, like a lot of people feel in certain religious-based homes that if you kill yourself, you’re just dying and going to Hell, but that is not in fact the case. And so anyway, it was just a number of events. I always knew, you know, I always knew God was there. I always knew. I just chose to step away and do what I wanted to do, basically [laughs]. I really appreciate your sharing that. You’re being very candid; I appreciate it."
  },
  {
    "first": "Hank",
    "last": "Maiden",
    "id": "cjFDLM5Qu",
    "age": 84,
    "residence": "Carrboro, NC",
    "occupation": "Retired",
    "interviewLocation":"Orange County Senior Center",
    "interviewDate":"July 14, 2016",
    "duration": "18:56",
    "quote": "I was in Fernley, Nevada. Employed by Amazon at a fulfillment center. They were mostly young people, exploring the internet. And moving twice as fast in their minds as mine could have worked.",
    "transcript":"audio/Maiden, Hank_071416.pdf",
    "audio":"./audio/Maiden_compressed.mp3",
    "text": "Let’s just start with, tell me what you remember about New Year’s Eve, 1999. Now, that’s the New Year’s where it changed from 1999 into 2000. Y2K. The changing meant that Microsoft had screwed up, and they weren’t ready to have my computer or my laptop work properly. So that was the great tension among people. I wasn’t too concerned because I thought probably Apple would be on top of it. [smile] That’s interesting. So Y2K was the first thing that jumped out. You said that you weren’t too worried about it. What were your reactions the day after? Amazement and gratitude. Why do you say that? There are so many airplanes that depend on accurate information for people to fly. There are so many police departments that depend on accurate information to keep people off the streets that shouldn’t be there. There’s so many ways in which the military cross the world depends on if somebody screws up there could be a major disaster. You sound like you have some background in technology. What did you do for a living? Marketing. Sort of applies to everything. Do you remember personally what you were doing on New Years? Um, I was in Fernley, Nevada. Employed by Amazon at a fulfillment, um, center. And I think I was probably working. That’s because of Y2K? I think I probably had the evening shift. I don’t remember the day of the week. Could you tell me the day of the week? [Laugh] I don’t remember myself. So you were with Amazon in 1999? That had to be an interesting experience. I was there for about six months. Temporary hire. And I enjoyed the work so very much. We were a lively group of people. I was the oldest man working at the time. Appreciated it because, of inclination, and because of the nature of the work assigned to me by my boss. I walked 10 to 15 miles a night. I was in charge of the fulfillment aspect wherein boxes that Amazon ships in, have to be constructed on site. And that means that at that time, Amazon was on the cheap. They were still in very new. All the equipment was very old and it broke down at least once a week. Ball bearings all over the floor. And so there’s a lot of improvisation, and growing up in a family in Iowa that were farmers, there are a lot of backyard geniuses. And Amazon at the fulfillment center, specialized in backyard geniuses. They were mostly young people, exploring the internet. And moving twice as fast in their minds as mine could have worked. But I liked talking with them, if they talked to me. You said you had to walk 10 to 15 miles, what were you doing exactly? Probably, boxes came from Idaho and if they were late in shipment because of snow or because of failure to order in time, or order sufficient quantity to keep up with the demand chain that Amazon just feeds on, we had to you know, look around and see who in this half-million square foot arena, there’s several places where these flat box, unconstructed boxes would be stored. And there was territorial imperatives. Meaning that some divisions wanted to make sure that they had enough. And through the scarcity mentality, ensure that. That’s why I was walking around. I’d sniff out where are those boxes? Where are they in quantity? And if I had permission, if it was really really, as it was on the night of Xmas, a really reayll hard time, I’d simply look the other way as I sneaked as many as I could over to where I needed to have them. And we had a record number of shipments that went out. Our ability to construct boxes swiftly, and I also distributed them. I look around to see whose shipping more, and I hand on a truck, hand truck, hand-deliver the constructed boxes to places where they were needed. So you were only at Amazon a short time, but it sounds like you witnessed rapid change. It was interesting. And severe. I worked initially just regular shift. They paid well for that time, that era. Would be in today’s equivalent, $15 an hour, $16 an hour. If I worked overtime, that was great, and if I got to double time, that was terrific. And sometimes I was working close to 80 hours a week. Do you remember some of your coworkers’ thoughts or attitudes about Y2K as it was approaching? I would characterize it as, without it sounding accusatory, the “is-nes” of corporate business. And I would say that most of them around me were like, other...I worked for United Steel, I worked for concrete companies making stuff from the, actually from the stone being broken up. I’m aware that people without a lot of reading experience and only television experience are limited in how they feel or how they express things. And they just basically ignore, you know, whether things are going to happen or not going to happen. There were individuals that took advantage of things. One guy was shipping drugs on truck shipments to various parts, and he was caught. What about the whole notion that – the Y2K Bug, and for various other reasons – they thought the world was going to end? Do you remember people feeling that way or talking about it? No, no. It wasn’t as if it was end times. If it went to that level, people, and I can’t say anything explicit..,I didn’t expect end times, I just expected a lot of trouble. Nuisance mostly. And there was a bit of that. Do you remember some of the examples of that? Well, people blaming it on their computers went down. Even if it wasn’t because of the computers -- I have no idea. So you were living in Fernley, Nevada, at the time? Yes, I had been living in Oakland. I was recovering from cancer, prostate cancer. And it was my first job. I completed 32 units of special education in an MA program at San Francisco State.  HM discusses his brief teaching career and disgust with the violence and ineptitude in the low-income special ed school system in Richmond, CA. So what was Fernley, Nevada, like? Dust bowl, basically. It was very, very gritty, poor, unshaped, un-designed, Gold Rush time with Amazon newly arrived. Do you remember your first encounters with the internet, with using email and computers? Phew. I think, I hate to get to date, because that would challenge my memory. But basically because of work I was doing, in real estate, I was computer literate to a modest degree. I went to a lot of trainings. Had the pleasure in the bay Area to be in the same room with Larry Eliason, same room with Bill Gates, you know, and talking to them, and Steve Jobs. There’s just like, theater, for people who were considered living in a bubble. And at the time, I do recall, this would go back to 1997, being here in Raleigh NC with someone else that worked in marketing, and he was sure that bricks and mortar would dominate and that the e-commerce would never get off the ground. Why is that? I think he understood connectivity. That you have to know people and appreciate them, and I think that’s even true now, on the internet, there’s sort of an inner process for the people who are most successful with their businesses on the internet. But they’re able to create in their images and their mind, they way people are attracted to products. And whether they’re going to purchase one way or the other, whether they’re going to be looking for competitive pricing. So it’s about still establishing a personal connection, even though it’s online? I sense that is the challenge. I think that the companies – not necessarily the ones most successful, because that would be like failing to appreciate that some of the developers in among the more recent successful   groups in San Francisco or LA or New York or Paris, London, they’re selling Kool-Aid acid to each other. The people who feed off the bottom know where to find them, and in situations that we live in, week by week, month by month, the crashes in Hong Kong or Singapore, Sydney, Australia, eventually affect small companies, or wannabe big companies. And we’re talking now that people want to be billionaires almost within six months to a year. I listen a lot to news from Asia, stock news, I don’t follow it in a metric sense, but I’m trained from University of California as a sociologist, and I can, you know, I understand trends, I understand...I even understand persuasion. That’s how I was modestly successful in real estate. We live in an increasingly difficult world. And I’m amazed that young people, they’re called Millennials, I’m amazed that even the Generation Y fully appreciate what Bernie Sanders was saying, not because most people think like socialists, like European socialists, we’re not talking about Moscow socialists, and you know, we live side by side and we find middle ways for things. But what they do realize is that in the more recent crashes, more and more of the assets, not just money, but resources, have flowed to the top, I’d call it the 10 percent, not top one percent. HM mentions that they serve food at the Center, then asks if I have any more questions. I’m just trying to paint a picture of your life that you remember from that time – 1999 going into 2000 – and contrasting it with your daily routine now. It’s a picture of aging. Basically, I was so disappointed in those years that the generation X people had been successful – I’m talking about the oldest of them – in moving the young aging group, in their 50s, to join AARP and lobby in order to change the direction of not only SS but especially Medicare and most especially Medicaid for the poor. I was so disgusted with AARP, and I heard as I went to meetings that I did become involved at the policy level in the state of Washington where I was living. I moved there and I lived there for nearly 10 years. And Bellevue, and you know, over in the west side of Puget Sound. I’d gone to high school there, so I was felt [?] my roots, and I recognized how disappointed people were who relied on respite care. And respite care was taken away. And they relied on other kinds of benefits that had part of Medicare. And in the long run, if you go to AARP now, or if you go in this center to the staff that are concerned to construct the next five-year program, they’re concerned to no longer think about people in their 70s and 80s going to nursing homes. They’re imaging that they’re probably going to be as lively as the Asian people who are coming from all over the world to Seymour Center."
  },
       {
    "first": "Michelle",
    "last": "McKee",
    "id": "8jLLBK4Qk",
    "age": 42,
    "residence": "Hillsborough, NC",
    "occupation": "T-shirt designer",
    "interviewLocation":"Orange County Senior Center",
    "interviewDate":"July 14, 2016",
    "duration": "11:39",
    "quote": "My grandmother came over because she was fearful about the turn of the century and all of the hype that was going on with Y2K.",
    "transcript":"audio/McKee, Michelle_071416.pdf",
    "audio":"./audio/McKee_compressed.mp3",
    "text": "My name is Michelle McKee, I’m 42, and I live in Hillsborough. I grew up in Hickory, NC. You already heard a little bit about the project, and I didn’t want to preface it too much so you had something prepared in your mind before we started talking. I’m interested in getting people’s thoughts from that time period. What do you personally remember about that day – that New Year’s Eve 1999, going into 2000? That’s interesting. So the first thing that comes into my mind, and since it’s been years now, it’s fuzzy, but the memory that comes to my mind, is my grandmother came over, because she was fearful about the turn of the century, and all of the hype that was going on with Y2K and all of this stuff that the media was speaking of. So I remember her coming over and actually staying that night. I didn’t go out, we didn’t have a New Year’s party, we simply just stayed in the house, as a family, did our normal routine that night. And the only thing that was unusual was my grandmother stayed and talked a lot about what the future held, and was fearful about the turn of the century. Why was she afraid? Well, she was caught up in some of the media sensation. And she, not being a tech-savvy person, she didn’t quite understand computers, and didn’t embrace technology, she thought that this was gonna cause like a major glitch in like the banking issues, and she may lose all of her money, and the world may implode [sing-song, yadda yadda tone]. It was all very sensationalized in her mind. Now, you have to keep in mind, this was a lady that had an eighth grade education; she grew up in rural North Carolina, so there wasn’t formal education there, and I think she fed off some of the sensationalism of the media.And did you try to quell her fears? Or did you share on some level some of her concerns? I certainly shared trepidation because the media talked about it a lot. I didn’t lose sleep. She lost sleep over it. I didn’t lose sleep over it. She was truly fearful. I wondered what would unfold. I thought there was probably a lot of embellishing of what could happen. But yeah, it was on my mind. I think like many Americans. Did you expect something to happen? I did, yes. I did. Now what was that something, I couldn’t say. I expected something unforeseen to happen as related to computers. And it would affect our daily life in some way. Do you remember how you felt the next morning when you woke up and – Relieved. Sure, relieved. And you know, this is the, it was mostly relief. My grandmother was relief on an exponential scale, But it was just like, well, ‘Oh.’ You know, nothing major happened. We’re all here. Let’s go forward. That kind of sigh of relief. Did your grandmother take any steps besides coming to stay with ouy that night to prepare? To prepare for the turn of the century? That’s a good question. I have to think about that. I do remember her saying that she had kind of squirreled away as she called it, extra money. She was all cash in hand. She wasn’t a credit card kind of person. This was the case before the Y2K bug? Yeah. Absolutely. But I do remember her saying 'I better have a little extra on hand.'That’s funny, I haven’t thought about that. I hadn’t thought about that in a long time. So take me back to the clock ticking down. Do you remember midnight approaching? No. I was actually asleep. So you can see I didn’t lose sleep over this. I have a felling she was awake. We shared a room. I was in a very small house, and we shared a room. She had the bed and I had an airbed on the floor. And I feel sure she was awake. I slept through it. I wasn’t out partying. I wasn’t interested in any of that at that particular time. So you were asleep but your grandmother – Exactly. Yeah. What do you remember about that night before you fell asleep? Two days before the turn of the century? Or the night – Either. The buildup to the transition. I don’t remember anything specifically there. I don’t. And then as far as, beyond what you personally remember. We’ve already talked about Y2K. What else, when you think about 1999, that time period becoming the 2000s, what’s the first that jumps in your mind? [laughs] Prince’s song. You know, of course, with his passing, that’s probably fresh on my mind anyway. Also, the other cultures in antiquity who had feared the turn of big, centuries. And how things like the Mayan calendar. Just how these things get built up and it always seems to work out. Were you aware that it wasn’t actually the turn of the millennium? I was. Right, yeah. I was. A lot of people – My grandmother was not. And it seemed like it was pedantic to point that out to people. I don’t think she would have grasped it. I mean, again, you have to understand the person that was there, you know. It wasn’t a conversation that was needed. Yeah. Interesting. So it was you and your grandmother, and you were in you said, Hickory, at the time? Hickory Wow.  Which is in the foothills of NC. I mention that my former sister-in-law is from Hickory. Do you remember what some other people in town were doing on that New Years? Since I was in the house, and not out, I couldn’t say for sure, except that there were parties, and you could hear fireworks. And you could hear, commotion, in the neighborhood. But that’s not particularly different from other New Year’s Eves. I know that there were several bars downtown that had special events, and had the Y2K glasses, I remember that. They were green. I remember they were green, I think. Yeah, I think they had green, lime green glasses. But I just heard about all of that. I wasn’t a part of it first hand. And another theme that seems to have emerged in talking to people with this, is how much, how exponentially fast the technology has changed since then. Do you remember some of your first encounters with email? [laughs] Yeah. I do. I didn’t have an email account until I went to Carolina. I was in pharmacy school. What time period was that? So, let’s see, I graduated high school in 92, I went to Carolina in 94, so it would have probably been 94, 95, when I actually…because, you know, they set us all up with an account and prior to that, I didn’t have one. I knew about email, but I didn’t see a need for it. I was still very much a talk on the phone kind of person. So I can remember distinctly going to the computer lab at Carolina, in the pharmacy school there -- and they had small computer lab. Small. But it was a big deal for us to go there, get your account, and you would email the person sitting across from you. And it was the coolest thing, right? I was probably a little bit of a late adopter, because, I’m not anti social media and all of that, I just think it’s a huge time drain if you’re not careful. And I had some thoughts early on about email, like, 'Why do I need this when I could talk with you? You’re right there.'So I might not have been an early adopter. Funny how that’s changed, right? Sure. I still don’t tweet. And I don’t do Instagram. I do Facebook, but I think 40 year olds are probably the ones doing that. I hear it’s not cool for the younger ones, so I don’t know. [laughs] Do you remember getting a cell phone? I do. It was [laughs]. It was a mounted cell phone, it was in my car. It was not the kind, obviously, that you walked around with. It was mounted. And I had it in my car and my mom gave it, because I was working some late shifts and things like that. And it was for emergencies and it made her feel better that it was in my car. I remember having only certain set of minutes. It wasn’t very generous. I used it very sparingly. And it was this big thing that sat in the middle, between the passenger seat and the driver’s seat. I also remember, just as an aside, getting this humungous bill for minutes I didn’t use, and come to find out, I was like zapped. There were these things, I don’t know what the terminology is, but somehow, my number was stolen. And the way the police explained it, I must have been talking on the phone at the time, someone saw me and was able to retrieve my number. I had this outrageous bill that I never accumulated those actual minutes. But this was this big clunky thing. I do remember it very well. Do you remember an experience with new technology that’s come along since then, or in the 90s or since then, that’s just like a 'wow' moment? Like, 'This is totally new?'Facebook was a 'wow' moment for me. Yeah, it was. My girlfriend from high school -- who I had not seen since graduation; we were not in touch with each other – sent me an email inviting me to join Facebook and be friends. I thought, “You know, we’re friends, we’re friendly; we haven’t seen each other but we’re friends, my idea of friends.” I thought, “Well, she’s a neat, neat person. I really liked Robin. I’m gonna see what this thing is.” So I joined, and then [makes the sound of an explosion], flooded with – you know, once you’re on, you’re flooded with friend requests. That was pretty amazing to me, to kind of walk back to high school and revisit all those people. Do you think the experience of that transition, 1999 to 2000 New Year’s and the new millennium and all that, would have been different if you’d had Facebook to connect with people in that way back then? As far as alleviating the fear? Or any aspect of it? Yes, as far – Sure. Sure. I think probably, yeah. We would have been all more connected and probably less fearful. I don’t know though. You think more connected? If we were all on Facebook? I think so. Don’t you feel more connected now than you were in ‘99? Toward your environment? Oh, certainly, I do. I think it’s breadth and not depth, as much. Sure. We’re not talking about deep, deep conversations, you know? Yeah, no. But I don’t think that was the question, right? I think there’s that superficial connectivity, yeah. But I don’t know which way it would have gone, but perhaps I could envision the other way, where if we were more connected, even superficially, there may have been more fear upon us. Because there would have been more social outlets to have discussions, and everybody has their two cents to you know, place on Facebook about an idea. People would have thought Facebook was going to explode or something. Yeah. I guess you’re right. I mean, again, I didn’t lose sleep over it. It was on my mind as it was every other person that I knew. My grandmother was a different level, and I’ve often wondered how other elderly people felt at that time. I only knew my grandmother’s perspective. That’s why I’m here, actually. Yeah. Michelle recommends that I talk to James Emery, a farmer selling produce next to us at the entrance to the Senior Center. I interviewed Mr. Emery shortly afterward.Just to tie this up. Is New Year’s a holiday that you ordinarily celebrate? I’m pretty boring. I have a four year old, so I don’t like to go out for New Years’ Eve. Because sleep is more precious [laughs]. So generally, no, it’s not a holiday that I do something major, late, you know. I have been to several concerts, like the Avett Brothers put on a great concert. I’m familiar with the Avett Brothers’ live album from their New Year’s Eve concert in Greensboro. We discuss the band for a minute. So that’s an exception, versus my every year. Good exception."
  },
  {
    "first": "Mary Ann",
    "last": "Meegan",
    "id": "7gfVfjTy",
    "age": 75,
    "residence": "Chapel Hill, NC",
    "occupation": "Retired nurse",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "3:29",
    "quote": "It was something brand new. And not everybody who lives is allowed to experience that.",
    "transcript":"audio/Meegan, Mary Ann_080616.pdf",
    "audio":"./audio/Meegan_compressed.mp3",
    "text": "So think back now, take a minute. New Year’s Eve 1999, going into the new century, 2000. Tell me what you remember. I was in Michigan. And that was a big day, because we didn’t know what was going to happen. You know, the computers were big deal, everybody was worried about that sort of thing. And we were, you know, a little bit wondering, wondering what was going to happen. And saying, 'Now, why didn’t they think about that, when they set up [laughs], you know, the...' 'Shouldn’t somebody have seen that coming?' Yeah, shouldn’t have thought about that, that 25 years from now, we were going to...so. And so we were in Michigan, at a lakefront home on New Year’s Eve. And celebrated the millennium. And who were you with? I was with my husband, with my other (or older?) friends in this little community that’s called Birchwood. Actually it’s a little community that Carl Sandburg had a house. And called Sandburg. This is Swede, if you know. And you are, I presume? And I am Swede, too. How long have you been in the United States? Forty-four years. And anyways, we were very welcomed into this community because I was a Swede, and I was the first Swede since Carl Sandburg. [laughs] So anyway, that’s my story of the millennium. So you remember the Y2K bug and the potential problems with that. Uh hm. But beyond that, did the moment seem important to you? Yes, it did. And why? Because it was something brand new. And also, that not everybody who lives is allowed to experience that. It’s kind of a moment, this...It’s the luck of when you’re born. Yeah, exactly, exactly. So that’s my story."
  },
  {
    "first": "Johnny",
    "last": "Osborne",
    "id": "LKvbT2hW8",
    "age": 50,
    "residence": "Bristol, TN",
    "occupation": "Construction worker",
    "interviewLocation":"The Pier at Garden City (Murrell's Inlet, SC)",
    "interviewDate":"July 20, 2016",
    "duration": "7:48",
    "quote": "I remember more when I was two years old than when I was 30.",
    "transcript":"audio/Osborne, Johnny_072016.pdf",
    "audio":"./audio/Osborne_compressed.mp3",
    "text": "I’m talking to people, putting together a story. It’s about people’s memories from the turn of the millennium, the last century, 1999 going into 2000. Do you remember where you were on New Year’s Eve that day? Home. What do you remember about that? Going to sleep, brother [laughs]. I go to sleep every year before New Year’s. [looks to his daughter, on his left] Daddy never stays up for New Year’s, do we Tweety? Mr. Osborne couldn’t remember anything else about NYE99 and didn’t share his thoughts on the event, or how things have changed. He couldn’t even remember if his daughter was born at that point. He claimed he had his first cell phone for 30 years. Where you living in Bristol back then? No, I was raised in Coalfields. That’s in – Kentucky. I remember more when I was two years old than when I was 30. Do you, brother? That’s part of the reason I’m working on the story. Like, I have three kids now, and if New Year’s 1999 happened right now, I wouldn’t remember shit either. Shit, I don’t remember. I was probably in bed. [laughs] I don’t know, dude. [looks to his son, who is fishing, to my right] You remember it, Bubba? You were born in 1999. BUBBA (incredulous): I was a year old. I make a joke about what a weird interview it would be if Bubba did remember the event, given that he was a newborn. Johnny recalls his brother’s death in KY in 1968, and playing in the yard. But hell, when I was 30, 40 years old, hell, I didn’t even know where I was at. Probably working. What were you doing for a living? Concrete. Construction."
  },
    {
    "first": "Daniel",
    "last": "Read",
    "id": "gSGY4B9fG",
    "age": 63,
    "residence": "Durham, NC",
    "occupation": "Attorney",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "10:45",
    "quote": "When I was a kid, in elementary school, I thought, 'Gosh, in the year 2000, I’ll be 47 years old! That’s just impossibly far away.'",
    "transcript":"audio/Read, Daniel_073016.pdf",
    "audio":"./audio/Read_compressed.mp3",
    "text": "So take me back to that day. Take a minute to think, and walk me through what you remember about New Year’s Eve 1999, turn of the century. Well, I just remember we were really worried about what might happen, with all our computers and electronic stuff, and the electronic systems, all of the things that were going to happen. But then at some point, I think we got a bunch of candles, we laid in some food (?), and we just felt like, “Well, whatever happens will be whatever happens, and we’ll be in the same boat as everybody else.” And actually, I wasn’t feeling that well, now that I remember, and I said, “Well, I’ll just lie down for a little bit.” Famous last words. And of course, my wife was going to go to a party, and she didn’t feel good about celebrating the New Year without me, so she came back home, and she laid down on the bed, and we both slept through the millennium, and nothing happened. We were relieved to learn later that the Itlaian government had basically done the same thing, and said “Eh, whatever happens, we’re going to be okay.” But you do remember taking some preparations? Yes, we had some candles; we had extra food. We were sort of just wondering what might happen. I can’t really remember what we did…we did something with the computer to back it up or something like that, but we really didn’t do much else. What were you doing for a living back then? Same thing I’m doing today. I’m an attorney. I have my own office downtown. Do you remember anything related to Y2K, as far as the law? People making preparations -- Same thing. You know, most all of my work is done on computer and saved on computer, so I saved everything, and turned everything off, and saved it to a separate hard drive, and all this crap. Then the next day, everything was just the same as before. A lot of worry about nothing. When I was a kid, in elementary school, I do remember this: I thought, you know, “Gosh, in the year 2000, I’ll be 47 years old! That’s just impossibly far away.” And now, here it is 16 years later, and here I am. So did the moment have some personal meaning for you? Just because you felt...I remember one gentleman I spoke with this morning said he felt really privileged that he had reached that point. It didn’t really have so much personal meaning, it was just sort of...My dad died when I was 27, so I think that kind of made me feel like, “Wow, I made it.” No, it didn’t really have much personal meaning. Did life seem like what you thought it would be like? Because with, you know, sci-fi, whenever it was the future back then, it was always [booming voice] “the YEAR 2000” was the date that people use when they were depicting the future. Did it seem like you thought it would be? I think when I was a kid, I thought there’d be more space travel. You know, people flying around with jetpacks or whatever. But then, as I grew older, I realized that that stuff was not likely to happen in my lifetime. And I guess the thing I feel the worst…I feel really good we haven’t had another nuclear war. And that nuclear weapons are…there are fewer nuclear weapons now than when I was a kid. But I guess the biggest thing I feel is just how I’m kind of sad that we as a race have not taken better care of the world, and that the optimism I felt when I was young about the year 2000, my son doesn’t feel about the year 2100. Older people are old and depressed because they’re going to die pretty soon, and the younger people cheer them up. And it seems like lately, I’ve been saying, “Come on, Quentin” – who’s my son – “we’re counting on you, you know?“ I’m trying to cheer him up. The world is not so depressing as he thinks it is. He’s a climate scientist, so he’s...So it’s primarily because of the environment that you think that’s the case? Yeah. Not as much the other cultural things? Well, I mean, I think the environment is being degraded quickly. A lot of it has to do with a lot of other issues, like poverty, overpopulation, industrialization, all those things. So it’s kind of a lot of things are happening at once. It’s not something I’m real happy about. So if somebody who was too young to remember 1999 – wasn’t even born – asked you, “What was life like in 1999?” What’s the first thing that pops into your mind? What would you say? Well, the Red Sox still hadn’t won the World Series, in my lifetime. We both laugh hard. That’s big, that ‘s big. We talk about the 2003 and 2004 series between the Yankees and Red Sox. I mention that some researchers did a study on people’s memories of the 2003 series. This leads into a longer discussion about the Red Sox and Mr. Reed’s baseball memories. It is interesting, but beyond the scope of this project. Other than the Red Sox not having won the World Series, you think back then, you think about it now, how would compare 1999 to 2016? I kind of feel like I’m getting to be a better person all the time. So I’m still kind of working on myself, trying to sort of live out the ideals of Christianity in my life, and I think that I’m doing that a lot better now than I was in 1999. I have a lot more patience with my children and my wife, and so it’s good.  If you don’t mind me asking, what denomination? I’m a Quaker. Do you remember the occasion being particularly momentous for other people in the Quaker faith back then? Not really. Everybody was kind of worried that something horrible would happen, and nothing horrible happened. Was it something that they talked about during services much? Not really, no. I ask because in some denominations, I’ve found in doing these interviews, it was a big part of their religious experience at the time. And they worked it into a lot of sermons and such. Well, I don’t know. No, no, well A, we don’t have sermons. We have silent worship, so...Right. No, it was not a big deal."
  },
  {
    "first": "Sandra",
    "last": "Roberts",
    "id": "pesXpqU3J",
    "age": 72,
    "residence": "Chapel Hill, NC",
    "occupation": "Retired UNC administrator",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "8:34",
    "quote": "There have been many advancements in many ways, but we’re replaying some of the cultural and racist nationalism that I didn’t think we would ever be replaying again, in 1999.",
    "transcript":"audio/Roberts, Sandra_080616.pdf",
    "audio":"./audio/Roberts_compressed.mp3",
    "text": "So you kind of know what we’re talking about here, and you said you’re limited in what you remember. But just go back to that time and tell me, just in general, personally or in terms of the cultural landscape at the time. What stands out in your mind from then, 1999? Not much stands out in my mind actually. I think it was newsworthy, a news item at the time, and I think we were all sort of holding our breath, thinking what might happen to computers or what. And I don’t think that I was terribly concerned, but of course you can’t avoid it, you know? And I don’t remember anything terribly significant about it. So did you take any preparations at all for the Y2K Bug? No. I didn’t, that I recall. We might have unplugged our computer. Do you remember sort of what technology you were using back then? I was trying to just remember that, and it was probably pretty primitive, like you know, one of the old Apple computers with the screen in the middle. Something very, very simple, like that. No cell phone? I don’t remember. My husband had a cell phone early on. That’s about right when they came out. Right when they came out. But I don’t believe we had one yet. So that wouldn’t have been a concern. It was only computers. So what would you…you don’t remember that particular night. What would you typically be doing on New Year’s? Typically, we would...well, at that time, we would have probably…we used to go to the beach between Christmas and New Year’s Day, and we may have been at Sunset Beach at that time. Were you still living in this area back then? Oh yes. We were living here. Not in the present house, but in another single-family dwelling. And we might have been at the beach, so it might have been kind of a distraction, as far as what was actually happening. But no big parties, no big family ritual or anything like that. And were you working back then? Yes. And what were you doing for a living? I was working at the University, as a director of the Visitor’s Center, and director of the...I don’t know if I was yet the director of the Speaker’s Bureau, but I was two things. Interesting. And you’re now retired? I’m retired, yes. I am. Do you think things are better or worse than they were then? In 1999...well that’s an interesting question, and you know, with the current political situation, I would think that...To be determined? [laughs] Yeah. To be determined. I’m not sure. I think that, you know, there have been many advancements in many ways, but we’re replaying some of the cultural and racist nationalism that I didn’t think we would ever be replaying again, in 1999. I thought that, you know, we were sort of finished with having to deal with civil rights and women’s rights and things. And suddenly, the circle has come back again. Unfortunately, it seems like it always does. Yes. Yes, it does. So I’m not sure whether we’re better off. We’re certainly at a different place, a sort of frightening place, right now. Might be more frightening that the Y2K bug. Really?Well, with what’s going in our world and the, mainly nationalism and the resurgence of racism. That’s well said. What do you think will be the topic on everyone’s lips in 2100? Earlier that morning, a woman had walked up to the table while I was asking this question in a previous interview (see Jennifer Ho). Sandra resembled this other woman, and I mistakenly mention that Sandra overhead this earlier discussion. I realize the mistake by the confused look on her face, and apologize. We joke about it. So 2100, what do you think will be the topic everyone is talking about? I don’t have the vision to really say, other than if we don’t…probably space exploration. Interesting. Lots of, I would think, space travel. I would think depending on what we do environmentally, whether or not our civilization will still be here, or what it will be like, because we have to take care of our Earth, and of our water, and of our atmosphere. I don’t know. Interesting that you mentioned space exploration. Back in the 20th century – which seems weird to say, “back in the 20th century” – whenever they were setting a story in the future, it was always the year 2000, or a date that starts with two. Yes. Do you remember thinking back as a kid and what that, the year 2000, would be like? How did reality meet your expectations? I don’t know that I had any big expectations. I think when you’re living in the present, it’s very hard to project unless you’re a science fiction novelist or something like that. It’s rather hard to predict, but I don’t really know. I hope there will be a lot of diseases that are no longer on the front page of our news story, and things. But there are so many things that have happened that no one could have predicted, that I think that the only way we can prepare is to educate ourselves and be ready for change and the surprises that we face. Zika. I had never heard of Zika until probably six months, a year ago, or something, I don’t even know. Ebola. Ebola. And so no one could predict that, but what we do know is that we have to deal with issues and problems, and we have to be problem solvers. And we don’t need to…we need to think in those terms, instead of some of the terms that seem to be on our mind more today. Well said."
  },
    {
    "first": "Jonathan",
    "last": "Romm",
    "id": "FNwqCK8d7",
    "age": 36,
    "residence": "White Cross, NC",
    "occupation": "",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "14:11",
    "quote": "I miss the darkroom. I don’t miss the inefficiencies that were there. I miss the smells. It was you versus your negative and the chemicals, and trying to find something beautiful.",
    "transcript":"audio/Romm, Jonathan_080616.pdf",
    "audio":"./audio/Romm_compressed.mp3",
    "text": "So you’ve already been privy to the topic somewhat. Take me back to New Year’s Eve 1999; it’s going into the year 2000. On a personal level, paint the picture for us. Where were you, what were you doing? Personal level, so I was, let’s see, a sophomore in college. And there was…we had Ethernet. We didn’t have wireless. We did have cell ph -- some of my friends did have cell phones with the Internet on it, and computing capabilities. I remember that was Treo was the version of phones that were popular then. I was at a New Year’s party. Prince was playing...Of course. Of course, yeah. It was everywhere I’m sure, that night. Lots of royalties. Yeah, what foresight that man had, right? [laughs] And there was…we were at a house party. And I remember there was a large contingency, including myself, who were running back to our dorms prior to the ball dropping to make sure that our computers worked. There was a frenzy...I know the question is what we were doing that day -- Oh, no, it’s whatever comes to mind. Yeah, there was a frenzy, kind of the week leading up to that, with Y2K, where we were all of us frantically saving to the three and a half inch hard floppies, if you remember those. All of our school work, Excel spreadsheets, papers that we were writing, and even some people were trying to go back to some of their documents from high school. A little bit of, not pandemonium…and some nostalgia. I remember some nostalgia. I was doing this as well, saving some of my documents from my computer which I had from high school, going back and looking at the poorly written essays that I had in English classes and whatnot. Worth saving those. Yeah. I mean, I did it. I put my name on it. So jumping forward to the New Year’s Eve. We went a bunch of us, not dorky types, but we ran back to our dorms to turn on the computers to make sure that they still worked at 12:01 or 12:02, you know, after the ball dropped. And everything seemed to be working fine. And I had a friend, I think it was John’s computer, that coincidentally had a bug. I mean, there were maybe, let’s say there were 10 of us that went back, all of our computers were working fine, except for John’s, which the next day we found out was due to an unrelated bug. But there was this, “It’s here,” mentally --- Wow. -- that quickly caught fire throughout…in dorms, word spreads like that. So he took his computer maybe to Best Buy or the campus technology people, and they fixed it for him the next day. But there was a slight moment of panic, where we were back to basics, you know. We gonna play with sticks and rocks...You ran outside to see if planes were falling -- Yeah, exactly. And it was kind of like, “Cool, they did predict it.” Interesting. The naysayers were correct. And all of the folks with the FBI and CIA who said, “No, Y2K won’t be an issue,” they were wrong. And all of the kind of undercurrent of “We just don’t know, and it could break all the systems, and da-da-da-dah.” So we had kind of an interesting 24 hours, especially for John. Now, this is New Year’s, which is typically Christmas break, but you were on campus? We were on cam--. So there was a group of us who were RA’s. And a group of us who lived…so I went to school at Marquette University. I was from Milwaukee, which is right down the road. We went back to campus, because who wants to be at home for New Years? And so there was a group of us who were back on campus, and because we were RA’s, we had keys to the dorms, we could go in. Interesting. And you remember the Prince song playing repeatedly, on a loop. Absolutely. Absolutely. I want to say it was even playing throughout the quad, but that may be me wanting to remember something that wasn’t there. So it’s interesting that we bring up the Prince song. He wrote that in what, 1983, or something. So the mindset there is, “We’re gonna party like it’s 1999.” That it was going to be such a big deal, right? Do you feel like it was that way? Well, so remember I was a young college student. And probably everything was a party at that point in time. [laughs] Right. And I was working, so we had a little bit of money to play with, and all that new exposure to kegs, and whatnot. So it was a party. And this was probably like one of the pinnacles. It was a smaller party, because, like you said, everyone was out. But there was a group of us who were either from the area, or were RA’s or whatever. So that was a fun time. Did it feel important to you? It’s hard to say with hindsight, but – I remember, I distinctly remember coming home, maybe for Thanksgiving, in 1999. This is when all of the Y2K stuff was starting to take place, or it was being brought to my attention. And talking to my parents, who lived through the Kennedy assassination, Vietnam, Christa McAuliffe, those moments in time where you remember where you are. And I remember thinking, “Is this going to be my generation’s ‘I remember where I was when’?” And it wasn’t, because our generation’s is 9-11. But you didn’t know that at the time. But we didn’t know that at the time, and then it was…maybe there was a little bit of a letdown, that the system didn’t break, you know? The status quo continued, as far as we could tell. You just actually cherry picked my research question. Ha! That’s one of them. Because I had the same thought going into it. I was 23 at the time, and I remember vividly thinking, like, “Is this going to be something that I remember where I was and what I was doing?” And just flippantly discussing it with people, it’s funny: a lot of people don’t remember it at all. That will be one of those...you talked hindsight, now let’s talk foresight. I think with – and I have a two-and-a-half-year-old son in my arms right now, Daniel – I have a feeling when he has kids and they’re wearing their version of Google Glass or whatever the technology is, and we’re sitting around at the beach, and I’m old and grizzled, 40 years from now, and I’ll pull up a chair, and he pull up a chair next to me, and I’ll start that conversation around technology, saying, “You know when I was little, I remember when...” And to the best of my ability, explain Y2K and maybe some binary code behind it, the zeroes and the ones and what they were. How the line was supposed to end at 51 or 53, and there wasn’t going to be room for that extra number, or however it was supposed to work. And they will roll their eyes at me. I’ll remember it. But it won’t be 9-11. Do you think that time period was when everything really took off exponentially, in terms of technology? I think it was the precursor. The precursor, okay. The foundations were being laid. Let’s call it the “foothills” of it. Wireless wasn’t there. Technology, as we know it today with wireless and GPS tracking systems [Jonathan looks down at his son] He will be the most surveiled generation in the world to date. That wasn’t...you could see the cameras then. Now you can’t see them. You could plug in the Ethernet connection to get your wireless connection. Now, you don’t plug it in. We’re very, very hands-free, and almost sight-free, if you will, if you know what I mean. And so I don’t know when that leap took place. We were close then, but not quite there. We hadn’t gone wireless yet. We hadn’t gone wireless. We had the AOL dial-up modems, in the early 90s, late 80s, and so it’s kind of like these foothills. And then there was a jump at some point, where smart phones became smart phones, and it wasn’t just this bulky phone, where you could text and call, and also a little bit surf the web. I guess when responsive web design came around, and your phone, we moved…Remember the PDAs that we had? Yeah, where you could write; the Palm Pilots. Right, with the little stylus. So you had that in one pocket, professionals had that in one pocket, and your flip phone in the other. Or maybe you had your Treo that did have Internet, you could kind of, sort of use...And if you wanted to take a picture, you had to whip out a separate digital camera...Right. You had that somewhere else, in your third pocket. Not digital even, back then. Right. Most people still used traditional film. Yeah, you took it in and waited a week, and realized that you had 24 really bad pictures. There’s a blast from the past. Do you remember having film developed? Oh, yeah. I was a darkroom rat, and so I remember developing my own film. And thinking about that now…actually, the waste that was involved, with all the chemicals. And now it’s so much more efficient. You had to put more thought into your pictures back then, because you didn’t want to waste a negative. Right. I mean, it was not one-and-done, but 24, 36, and done. And then you waited. And now it’s like...Are you nostalgic for that a bit? That waiting? Oh, yeah. So as much as I say the...I’ll give you a long-winded answer. I miss the darkroom. I don’t miss the inefficiencies that were there. I miss the smells, I miss, like, it was you versus your negative and the chemicals, and trying to find something beautiful. And you had to concentrate on that roll of 24, 36, to find something that really meant something to you. That you were going spend time putting in the developer, putting in the fixer, and then going back and doing it again because the contrast wasn’t quite right and you needed to adjust. And that was...no screens were in front of you. You had Led Zeppelin, you were probably smoking a little bit of grass in the darkroom, maybe two of you. Now I’m starting to understand the nostalgia. Yeah, yeah. And now, if I wanted to a version of that...if I was in school now, it would be either everyone would have their own MacBook Pro in one room, or you would all be in your individual rooms, cut off from everyone else, with headphones on or something along those lines. And the luxury of choices that you have to manipulate photos, and pick and choose from the 3000 that you took an hour beforehand, by holding down the button and getting just the perfect frame. Whereas before, like you mentioned, you had to wait. You had to pick and choose...You had to know what you were doing. Yeah! You had to know what you were doing, or at least figure it out quickly. Jonathan’s son is getting restless, so I ask one last question. Last question real quick. It’s good to ask you this, since you do have your son with you. What is he going to be talking about in 2100? He’s going to...Ha, I just had a conversation two weeks ago with a colleague. I think when we’re sitting around the fireplace on Thanksgiving, 2037, he’s going to be one of the few people in his class – because he will have been of driving age, theoretically, five years prior to that point in time – on why we had so many accidents with our cars, because we were all individually driving them and they weren’t assisted or fully driven by a computer system that’s in place. It will look -- our current driving system – will look archaic to him. He is partially growing up on my wife’s family’s farm and will be driving tractors and other things that won’t, that technology will probably lag just a little bit. So we think that he’ll be one of the handful of suburban kids that will actually have fully driven, without assistance, a vehicle, be it a tractor or a farm truck. The last generation. Yeah. Yeah. I had a conversation – we were on the road last week, and I was with my kids in the car – and it occurred to me while I was filling the car up with gas, and I said, “That’s going to be one of their early childhood memories.” Like [old man voice], “Do you remember when there were gas stations?” “What does gas smell like?” Yeah. “I can’t remember.” “What was gas?” Or even car ownership, I mean, because once it’s all automated, there’s the question of, “Do you need to own a car?” Right. Do we have some sort of a public system in place? Or does a private entity take it over? Where, you know, it can look at efficiencies. And also, we had freedom back then, because we could get in the car, put they keys in the ignition. Whereas now, it’s all defined routes, and you slide your card or your thumbprint, or maybe even a retinal scanner. Who knows how it all takes place? Is Daniel growing up online? In terms of, are pictures of him on Facebook and all that? Yes. Not...we try and curtail that as much as we can. Okay, that’s interesting. Milestones, like three months, a year, and if there’s a cute picture. But he doesn’t have a Facebook account, unlike some of his friends who are in playschool. You gotta be kidding me. Oh yeah. That’s a thing, because once they become of age, their parents are going to turn their Facebook account over to them. And so they’ll have this timeline of the parental comments and photos that the kid can continue through. It’s like a gift of some sort. Very strange. Brave new world. I guess."
  },
  {
    "first": "Missionary Nancy",
    "last": "Ross",
    "id": "w4gc9mCGT",
    "age": "",
    "residence": "Durham, NC",
    "occupation": "Missionary with Irving Ministries",
    "interviewLocation":"Durham Bus Station",
    "interviewDate":"July 28, 2016",
    "duration": "10:49",
    "quote": "I was in church, praising God. We were singing and praising the Lord, New Year’s Eve.",
    "transcript":"audio/Ross, Nancy_072816.pdf",
    "audio":"./audio/Ross_compressed.mp3",
    "text": "My name is Missionary Nancy Ross. I work at the homeless shelter, Irving Ministries, with the Chaplain, and I’ve been there 11 years. I have a birthday coming up. My picture will be in the Herald-Sun on August the 15th. And I’ve been there at the shelter, working with the Chaplain, 11 years. And we go to funerals, nursing homes, hospitals, and all. I’m writing a book. The name of my book is “Laugh, Don’t Cry.” I like the title. It’s humor [?] I think it will sell better than “Cry, Don’t Laugh.” [laughs] Yeah. So Nancy, let’s just jump right in; I don’t want to take up too much of your time. So like I said, we’re talking about New Year’s Eve 1999, and you said you remember. So tell me what you remember about that night. Well, I was in church, praising God. We were singing and praising the Lord, New Year’s Eve. What church was that? Union Baptist. Pastor Reverend Hammond is the pastor. And I told him he could have been a comedian, but he ended up working for God, because he’s very comical. [laughs] Did the service, did it go straight up until midnight? Yes. After; after midnight. Everybody really started praising God after twelve. Do you remember anything about the sermon in particular? He was preaching about Psalms 37. “Fret not thyself because of evil doers, for they will wither away like the grass. Trust in the Lord and lean not to your own understanding, but in all thy ways acknowledge Him and He will direct it to pass.” That’s what he was talking about. Why do you think he chose that Psalm? Well, because I guess a lot of people were afraid and fearful and not trusting God. So I think that’s why. How did you feel? Well, I felt like that what’s we needed, to trust God. He said, “In all thy ways, acknowledge Him and He will direct our pass.” So we have to trust Him, and not man. Man will deceive you, but God won’t. Um hum. Were you fearful? And you can be honest with me, were you fearful at the time that it could have been…something could have happened? No, because I asked God to keep me covered with his blood; the blood of Jesus. It works. You don’t need a gun or a knife or a weapon, because you plead the blood of Jesus, it works. Ask him to keep you covered with his blood. [laughs] That’s what you fight with. [laughs] Are you still with that same church? Yeah. I’ve been there since I was a kid. My grandmother used to sing on the radio every Sunday morning with the Amity Cublee [?] Singers. We lived down the street from there, and she used to say, “When I come from the radio station, you better be ready to go to Union.” Nancy continues to talk about her grandmother working for American Tobacco, her family’s history at Union Baptist Church, how she used to own a jewelry store in Boston, how she got tired of the cold weather and returned to Durham. It’s interesting and worth archiving at the Southern Folklife Center, but beyond the scope of the Millennium Project. So, you’ve already touched on this al little bit, but how do you think things have changed since then, until now? Well, there’s a lot of crime now. A lot of people stealing; some killing. But we can’t focus, can’t focus on that. We have to keep our mind on Jesus. Because he said if we keep our mind on him, he gonna keep us in perfect peace, whose mind stays on him. But it’s a lot happening now. But we can’t focus on that. You gotta keep focused on God. He said, “In all thy ways acknowledge him, and he will direct our pass, not man.” I can’t believe that you remember the Psalm that the preacher was preaching that now. Nancy laughs. Now, is that ordinary, that you remember specific – Normally I always normally do. I really do. Wow. Do you remember any songs that they sang that night? We sung a song about “Only trust him.” “I’m gonna lay down my burden, down by the riverside.” All kind of songs we sung. Different ones, in the audience, we sing. And at my job, at the shelter, I normally sing, “Let Jesus fix it for you/he knows just what to do/Whenever you pray, let him have your way/Let him fix it for you.” I used to sing that. And I used to sing, “Lead me, guide me, Lord if you lead me, I will not fail.” How have things changed at the homeless shelter in the time that you’ve been there? Well, the people at the shelter, they will come and hang from the library to the shelter all day long. So what they did, they stopped giving them 12:00 lunch. They eat breakfast, they get a bag. So that’s for their lunch, so they won’t have to hang around the shelter all day. They could go look for jobs, or even housing. I see that you’re holding a cell phone. Do you remember getting a first cell phone? Since we’re talking about that time period. Cell phone? It’s been so long, my first cell phone, I don’t remember getting [laughs] to tell you the truth, no. How about sending a first email, that sort of thing? No, I don’t do email. Still to this day? No, but I was listening – That’s just like my grandmother.I was listening to my nephew, he’s from Boston..."
  },
  {
    "first": "Laurie",
    "last": "Shapiro",
    "id": "du5pDBcsW",
    "age": "62",
    "residence": "Efland, NC",
    "occupation": "",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "10:54",
    "quote": "I really thought the crash was coming. I believed the hype. I thought surely they couldn’t get the computers together.",
    "transcript":"audio/Shapiro and Ramsey_080616.pdf",
    "audio":"./audio/Shapiro-Ramsey_compressed.mp3",
    "text": "Hello, my name is Laurie Shapiro. I’m 62 years old, and I live in Efland, North Carolina, in a very intentional community that was developed around…early-to-mid 70s. And I only bring that up because it’s related to what I’m going to share with you. SG: And you say “intentional,” like a master-planned community? LS: Um...SG: Or what do you mean by that? LS: Um, in that it has very, very intentional covenants. There’s no asphalt on the road...Jack Ramsey (JR): No streetlights. LS: No streetlights, it’s still unpaved and gravel. It has a community pond, it has…the bylaws originally...covenants originally suggested cats wear bells to let the birds know they’re coming, and it’s the second community built by Harvey...Harvey...somebody. I’m losing, I just had it. And his other one is Roselind, down in Pittsboro.SG: Interesting. LS: [she suddenly remembers the name] Hartland! Realty, I think. SG: Very interesting. How long have you been living there? LS: Since 1998. And it was...so I’m the second generation, and many of the couples of the first generation did not make it because it’s so intensive to build your own house from, you know, a plot of woods that they had to just develop from absolute scratch. SG: So had just moved there as New Year’s Eve 1999 came, not long, right? LS: Um...SG: '98, you said you moved there? LS: Yeah. SG: So take us back. Paint a picture in our minds, what do you remember -- Laurie stops me to let Jack introduce himself. I realize I haven’t asked his name. SG: Oh, yes. Let’s get that for the record. Jack is very soft-spoken. JR: Jack Ramsey. I’m 81. SG: Eighty-one. Looking good, sir. JR: Thanks. SG: Okay, and I presume you were together at the time? LS: Yes. 25 years in November. SG: Congratulations.  Congratulations. All right, so take us back. What do you remember? LS: What I remember was we were very anxious. And there was a lot of anxiety, particularly around computers crashing, water supplies going down, refrigerators going..,I mean, there was just such panic. And it was one of the few times that the community got together as a community to see how we could...JR: To discuss our fears. And see how we could set up alternatives to cope. LS: Oh, what a good way to put it. SG: So they took preparations, absolutely. LS: Mostly, it was discussion. We never got beyond the discussion [laughs]. It was really like, “Let’s start talking about this.” But it didn’t get beyond talking. But there’s some really old-timey hippies in this community, and this was, you know, they were in – JR (to LS): You’re not one of them. Jack and Laurie both laugh. SG: No one self-identifies, right? [laughs] LS: Right. [laughs] So you know, they were sure that the crash was going to happen, and so we were going to figure out how to, as Jack said, cope. And come together, and work it – JR: But there were skeptics, such as myself. [laughs] SG: So you weren’t worried? JR: I was not. SG: And why is that? JR: I guess I just tend to take it a day at a time. And it didn’t seem to me that it was very realistic, what was being projected. SG: So you thought the media was blowing it out of proportion, that sort of thing? JR: I did. I turned out be on the mark. [laughs] SG: Well, better than the alternative, right? We might not be talking about it right now. LS: I really thought it was coming. I really thought the crash was coming. I didn’t…I believed it. I believed the hype. I thought surely they couldn’t get the computers together. SG: I appreciate your being candid about it, too. LS: Yeah. SG: I mean, some people were saying planes were going to fall out of the sky. You weren’t to that level, or...? LS: No, not planes, but banks. Clearly thought the banks were going to crash. And you know, your computer would crash, and all kinds of things would happen along those lines. So you know, this is a very much ‘back to the Earth’ community, so there were all these much more conservative, kind of reactionary…there weren’t the full-scope of extreme reactions, of like “Gold…” what’s the expression? SG: Gold standard? LS: No. People were...'Gold, guns...' When people talked about it. Hiding your gold, guns, and…the third one. “Gold, guns and...” SG: Yeah, it’s on the tip of my tongue; I know what you’re talking about. LS: Yeah. So we weren’t into hiding guns and…[she suddenly remembers the expression] “Gold, guns and groceries!” We were talking about groceries. We were talking a lot about building underground places to put food. SG: But you never got that far? Just talking about it? LS: Talking about it. We have a couple members of our community I’d love you to talk to. Easy phone call. SG: Okay. LS: Yeah, they were the ones that have this incredible house in our community. And they were the ones who hosted the meetings in their house. And they were the ones...they’ve done a lot of peace work, conflict mediation work, alternative school work. And so they were...they bought it. They bought it. They bought that we needed to do something and get prepared. SG: So take me to that night. Midnight is approaching, and then midnight passes. And with all of that you’ve just said...LS: I know. SG: What were you thinking? LS: It was a sigh of relief. JR: We went to bed. [laughs] LS: It’s like going to bed on election night, you know? Or going to bed any other New Year’s Eve, you know? SG: Did you have a computer at the time? LS: Of course. SG: Did you check your computer to see if it was working? LS: Oh, yeah. Oh, yeah. I’m telling you, I bought it hook, line and sinker. Yeah. SG: Wow. LS: And you know, I mean, just look at what the Russians just did, you know? SG: What, by putting Trump in...LS: Yeah. SG: …in office? [laughs] LS: No, not that! But all those emails. SG: Yeah. Right. LS: And who knows what could happen with this election? So, you know, there’s sabotage, there’s failure...JR: That’s far more realistic, for me, than the millennium. SG: So aside from the Y2K and the preparations, did it – LS: Oh, that’s what it was called, “Y2K.” SG: Yeah, we haven’t said that yet. LS: Yeah. SG: Aside from that, which was the salient memory, did it seem important to you, the moment? LS: Not so much as, you know, a milestone birthday, say. Yeah. Um, but it was, it was. Turning over a century. SG: What about you, Jack? JR: I didn’t give it that much recognition. I think I’m more concerned with Donald Trump’s rival (?) LS: But Jack has had a very fascinating life. Laurie discusses how Jack is a “legend” whose career “matches social history.” He spent decades working in government agencies for the homeless and mentally ill. During Johnson’s administration, his agency was “shut down.” He worked in Washington before coming to North Carolina and becoming the director for adult mental health services in Durham County. SG (to JR): Do you think things are better or worse than they were then? I know that’s a loaded question. JR: No, it’s not. You know, we have shifted our philosophies greatly. We’ve shifted to depend on the private sector, which is interested in for-profit. And as a result, there’s a great drain off of resources, and if I was mentally ill, I don’t know how I would cope with that, with the complexity of it. And I think that’s my view. It’s a sad state of affairs. LS: It was such a caring system. You could come into public mental health and get treated. Now, it’s an administrative office. SG: Well, the treatment of mental illness has changed drastically, I imagine, in your lifetime. JR: Well, the medication regimes have improved, the medication effectiveness. I’d say that’s the most significant part. I think the fact...one problem is the mentally ill lack a voice, a political voice. And...SG: I’ve never thought about that. That’s true. JR: Different than the developmental disabled, who have usually strong family ties, and they’re great advocates. LS: And they get great amounts of money. JR: The mentally ill really get abandoned by families, and they’re quite on their own. So I think that’s had an effect over time. I notice that some other people have approached. They seem to be waiting to speak with Laurie and Jack, so I ask one last question. SG: Now this is like a time capsule. I’ve been asking people this question: what do you think is going to be the topic most often on people’s minds in 2100? LS: Whoah. I wonder if we’re gonna get there. Jack laughs. JR: That sums it up very well."
  },
     {
    "first": "Jack",
    "last": "Ramsey",
    "id": "apprpFh95",
    "age": "81",
    "residence": "Efland, NC",
    "occupation": "Retired",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "10:54",
    "quote": "I guess I just tend to take it a day at a time. And it didn’t seem to me that it was very realistic, what was being projected.",
    "transcript":"audio/Shapiro and Ramsey_080616.pdf",
    "audio":"./audio/Shapiro-Ramsey_compressed.mp3",
    "text": "Hello, my name is Laurie Shapiro. I’m 62 years old, and I live in Efland, North Carolina, in a very intentional community that was developed around…early-to-mid 70s. And I only bring that up because it’s related to what I’m going to share with you. SG: And you say “intentional,” like a master-planned community? LS: Um...SG: Or what do you mean by that? LS: Um, in that it has very, very intentional covenants. There’s no asphalt on the road...Jack Ramsey (JR): No streetlights. LS: No streetlights, it’s still unpaved and gravel. It has a community pond, it has…the bylaws originally...covenants originally suggested cats wear bells to let the birds know they’re coming, and it’s the second community built by Harvey...Harvey...somebody. I’m losing, I just had it. And his other one is Roselind, down in Pittsboro.SG: Interesting. LS: [she suddenly remembers the name] Hartland! Realty, I think. SG: Very interesting. How long have you been living there? LS: Since 1998. And it was...so I’m the second generation, and many of the couples of the first generation did not make it because it’s so intensive to build your own house from, you know, a plot of woods that they had to just develop from absolute scratch. SG: So had just moved there as New Year’s Eve 1999 came, not long, right? LS: Um...SG: '98, you said you moved there? LS: Yeah. SG: So take us back. Paint a picture in our minds, what do you remember -- Laurie stops me to let Jack introduce himself. I realize I haven’t asked his name. SG: Oh, yes. Let’s get that for the record. Jack is very soft-spoken. JR: Jack Ramsey. I’m 81. SG: Eighty-one. Looking good, sir. JR: Thanks. SG: Okay, and I presume you were together at the time? LS: Yes. 25 years in November. SG: Congratulations.  Congratulations. All right, so take us back. What do you remember? LS: What I remember was we were very anxious. And there was a lot of anxiety, particularly around computers crashing, water supplies going down, refrigerators going..,I mean, there was just such panic. And it was one of the few times that the community got together as a community to see how we could...JR: To discuss our fears. And see how we could set up alternatives to cope. LS: Oh, what a good way to put it. SG: So they took preparations, absolutely. LS: Mostly, it was discussion. We never got beyond the discussion [laughs]. It was really like, “Let’s start talking about this.” But it didn’t get beyond talking. But there’s some really old-timey hippies in this community, and this was, you know, they were in – JR (to LS): You’re not one of them. Jack and Laurie both laugh. SG: No one self-identifies, right? [laughs] LS: Right. [laughs] So you know, they were sure that the crash was going to happen, and so we were going to figure out how to, as Jack said, cope. And come together, and work it – JR: But there were skeptics, such as myself. [laughs] SG: So you weren’t worried? JR: I was not. SG: And why is that? JR: I guess I just tend to take it a day at a time. And it didn’t seem to me that it was very realistic, what was being projected. SG: So you thought the media was blowing it out of proportion, that sort of thing? JR: I did. I turned out be on the mark. [laughs] SG: Well, better than the alternative, right? We might not be talking about it right now. LS: I really thought it was coming. I really thought the crash was coming. I didn’t…I believed it. I believed the hype. I thought surely they couldn’t get the computers together. SG: I appreciate your being candid about it, too. LS: Yeah. SG: I mean, some people were saying planes were going to fall out of the sky. You weren’t to that level, or...? LS: No, not planes, but banks. Clearly thought the banks were going to crash. And you know, your computer would crash, and all kinds of things would happen along those lines. So you know, this is a very much ‘back to the Earth’ community, so there were all these much more conservative, kind of reactionary…there weren’t the full-scope of extreme reactions, of like “Gold…” what’s the expression? SG: Gold standard? LS: No. People were...'Gold, guns...' When people talked about it. Hiding your gold, guns, and…the third one. “Gold, guns and...” SG: Yeah, it’s on the tip of my tongue; I know what you’re talking about. LS: Yeah. So we weren’t into hiding guns and…[she suddenly remembers the expression] “Gold, guns and groceries!” We were talking about groceries. We were talking a lot about building underground places to put food. SG: But you never got that far? Just talking about it? LS: Talking about it. We have a couple members of our community I’d love you to talk to. Easy phone call. SG: Okay. LS: Yeah, they were the ones that have this incredible house in our community. And they were the ones who hosted the meetings in their house. And they were the ones...they’ve done a lot of peace work, conflict mediation work, alternative school work. And so they were...they bought it. They bought it. They bought that we needed to do something and get prepared. SG: So take me to that night. Midnight is approaching, and then midnight passes. And with all of that you’ve just said...LS: I know. SG: What were you thinking? LS: It was a sigh of relief. JR: We went to bed. [laughs] LS: It’s like going to bed on election night, you know? Or going to bed any other New Year’s Eve, you know? SG: Did you have a computer at the time? LS: Of course. SG: Did you check your computer to see if it was working? LS: Oh, yeah. Oh, yeah. I’m telling you, I bought it hook, line and sinker. Yeah. SG: Wow. LS: And you know, I mean, just look at what the Russians just did, you know? SG: What, by putting Trump in...LS: Yeah. SG: …in office? [laughs] LS: No, not that! But all those emails. SG: Yeah. Right. LS: And who knows what could happen with this election? So, you know, there’s sabotage, there’s failure...JR: That’s far more realistic, for me, than the millennium. SG: So aside from the Y2K and the preparations, did it – LS: Oh, that’s what it was called, “Y2K.” SG: Yeah, we haven’t said that yet. LS: Yeah. SG: Aside from that, which was the salient memory, did it seem important to you, the moment? LS: Not so much as, you know, a milestone birthday, say. Yeah. Um, but it was, it was. Turning over a century. SG: What about you, Jack? JR: I didn’t give it that much recognition. I think I’m more concerned with Donald Trump’s rival (?) LS: But Jack has had a very fascinating life. Laurie discusses how Jack is a “legend” whose career “matches social history.” He spent decades working in government agencies for the homeless and mentally ill. During Johnson’s administration, his agency was “shut down.” He worked in Washington before coming to North Carolina and becoming the director for adult mental health services in Durham County. SG (to JR): Do you think things are better or worse than they were then? I know that’s a loaded question. JR: No, it’s not. You know, we have shifted our philosophies greatly. We’ve shifted to depend on the private sector, which is interested in for-profit. And as a result, there’s a great drain off of resources, and if I was mentally ill, I don’t know how I would cope with that, with the complexity of it. And I think that’s my view. It’s a sad state of affairs. LS: It was such a caring system. You could come into public mental health and get treated. Now, it’s an administrative office. SG: Well, the treatment of mental illness has changed drastically, I imagine, in your lifetime. JR: Well, the medication regimes have improved, the medication effectiveness. I’d say that’s the most significant part. I think the fact...one problem is the mentally ill lack a voice, a political voice. And...SG: I’ve never thought about that. That’s true. JR: Different than the developmental disabled, who have usually strong family ties, and they’re great advocates. LS: And they get great amounts of money. JR: The mentally ill really get abandoned by families, and they’re quite on their own. So I think that’s had an effect over time. I notice that some other people have approached. They seem to be waiting to speak with Laurie and Jack, so I ask one last question. SG: Now this is like a time capsule. I’ve been asking people this question: what do you think is going to be the topic most often on people’s minds in 2100? LS: Whoah. I wonder if we’re gonna get there. Jack laughs. JR: That sums it up very well."
  },
  {
    "first": "Pixie and Bob",
    "last": "Stocking",
    "id": "hNg3eAGLe",
    "age": "76/81",
    "residence": "Durham, NC",
    "occupation": "Retired",
    "interviewLocation":"Carrboro Farmers' Market",
    "interviewDate":"August 6, 2016",
    "duration": "10:17",
    "quote": "It was a beautiful evening. The moon was out, and there were about eight of us. I have a third son, and his family, they weren’t there, and I had wished maybe we were all there together because it was such an important historical event.",
    "transcript":"audio/Stocking, Pixie_080616.pdf",
    "audio":"./audio/Stocking_compressed.mp3",
    "text": "Pixie (PS): My name is Pixie Stocking. I’m 76. I live in Durham, North Carolina. What brought me here today is what brings me here every day for years, is the people, the fresh produce. I’m from Boston, so I don’t say “pro-duce,” I say “prah-duce.” [Pixie’s husband and I both laugh] PS: Let’s see. It’s what brings me here. When the cinnamon rolls...Scott Geier (interviewer, SG): Oh the legendary cinnamon rolls. PS: That’s how I get my husband here. He knows he’s going to have one on Saturday morning, so he’ll get up early for that. SG: Yeah, those are tasty. And the roasted peppers are also nice. PS: Yes. SG: Are they doing those in the summer, or is that just a fall thing? PS: I don’t see them today. SG: It’s more of a cold-weather thing. PS: Yes. SG: Okay, so you are somewhat privy to the topic, but let’s just start on a personal level. Take us back; go back in your mind. It’s New Year’s Eve 1999. Y2K, the year 2000 is coming. Tell us what happened that day. PS: I was on Hilton Head Island. My middle son’s wife was expecting her first child, and we went there to celebrate New Years as we do a lot. And we were down on the beach to see all the fireworks from all the different areas and all the different resorts on Hilton Head. So that’s why...and it was a little bit chilly, because we all had jackets on. But it was a beautiful evening. The moon was out, and there were about eight of us? [Pixie turns to her husband and he nods] About eight of us, I think. My son, his wife -- very pregnant wife, because she delivered the first day of February. And our youngest son, another close friend, another two women. Anyway. And we had gone out earlier, one other woman and I, because we thought we needed some festive things, so we went to a boutique and bought some very silly crowns, some balloons, some noise-makers, all those things that you do for New Years. SG: And you all had gone to Hilton Head for that reason? PS: Yes. SG: You were living in...PS: We were living in Durham, in Durham, at the time. But my son and his wife lived there for 12 years, yes. SG: Did the moment seem important to you? PS: It did, because...I’m sort of one of those people that marks time with events. Not historical, necessarily; I leave that to my husband. But family events. And it did. And I have a third son, and his family, they weren’t there, and I had wished maybe we were all there together because it was such an important historical event. SG: Did you feel privileged to some degree that you were part of a change into a new millennium? PS: This is kind of sappy, but I sort of feel privileged every day, that I’m living the life I’m living. SG: Why do you say that? PS: Well, I’m a breast cancer survivor, and that experience - SG: Okay, I’m sorry to hear that. PS: No, it’s fine, thank you. SG: Well, I’m glad to hear that it...good. PS: Yes, yes. But I tried even before then. My husband is a prostate cancer survivor, so we went through that situation, four years before then. SG: Oh, wow. PS: I’ve always tried to be happy with every day, regardless of what happens in that day. I turn to Pixie’s husband, who is standing to her left. SG: And sir, do you remember the night very vividly? In an apparent attempt to help clarify, Pixie asks her husband if he remembers being at Hilton Head with their son at the turn of the century. He speaks in a soft, raspy voice. It’s difficult to understand what he is saying. Bob Stocking (BS): I don’t really. I don’t. PS: Well, he has...he’s at the age where maybe some memories...Bob laughs. BS: I’m stronger than I look. SG: Well, there’s also been a gender disparity, I’ve found, in the memories. Women tend to remember it more. BS: Oh, yeah. They do. Endless things [laughs]. PS: Well, ask him anything about any war, dates or any of that stuff, and he’ll remember. But ask me what people wore [laughs] on a particular, at a particular event, or who else was there, and I’ll remember those things. SG: Do you remember what you were wearing that night? PS: Oh, I remember what I was wearing that night. SG: You might have mentioned that, actually. PS: I was wearing jeans, and I had a light jacket on. SG: That’s crazy. Wow, you are good. PS: But we were barefoot because we were on the beach. SG: That’s a good spot for that kind of a moment. PS: Yes. And it was…because they lived there, they have privilege to go to a beach that ordinarily people – you know, other people, tourists – don’t get to go to. You have to have a pass to get there. So there weren’t a lot of people. SG: Do you remember the Y2K bug? PS: Oh, yeah. My husband actually is a computer guy, and he was teaching at Durham Tech and they needed somebody who knew what system to change things. So Blue Cross Blue Shield hired him to go in to work with a group of young people to change all that had to be changed. BS: Yeah, it was interesting. SG (to BS): You can be honest now, but I have to ask, given your line of work. Did you really think that there was going to be trouble because of the Y2K bug? BS: The Y2...? SG: Because of the date change. PS: Because of the date change. BS: Oh. The great deal of stuff going on about it, because it made news. SG: But did you personally think there was going to be a problem? BS: I didn’t think so. I thought there’d be a solution somewhere. And as it turned out, computers got better and better, and more and more memory. They just went in and made an arbitrary date. If you were born before a certain date, you put 19 in front of it. If you were born after it, you put 20. And it was a simple solution. But there was a lot, a lot of stuff in the news. I remember a sign on Time magazine, the guy dressed in a robe and stuff, and sandals, with a sign on, “The end is coming.” [laughs] SG: I think I remember that cover. BS: But it was just...it made news.SG: So you all didn’t take any preparations for it? PS and BS: No. SG: A lot of people did. PS and BS: Yeah. PS: Now, I just figured whatever was meant to happen was going to happen. And I try not to give in to fears, especially fears that the media presents. BS: Yeah. That’s usually what’s happened. Once the media gets a hold of it...[laughs] you don’t stand a chance. I mean, they’ve got every angle figured out. SG: Well, they’re not gonna sell newspapers, or they’re not gonna get ratings on TV, by saying nothing is gonna happen. PS: That’s right. BS: Oh, no, no. SG: Okay, so I hate to end on a serious note, but I noticed your baseball cap. Pixie laughs. She is wearing a Boston Red Sox cap. SG: In 1999 -- and be honest with me -- did you really think the Red Sox were ever going to win the World Series? Bob laughs. PS: I hoped they would. Now, my whole family was involved -- by telephone, we were all involved – when they did win. SG: Is that a memory that you...vivid? BS: Oh, yeah. PS: Oh, yes. BS: Yeah [laughs]. Are you kidding me?"
  },
  {
    "first": "Matt",
    "last": "Swails",
    "id": "Q2RXJmrt",
    "age": "23",
    "residence": "Asheboro, NC",
    "occupation": "",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "4:30",
    "quote": "I remember being on the couch with my parents and little sister. We all stayed up that night. I think we all fell asleep on the couch afterwards. That was a good memory. I haven’t thought about that in a while.",
    "transcript":"audio/Swails, Matt_073016.pdf",
    "audio":"./audio/Swails_compressed.mp3",
    "text": "So when the year changed, I was seven years old, if I did the math right. And the only thing I really remember was being on the couch with my parents and little sister. We all stayed up that night. My parents drinking champagne, and just chilling on the couch. And I remember watching the ball drop and everything. We were all just hanging out, having a good time. I think we all fell asleep on the couch [laughs] afterwards. So yeah, that was a good memory. I haven’t thought about that in a while, until you were over here. Do you remember your family being concerned about the Y2K Bug? Or do you remember that? I should preface it: do you remember the Y2K Bug? Um, I remember hearing about it. That young, I don’t remember, you know, I didn’t understand what that was all about. But I definitely remember being older, looking back on it. It was kind of a concern about all the computers taking over and stuff like that. And I don’t think my parents were, not that I remember, no. Do you remember what it was like trying to use the Internet back then? Did you all have a computer at home? [laughs] Yeah, we did. It was the old dial-up. You couldn’t use the phone and the Internet at the same time. Yeah, we had a family computer for – I don’t remember what year it was – but I just remember being like, cued into it. A family computer? Meaning, the computer for the family? [laughs] Yeah, exactly. One computer, in one room, yeah. It was fun. Me and my sister, we really got hooked on it and started playing these really old video games and stuff like that. And again, being on the Internet, again, I was too young to really know what was going on, but it was the same thing, dial-up and all that. Do you remember what music you were listening to at the time? What was on the radio? [laughs] I gotta say, my family was pretty religious back then. So we listened to a lot of Christian rock and stuff like that. I have very vivid memories of us driving our – we had like a blue van or something – listening to Christian rock and stuff. I could probably still sing the words if I heard the song again [laughs]. “Open the Eyes of My Heart”? [laughs] Yeah. I remember that one. Cool, man, all right.  It’s been a long time, and you’re pretty young, but if somebody asked you, “What was life like in 1999?” What would you say? I would say it was a lot less busy. Back then, my sister and I, we went out into the neighborhood and hung out with kids until it got dark, and then we would come inside to the house, you know? And you don’t think kids are doing that anymore? No, no. Because I have a younger brother who just turned 17, so he kind of grew up with the internet and computers and all that, and he’s a really big computer gamer. He’s kind of a nerd. So all he knows is being connected, and all these video games, and computers and all. But I distinctly remember back then, going out in the summertime, getting up early and going out, riding my bike, hanging out with neighbors for the entire day. I don’t feel like kids do that anymore. Other than that, do you think things are better or worse than they were then? Um, in some ways better, and in some ways worse. I really believe that all of this technology has reduced our attention span a little bit. Probably as connected as the world is, I feel like we’ve drifted apart in terms of like, face-to-face conversations, really empathizing, and having to face-to-face conversations with people. Really understand where people come from. It’s so much easier now to hide behind an anonymous screen name and call somebody an asshole from across the world. So I feel like we’ve lost a little empathy, but in terms of society and a species as a whole, I think we’re making advances."
  },
  {
    "first": "Mark",
    "last": "Walker",
    "id": "3YEhD9aPq",
    "age": "56",
    "residence": "Knoxville, TN",
    "occupation": "Postal clerk",
    "interviewLocation":"The Pier at Garden City (Murrell's Inlet, SC)",
    "interviewDate":"July 20, 2016",
    "duration": "9:37",
    "quote": "As a joke, somebody right as it hit midnight turned off all the lights, like we had lost the power.",
    "transcript":"audio/Walker, Mark_072016.pdf",
    "audio":"./audio/Walker_compressed.mp3",
    "text": "I am Mark Walker. I am 55. I’ll be 56 in 11 days, and we reside in Knoxville, TN. Happy Birthday. Thank you. I’ve told you a little about what this story is going to be about: people’s memories from when it changed from 1999 into 2000. Let’s start with that specific night, New Year’s Eve. Do you remember where you were and what you were doing? I was still single at the time. I was dating somebody that is not my wife now. [laughs] A lot of people were freaked – I wasn’t worried that much because I figured it was just gonna all work out – the only thing that I did different, I did go ahead and get a full tank of gas just in case something wasn’t working right at the gas pump. But we were at a singles, kind of a single’s retreat, with some friends at somebody’s house. And as a joke, somebody right as it hit midnight turned off all the lights, like we had lost the power [laughs]. And everybody was just like, [shocked] “What happened?” Yeah, right? Y2K, right? So it was kind of funny back then. Wow. So you clearly remember? Oh, yeah. And you were with – and I don’t want to have to open any wounds here unnecessarily – but you were with somebody that did not end up becoming your wife? Yes, I was with a girl named April. And we were at, like I said, a church thing. We played games at night, and when we got to the countdown, for about five minutes, everybody just kind of sat and we had somebody -- I didn’t know they had someone rig the…flick off all the power and the lights – but it was kind of funny then. So it was a church event? Yes. If you don’t mind me asking, what denomination, what church? It’s Baptist. Is that a regular thing? Like they had the Watch Night or something like that? It was just one of the many socials they used to have. Just a way to get friends together. We’d eat somewhere, have a game night, something like that. Did they usually do something for New Year's Eve? Yes, and this particular one was going to be special, because everybody was going into the 2000s and all that. [looks at his son] My son just caught something. Anything Daniel? [back to the interview] But it was just something we would periodically do to get together with friends and stuff like that. How would you say that things have changed? You think back on 1999, going to the new century, how do you think things have changed from then to now? My goodness. Well, it’s been double-edged. Some of the technology has been incredible. I didn’t have a cell phone back then, and they were just coming up. Some of the things you can find on the computer and all this stuff now is unbelievable. But then there’s also some really bad stuff that is on there too. With all the just, immorality and stuff like that. So it’s been double-edged, but there’s been a lot of good things that have come out of it, too. Where you can just look up something and [snaps] find it like that. I’m showing my age here, but when we were kids in school, we bought encyclopedias, which to your 20 somethings, they have no idea what that is. And that is how we looked up things. [with a shocked face] We read newspapers! Yes. And I still do. What were you doing for a living back then? What I’m doing now. I’ve been with the post office almost 34 years. I started when I was about 22 there, and back then in 1999, I was on a day shift by then because I started on the night shift. I was running what they call a flat sorter machine, where it would process flats. You’d key in a key code, and a bundle would go where it was supposed to go. So you’ve probably noticed things changed at the post office since then? Automation has...unbelievable, how it can read a bar code.  We used to, when I was first hired in, we would, a letter would go by a little belt and would keep three numbers per second. Now, you just put a machine on there, and it just rips right through them and just reads a bar code and sends it to where it’s supposed to go. And I’m just..I’m amazed that something like that could possibly exist. Do you remember preparations and people’s thoughts about the Y2K bug at the time? Especially since you were in the post office. Yeah, they were curious how things were gonna come over because we punched a clock. Is this gonna like flip back to 1900 instead going to 2000? Is this going to work out right? People were worried, like, “What if things just stop and we don’t get paid?” [laughs] So they were wondering, like, how is this really gonna work? I just figured...I never really got worried. We had some people that I knew, they had like, built stuff out in the middle of nowhere and had some canned goods in case...They wanted to be somewhere they could go and have food in case everybody went kind of nuts about everything. But I wasn’t really that worried that we couldn’t figure it all out. Because we all had manual can openers where we could open up a can of food and eat it. So you weren’t tanking up the car, and taking cash out of the bank? No, not really. Not really. I just pulled up that day and thought, “Eh, let’s do this, but I think everything will work out just fine.” I ask where he was living at the time, and Mark talks about how he has lived in Knoxville his entire life. He met his wife there. So do you remember people in the area actually thinking the world was going to end? Oh, absolutely. Yeah. They had signed [?]…there are some outlying towns that are very rural, and like I said, they had some, they were going to...they had built a cabin in the middle of nowhere. They’d stocked some food and some lanterns, and bought all kinds of stuff, like some type of survival mode or something like that. You remember to talking to any of those people after it came and went, and nothing had happened? I wanted to give them a hard time, but I didn’t [laughs]. Because it was just kind of funny, you know, you’re just kind of in this for yourself, then. I guess they started to think, “Well nobody is listening to us, so we’re going to be some of the survivors.” And I was like, “Well, have at it.” What about the next day? Do you remember anything, like, after midnight? [pause] Well, being a college football fan, the next day was New Year’s Day, so we were watching bowl games all day. And it wasn’t that far along that we played the University of North Carolina because we were the Tennessee Volunteers. I remember that, I think. Yeah, I hated that game. Mark recalls the controversial ending to the game, in which the referees overturned a call and UNC won. We talk about the UT football championship in 1998 and UT’s slow rise back to respectability. So last question. When you think back on 1999, do you remember some of your first experiences with like, the internet, trying to send an email, or getting a cell phone? I did. I was one of these latter day people to adopt anything. I got my first iPhone two weeks ago [we both laugh]. I shouldn’t laugh at that. I bought a computer that had an email capacity...I could have [incredulously] six different email addresses [laughs]. And that was it. It was an old...oh goodness, I forgot what it was. It was like a Macintosh 320 or something like that. I bought it from a friend for like 75 bucks because they were getting a much more modern computer, and at least I had where I could send an email to my brother, so -- he’s a foreign missionary -- so I could email him in the Philippines. So that was kind of cool. That must have been crazy, the first couple of times – He was one of the six addresses I got to keep [laughs]. That I chose to keep. It would only hold six email addresses. Wow. What about cell phone? Do you remember when you first started using a cell phone? That was good. My dad was starting to be in declining health, and they had called me at work one day, and nobody answered the phone, and I thought he had fallen down a flight up steps. So I was like, “I gotta have this all the time.” And that was just amazing, that you could push a couple of buttons and you could talk to somebody across the world. I still don’t understand that.  While you’re standing on the pier, if you want to...Yeah, really. It’s just like, good grief. I mean, he’s in Malaysia right now, and I’m going like, “I can push one or two buttons, and I’m calling him.” I don’t know how this works, but I use it.  I share a story with Mark about telling my kids about the days before cell phones; having to walk and knock on a stranger’s door if you got flat tire in the middle of the nowhere, how my kids were aghast at the thought of this. I mention that my daughter is seven years old and will probably want a cell phone soon. Mark tells me his daughter is also seven and his son is eight. That’s actually a good question. What is the age that you think kids should be able to get a cell phone? Oh goodness. Um...10 or 12, but I’m not going to tell my kids that. [laughs] I don’t think they heard you. I don’t know, 10 or 12 years old, I guess, because there’s just too much stuff that they could accidentally get into. Like they might find some porn or something. I don’t want to be exposed to that, because...sooner or later they’re going to see something in school or something, but I want to keep them as pure as long as I can."
  },
        {
    "first": "Family",
    "last": "Wells",
    "id": "NBmTq8Q2e",
    "age": "various",
    "residence": "Watertown, MA",
    "occupation": "",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "11:30",
    "quote": "Tamar: Kids are hooked in so much to their media that they’re not communicating. Richard: But they said that with televisions, too. Tamar: Yeah, but with television, you’d walk out the door and it’s not there anymore.",
    "transcript":"audio/Wells Family_073016.pdf",
    "audio":"./audio/Wells_compressed.mp3",
    "text": "SG: So, you already know what’s going on. The idea is, I’m trying to get more information about people’s memories from that time. So, we’ve been talking about it a little, maybe jogged your memory. You started to tell me, what do you remember from that day or that night? Rebecca (RS): So I believe we were at home at my parents’ house. I don’t remember clearly, but I remember when I was in middle school, so I wasn’t driving yet, so I was probably at home, becuae we grew up in a town that had about 4000 people, so there wasn’t a lot to do, a lot of places to go. So I was probably at home. And I do remember watching the clock, and when it turned midnight, nothing broke or sparked out, so all the hype around electronics and how they would be able to handle the new...Alicia (AW): The zeroes [laughs]. RS: Yeah, it was okay. SG: Alicia, what about you, do you remember? AW: Um, I remember that as well. I also remember that we watched other countries, and when it became the new year in their countries and nothing broke, the hype just seemed to disappear then, too. I remember having conversations with either parents or friends about how, if nothing broke in Japan, then we’re probably going to be fine. [laughs] I mention that other people had brought this up in interviews earlier that morning. What if somebody asked you -- like a really young kid who doesn’t remember, wasn’t even born then -- asked you, what was your life like in 1999? What would you say? What’s the first thing that pops into your mind? RS: Didn’t have a cell phone. I probably talked to my friends more, because we weren’t so connected to our devices.AW: Yeah. You mean face to face? RS and AW: Yeah, oh yeah. RS: Real conversations, not so much in texts. So you remember that change. You’re old enough that you can remember how that changed over. RS and AW: Yeah. AW: I remember that evolving. At some point, you would…it changed over. All of a sudden, you were sitting in front of your computer, when AIM was a big thing. RS [as if she had forgotten this]: Oh yeah. AW: And you would sit on your computer for hours, talking to your friends. And like, your parents would be yelling at you from the next room because – RS: And playing SIMS AW [laughs]: Playing the SIMS. But they would be yelling at you from the next room because they needed to use the computer but you were talking to your friends, and there was only one computer in the house. RS: If you had a computer. AW: Yeah, if you even had a computer. And so there was this shift from when you talked to your friends on the phone – it was like face-to-face, on the phone – and then, on AIM. Rebecca and Alicia’s parents arrive. RS asks her mother where they were on NYE99. Tamar (TW): At the Francises. AW: That’s what I said [note: Alicia had mentioned this in conversation before we started recording the interview]. RS: So a family friend’s house, then. Parents remember. I introduce myself to the parents and explain the project. I ask the mother to share her own memories. Everybody was worried that the whole Internet would crash because it wasn’t up to speed [laughs]. RS: That’s what we said. Richard Wells (RW): Yeah. I remember that. RS tells her mother about her memory of watching the New Year’s celebrations in different time zones. Her father laughs. TW: I think we spent the whole evening, like, doing a puzzle. RS: Probably. So was it anything out of the ordinary, in terms of what you did, or was it pretty much another New Year’s night? TW: It was pretty much the same as what we had been doing for a while. We don’t do that now. RW (to wife): Did we stay up until twelve? TW: Oh, we did. I think everybody stayed up. RS: They usually go to bed before New Years. RW: We turned the clocks ahead [daughters laugh]. TW: We did it, like, on Greenland time. So that, you know, “it’s bedtime in Greenland, so let’s go...” You said you were in Massachusetts at the time, and you still are, right? Group: This was Connecticut. We were in Connecticut. Oh, okay. I ask the parents for their names, for the record. Wow. You’re the first fully intact family that I’ve talked to at once. [group laughs] RW: Well, hopefully we’ll end the day intact. [more laughter] I repeat the “child’s asks about what life was like in 1999” question for Richard. RW: It’s pretty well the same as it is right now, but no internet. TW: No, we had internet, but we didn’t have...we had flip phones. We didn’t have iPhones. Do you remember that you had a flip phone at the time? TW: I think I had a flip phone...maybe had a flip phone at the time? RW: Well, you know, it’s living in the past. I just don’t live in the past. TW: There was no cell service in our town. There was no cell service. RS: So if they had a phone – RW: You’re good. She’s got great memory. TW: Yeah, so you guys did not have phones, because –AW: No, we had to…we were in middle school, we had to, like, talk to our – RS: I don’t think we had cell phones in middle school because we didn’t get cell phone until we started driving. AW and TW: Yeah. Right. Remember the big bag phones? Maybe you had in the car? Group: No, no, we didn’t… AW: The Grays had one of those, though. We had friends that had those [laughs]. They were so cool. RS: So we used the house phone a lot. Our friends would call the house phone.  [in mock astonishment]: It was connected to the WALL! RS: It was connected to the wall. And they had to careful what time they called, to not wake anybody up. RW: And sometimes, you had to turn them around, they had the...TW: Rotary dial. RW: Rotary dial. Now you’re going way back. AW: I’m a teacher, and I spent 20 minutes explaining to my class what a rotary dial phone was. It was like an entire bulk science block; we just talked about what a rotary dial phone was. I mention that I have and old rotary phone that my kids play with. TW: We were still connected. Our TV was still connected and now it’s not. SG: And it was probably ‘yay’ big and heavy, right? TW: It was big and heavy, and I think we had satellite because that’s all we could get. But we’ve now eliminated that. RS: We didn’t have cable then, because we didn’t get cable until Alicia and I were in college. RW: It was network. TW: It was network TV, right. AW: We got, like, five channels. [laughs] And you’d flip through your five channels. SG: And you’re laughing about it now, but you didn’t give it a second thought back then. AW: Yeah. It was just, you got five channels. You couldn’t get cable. RS: I remember when we were home sick, and you’re trying to find something to watch on TV, it was like, soap operas and soap operas and then [jubilant voice] The Price Is Right! [laughs] TW: I remember we had the cassette tapes. Yeah. Did you have a computer at home back then? TW: Yes. Do you remember what it was like trying to use the Internet back then? AW: Dial up. Slow. TW: Was it dial-up then? AW: It was dial-up. RW: It was dial-up, yeah. I remember putting together my first computer. SG: Oh, you built it yourself, with the motherboard and everything? RW: Yeah, that’s how you had to do it back then. [laughs] And it was K of memory, it wasn’t... SG: G. RW: The idea of a gigabyte of memory was just over the top. SG: And we’re gonna look back and think of a gigabyte as being tiny. RW: That’s right. SG: It already is, pretty much. TW: And we had cassette tapes to listen to. SG: Do you remember what music you were listening to back then? This is actually a good question, because we’re getting a mix of people. TW: Wow. For us, it was classical. AW: Their music was – SG (to AW): You probably still had CDs then, right? AW: I remember listening to my first cassette tape, that I owned myself, which was Brittany Spears. And then Becca had a ‘Pocahontas’ one...RS: My two first CDs were ‘Pocahontas’ soundtrack and Simon and Garfunkel. SG: Interesting dichotomy. [group laughs] RS: From my friend. That was the same year I got a boom box. SG: Boom boxes, how about that, right? RS: Boom box. Yeah.   SG: And your CD collection probably ends, when? When it switched over to all digital. RS: Oh, whenever I got my first iPod, probably. But I still have all of my CDs. I don’t know what to do with them. AW: I sold all mine. We had a tag sale when I moved, and I sold all of my CDs. SG: You didn’t want to hold on to Brittany Spears? AW: I have it on my phone now [laughs].  RS: At least she didn’t let go of Brittany Spears. AW: It’s just all on my phone. And now I don’t even buy music. I just listen to either Google Play or Pandora or Spotify. I just...SG: Yep. That’s been the other change -- AW: I don’t even own music -- SG: -- is that it went from having a physical copy, to all just digital, to not buying anything because it’s on demand. RS: Right. And paying for subscriptions for your music. TW: It’s really, really, really horrible for the musicians. SG: Absolutely. I’m not supposed to have an opinion, but absolutely. TW: It’s awful. I mean, the music industry did not see that coming. AW: It’s been hard in New York, for the musicians that were there. Because even like, Broadway shows, it’s not...they’re not doing live orchestras for a lot of the Broadway shows anymore. It’s just recordings. SG: That’s crazy.AW: So you get paid for your recording that you put out – SG: Pennies. AW: Yeah. But then, you don’t get paid for every single show. SG: Well, in your line of work, it would have been a totally different ballgame, if you had started in 1999. I mean, teaching, I can’t imagine how different that is. AW: Yeah. Yeah. We have a smart board. We have iPads for all of the kids. SG: What subject do you teach? AW: I teach special ed. But I’m in the general ed classroom for most of the day.  SG: I was gonna ask you if they still teach cursive. AW [with surprise]: They do! I do. [laughs]. In third grade, in Redding, Massachusetts, we still teach cursive. SG: Interesting. AW: At my school. I actually don’t know if all the elementary schools in Redding are that way, but in my school, we still teach cursive.  SG: Wow. I can’t even remember the last time I wrote cursive. TW: I still write cursive. SG: I was gonna say, signed a check, but I don’t even do that anymore, either. Richard laughs. AW: Yeah. SG: In general, do you think things are better or worse than in 1999? Comparing now to then. TW: In some ways it’s better, in some ways it’s -- RW: Better. I’d say it’s better. SG: Is technology a big part of that? RW: I think technology has made it better. TW: Well, I think technology is a double-edged sword because you get kids who are attached. They’re hooked in so much to their media that they’re not communicating – RW: -- But they said that with televisions, too, when televisions came out, telephones came out...TW:  -- I think it’s...yeah but, iPads and iPods, I mean, iPhones and everything, are ubiquitous. They’re everywhere, and so...RS: You can’t get away from it. TW: With television, you’d walk out the door and it’s not there anymore. SG: Rebecca was saying that back then, it would have been talking to people face-to-face. TW: Yeah. Uh hmm. And I think it’s going to be interesting – RW: But you had a limited number of people you could talk to. Now you can talk to...you can connect with all your high school, college friends.SG: That’s a good point. TW: That’s true. RS: But have conversations changed, when they’re in text messages versus actually sitting down and having a conversation, and not being interrupted by taking your phone when you’re bored and looking through Facebook? SG: Maybe it’s breadth and not depth, you know? RW: I like that, breadth and not depth. That’s a good point. [note: I think subconsciously, I had adopted the ‘breadth and depth’ line from Glenn’s email discussion about oral history. I used it during a previous interview. Thanks Glenn] RS: I do kind of miss the depth of conversations that you used to get into, when you weren’t distracted by technology. We still do that sometimes, but I don’t know. SG: Only when someone has a microphone in their hand, right? AW: Yeah. [laugh] SG: Let me ask you something. I was thinking about this in the car on the way over. Presuming you have Facebook pages...RS: Yeah. All of us. SG: Do you have any neighbors in your Facebook friends? Current or former. RS: I don’t know my neighbors.RW: No, we lived out in the country, so we really didn’t have neighbors. TW: Yeah, we moved recently. So, yeah, no...RW: I’m sure we do...Becky Clark...SG (to AW): Are any of your friends current or former neighbors? RS: You don’t really know your neighbors. AW: Not really, but I rent, so I move a lot. So I don’t really get to know...Actually, you know, former neighbors, yeah. When I lived in, like, a three-story apartment and I knew everyone in the building. SG: And they became Facebook friends? AW: And they became Facebook friends. SG: Interesting. (to RS): But you just don’t know your neighbors anymore, you don’t think? RS: No, we didn’t in Watertown. TW: And you’re in the process of moving, so...RS: Right."
  },
      {
    "first": "Julia",
    "last": "Whitehead",
    "id": "4zEhE6bKd",
    "age": "22",
    "residence": "Richmond, VA",
    "occupation": "Non-profit volunteer",
    "interviewLocation":"Durham Farmers' Market",
    "interviewDate":"July 30, 2016",
    "duration": "",
    "quote": "I remember the glasses...the double zero that then kept going for the next nine years.",
    "transcript":"audio/Whitehead, Julia_073016.pdf",
    "audio":"./audio/Whitehead_compressed.mp3",
    "text": "Where were you living in Richmond at the time? Yes, I was. But I wasn’t in Richmond at the New Year’s. Twenty-two? So you were how old at the time? Do the math. Six, I think? And you remember? I remember parts of it. I don’t remember, looking back, how big of a deal it was. Everyone thought it was a huge deal, and I was, I don’t know, six, so I was just excited to be with my grandparents. What images are in your mind? What do you remember? [laughs] I remember the glasses. I know that sounds a little bit ridiculous. You’re like the fourth person that has said that. [laughs] Yeah. The glasses, the double zero that then kept going for the next nine years. I remember that. I remember sitting around the TV and it was a bit of an older TV. We had the little bunny ears. And I don’t know, it was large; it was a fat TV. And I remember just watching it, sitting on the floor at my grandparents’ house in Pennsylvania. Were you ordinarily with your grandparents on New Year’s, or was it just for that night? We usually...so my whole family is pretty much from Richmond, except for my mother’s family was from Pennsylvania. So I’d spend a week with my grandparents every summer, and every, usually Christmas time. So we’d spend a week there, and sometimes, it was New Year’s, and sometimes it wasn’t. But I remember we went up and my grandparents kind of gave my parents a break and then they came up for New Year’s. They were there with us. So you remember that New Year’s. You probably don’t remember the one before? Do you remember the one after? I’m just trying to get a frame of reference. Nope. Nope. No clue. I remember the 2000 New Year’s and that’s it. I don’t remember other ones. Do you remember what you were thinking? How you felt? No, no. I really… I mean, I was happy my parents were with me. I was happy the whole family was together, but that’s about it. I don’t...I was too young to really understand. And then looking back, like, seeing the freak-out over computers and all of that, it was almost like hearing history from World War II, that’s how foreign it was. None of that registered. It was just another year that everyone was really excited about. And you’ve probably never known any different, as far as cell phones, and the Internet. No. No, I really haven’t. It’s actually kind of funny. My grandfather, he’s a math professor. He’s absolutely brilliant. And back in the 90s, whenever we’d go up, he actually coded. He was using computers and writing codes and writing games, which at the time was really normal for me. But now, seeing that, it was kind of crazy that some 50, 60 year old guy who’d never seen a computer really before was then learning how to write and talk to it, essentially. Were you actually up at midnight? You were really young. No, I don’t think I was actually up at midnight. I think I probably fell asleep [laughs]. But you remember watching it on TV. Yeah, yeah. I remember all that. That’s crazy, wow. Do you remember anything that your grandparents were saying about it? That’s really a long time ago. No, I have no clue. I remember making a cake. We made a cake that was a “crown cake.” That was about it. What’s a crown cake? It was like a two-layer cake, and then you had ice cream cones that you dipped, and then you stuck in and you iced it, and it was a crown cake. Now was that for New Year’s, or you just happened to make that cake? Um, I mean, it was for New Year’s, but it was from a recipe book that we had [laughs]. So it was a cake that you usually made every New Year’s. Oh, no, no. We just happened to make it. I’ve never heard of that, 'crown cake.' Yeah, it was in like, a kid’s recipe book."
  }
]