  [
  {
    "name": "The Millennium Memory Project",
    "link": "http://www.millenniummemory.com",
    "category":"Web Development",
    "id": "A7XmG6",
    "thumbnail":"/img/mmp-tv-with-kiss.svg",
    "description": "It began with a simple question: Do you remember where you were and what you were doing on the night of December 31, 1999? It became a hybrid work of data journalism and oral history, and a fascinating look at our memories from the turn of the millennium.",
    "skills": "HTML5, CSS3, JavaScript, jQuery, D3.js, AngularJS, Illustrator, Premier Pro, Audition, Qualtrics (survey software), Mechanical Turk",
    "fileUnder":"web development, journalism, data visualization, graphic design, audio, video"
  },
  {
    "name": "The Best-Selling Writers of All Time",
    "link": "http://scottcgeier.com/writers",
    "category":"Web Development",
    "id": "H2gq4A8",
    "thumbnail":"/img/writers.png",
    "description": "The list of best-selling fiction authors of all time reads like a potboiler in its own right; it's full of surprise and intrigue. Three of the top four writers in the list are women, and you've probably never heard of one of them. One writer in the chart admitted to plagiarizing another in 1997. Another author was killed in a duel. Dive in with this interactive infographic.",
    "skills": "HTML5, CSS3, JavaScript, jQuery, D3.js",
    "fileUnder":"web development, data visualization"
  },
      {
    "name": "CIA Data: In Bubbles",
    "link": "http://scottcgeier.com/CIA_Data_Vis/",
    "category":"Web Development",
    "id": "D6Zr5J5",
    "thumbnail":"/img/CIA.png",
    "description": "The CIA created the World Factbook as a classified document in 1962. They released it to the public in 1971, and it's now one of the leading sources of statistics on each of the world's 195 sovereign nations and 59 dependent territories. This website is a visualization of that data.",
    "skills": "HTML5, CSS3, JavaScript, jQuery, D3.js, AngularJS",
    "fileUnder":"web development, journalism, data visualization"
  },
    {
    "name": "2016 U.S. Senate Elections",
    "link": "http://scottcgeier.com/senate",
    "category":"Web Development",
    "id": "E7sk3I2",
    "thumbnail":"/img/senate.png",
    "description": "As the U.S. Senate elections approached in 2016, I wondered: How many of the candidates went to Harvard? How many of them were lawyers? This interactive app provided answers to those questions and more.",
    "skills": "HTML5, CSS3, JavaScript, jQuery, AngularJS",
    "fileUnder":"web development, data journalism"
  },
    {
    "name": "How The Money Moves",
    "link": "http://scottcgeier.com/money_moves",
    "category":"Web Development",
    "id": "W5hj1O9",
    "thumbnail":"/img/money_moves.png",
    "description": "I built this website as a project at UNC. I had two goals: 1) Produce a work of data journalism with at least three visualizations; and 2) emulate the style of a major news publication. To accomplish the first goal, I combed through U.S. census data and found some interesting trends in the migration patterns of Americans at different income levels. For the second objective, I chose to emulate the style of FiveThirtyEight (as it looked in fall 2015). The resemblance is purely for educational purposes.",
    "skills": "HTML5, CSS3, JavaScript, jQuery, HighCharts.js, cartoDB",
    "fileUnder":"web development, data visualization/journalism"
  },
    {
    "name": "Fingers: Fact & Fiction",
    "link": "http://scottcgeier.com/fingers",
    "category":"Web Development",
    "id": "G4pR3K5",
    "thumbnail":"/img/fingers.png",
    "description": "Ever wonder where the word 'pinky' comes from? Why do most people wear wedding rings on the third finger of their left hand? The answers to these questions and more can be found in this interactive slider.",
    "skills": "HTML5, CSS3, JavaScript, jQuery",
    "fileUnder":"web development, journalism"
  },
  {
    "name": "What I'm Probably Doing Right Now",
    "link": "http://scottcgeier.com",
    "category":"Web Development",
    "id": "B9eL8D3",
    "thumbnail":"/img/clock.png",
    "description": "I'm a private investigator, freelance journalist, and the father of three kids. My schedule varies widely depending on the day and time. So I built working, analog SVG clock that updates my status.",
    "skills": "HTML5, CSS3, Illustrator, JavaScript",
    "fileUnder":"web development, sense of humor"
  },
    {
    "name": "A Lesson In Honeysuckle",
    "link": "http://southernthings.web.unc.edu/honeysuckle/",
    "category":"writing",
    "id": "A5fJ4K1",
    "thumbnail":"/img/honeysuckle-bush-cc.jpg",
    "description": "You can find some interesting things in the woods. Like a memory from your childhood.",
    "skills": "'Southern Things' magazine, Fall 2015",
    "fileUnder":""
  },
  {
    "name": "Happy Strangers Singing: An Ethnography",
    "link": "/img/PopUp_intro.pdf",
    "category":"writing",
    "id": "H4gA2P4",
    "thumbnail":"/img/popup.jpeg",
    "description": "In 2015, I wrote an ethnography of PopUp Chorus, an ad hoc vocal group that invites people to show up on the spot and sing pop and indie rock songs. Exactly who were these people? Why did they do it? Why was it so much damn fun? I spent four months finding out.",
    "skills": "This was part of a graduate ethnography class at the University of North Carolina. Additional chapters can be provided upon request.",
    "fileUnder":""
  },
    {
    "name": "Millennium Memory Project: Interactive Cartoons",
    "link": "/img/millennium_cartoons.pdf",
    "category":"graphics",
    "id": "V9jR7l2",
    "thumbnail":"/img/mmp-combo2.jpg",
    "description": "For the Millennium Memory Project, I drew cartoons in Illustrator, exported them as SVG code, and dropped the code into my HTML files. This allowed me to create interactive graphics (e.g., a VHS video player with working control buttons).",
    "skills": "Adobe Illustrator, JavaScript, jQuery",
    "fileUnder":""
  },
     {
    "name": "An Ethnopoetic Transcription of PopUp Chorus",
    "link": "/img/ethnopoetic.pdf",
    "category":"graphics",
    "id": "B7dRX2o5",
    "thumbnail":"/img/Seamus_ethnopoetic3.png",
    "description": "I made this poster during an ethnography of PopUp Chorus, an ad hoc vocal group in Durham, North Carolina, in 2015. The goal was to capture the style and essence of the choir director's speech -- his pitch, cadence, and inflection -- with just words. The transcription covers a moment from a rehearsal of Roberta Flack's hit song, 'Killing Me Softly With His Song.'",
    "skills": "Adobe Illustrator",
    "fileUnder":""
  },
      {
    "name": "Fingers: Fact & Fiction",
    "link": "http://scottcgeier.com/fingers",
    "category":"graphics",
    "id": "S1aN4z9",
    "thumbnail":"/img/hand.png",
    "description": "To create the illustrations for an educational slider about fingers, I took high-contrast pictures of my own hand and used Adobe Shape (now called Adobe Capture CC) to turn them into vector graphics. I then washed over the image with pastel colors and added an art deco font to give the slides a retro look.",
    "skills": "Adobe Shape, Illustrator",
    "fileUnder":""
  }
]